import {RouterNames} from "../../enums/RouterNames";
import {Image} from "entities/image";
import {List, TextBlock} from "entities/text-block";
import {Superior} from "entities/superior";

export const unit1Page = {
    title: "Підрозділи",
    name: RouterNames.UNIT_1.name,
    titleImage: {id: 1} as Image,
    textBlocks: [
        {
            title: "Науковий центр зв’язку та інформатизації"
        } as TextBlock,
        {
            textContent: [
                "Науковий центр зв’язку та інформатизації ВІТІ відповідно до директиви Міністра оборони України від 30.08.07 № 7 визначений головною науковою установою в галузі дослідження проблем розвитку зв'язку та автоматизації управління військами, наукового супроводження розробок техніки зв'язку та автоматизації управління військами. НЦЗІ ВІТІ визначений базовою організацією з військової стандартизації техніки зв'язку і автоматизації управління військами відповідно до Наказу начальника Генерального штабу Збройних Сил України від 08.01.03 № 1."
            ]
        } as TextBlock,
        {
            superiors: [
                {
                    fullName: "КОЛАЧОВ Сергій Петрович",
                    position: "Начальник наукового центру зв'язку та інформатизації",
                    achievements: [
                        "кандидат технічних наук",
                        "старший науковий співробітник",
                        "участник бойових дій"
                    ],
                    image: {
                        id: 1,
                        contentType: "",
                        imageFilename: ""
                    } as Image,
                    militaryRank: 'полковник'
                } as Superior
            ]
        } as TextBlock,
        {
            textContent: [
                "Основним напрямом діяльності НЦЗІ ВІТІ є виконання НДДКР, відпрацювання оперативних постановок, наукове супроводження та впровадження результатів дослідно-конструкторських робіт.",
                "Основна мета діяльності НЦЗІ ВІ ТІ- забезпечення реалізації державної політики у сфері науки, науково-технічної, інноваційної діяльності та інтелектуальної власності в системі Міністерства освіти і науки та Міністерства оборони України, інших галузевих міністерств."
            ]
        } as TextBlock,
        {
            images: [
                {
                    id: 1,
                    contentType: "",
                    imageFilename: ""
                } as Image,
                {
                    id: 1,
                    contentType: "",
                    imageFilename: ""
                } as Image,
            ]
        } as TextBlock,
        {
            textContent: [
                "На НЦЗІ ВІТІ покладаються завдання щодо планування, організації і безпосереднього здійснення всіх видів і форм наукової та науково-технічної діяльності з проблем воєнної науки на замовлення (за договорами, оперативними завданнями) органам державної виконавчої влади, структурних підрозділів центрального апарату Міністерства оборони України, Генерального штабу Збройних Сил України і видів Збройних Сил України, органів місцевого самоврядування, підприємств, установ і організацій."
            ]
        } as TextBlock,
        {
            uLists: [
                {
                    title: "<strong>Основні завдання діяльності Наукового центру:</strong>",
                    items: [
                        "створення ідеології і концептуальних засад побудови інформаційних систем Збройних Сил України;",
                        "дослідження проблем розвитку теорії управління Збройними Силами України, шляхів удосконалення системи управління військами (силами);",
                        "визначення перспективних напрямків розвитку систем, комплексів (засобів) спеціального зв’язку, контролю безпеки зв’язку;",
                        "проведення науково-технічної експертизи наукових та науково-прикладних результатів з питань оцінки відповідності проектних рішень тактико-технічним завданням;",
                        "дослідження проблем функціонування та розвитку систем та технологій зв’язку;",
                        "розробки методологічного апарату оцінки властивостей інформаційних систем спеціального призначення;",
                        "дослідження перспективних напрямків розвитку технічного забезпечення систем зв’язку та автоматизації і визначення шляхів їх реалізації;",
                        "проведення державної експертизи у сфері технічного захисту інформації;",
                        "забезпечення наукової та науково-технічної взаємодії ВІТІ ДУТ з іншими науковими організаціями і освітніми установами України та іноземних держав;",
                        "забезпечення в межах своєї компетенції державної політики у сфері охорони та захисту державної таємниці, інформації з обмеженим доступом, що є власністю держави, та службової інформації, яка згідно з законодавством не підлягає розголошенню;",
                        "дослідження проблем технічної експлуатації систем (комплексів, засобів) зв’язку та автоматизації Збройних Сил України;",
                        "виконання робіт із забезпечення єдності вимірювань у сфері військового управління та зв’язку;",
                        "участь у розробці та удосконаленні інформаційної інфраструктури Збройних Сил України;",
                        "участь у перепідготовці та підвищенні кваліфікації кадрів;",
                        "підготовка кадрів вищої кваліфікації через аспірантуру та докторантуру;",
                        "залучення до науково-технічної діяльності військовослужбовців та працівників Збройних Сил України у відповідності до чинного законодавства;",
                        "проведення НДДКР, тематичних досліджень щодо розробки систем (комплексів, засобів) криптографічного захисту секретної та конфіденційної інформації;",
                        "сертифікація систем, технічних засобів та послуг зв’язку, які призначені для застосування у Збройних Силах України;",
                        "створення суб'єктам наукової і науково-технічної діяльності необхідних умов, які стимулюють" +
                        " розробку технічних і технологічних нововведень, забезпечують скорочення інноваційного циклу «наука – виробництво»;",
                        "участь у проведенні оглядів-конкурсів на кращу науково-технічну розробку;",
                        "оновлення експериментальної та матеріально-технічної бази за рахунок коштів, отриманих для виконання окремих конкретних доручень від підприємств, організацій чи фізичних осіб, а також від інших бюджетних установ;",
                        "участь у проведенні науково-технічних конференцій, семінарів, виставок, презентацій тощо;",
                        "підготовка та поширення рекламних матеріалів НДДКР;",
                        "нормативно-методичне та інформаційно-довідкове забезпечення науково-технічної діяльності ВІТІ ДУТ, структурних підрозділів центрального апарату Міністерства оборони України, Генерального штабу Збройних Сил України і видів Збройних Сил України з проблем розвитку зв'язку та автоматизації Збройних Сил України;",
                        "визначення та обґрунтування шляхів та напрямків досягнення сумісності системи зв'язку та інформатизації Збройних Сил України з системами зв'язку та інформатизації Збройних Сил країн НАТО, країн-партнерів Альянсу, інших іноземних держав;",
                        "забезпечення інтеграції військової науки та військової освіти;",
                        "розроблення оперативно-тактичних та тактико-технічних вимог до перспективних систем зв'язку та вузлів зв'язку, окремих комплексів, зразків, засобів зв'язку та автоматизації;",
                        "участь у випробуваннях зразків засобів зв’язку та автоматизації;"
                    ]
                } as List,
                {
                    title: "<strong>Наукове супроводження:</strong>",
                    items: [
                        "заходів інтеграції системи управління Збройними Силами України в єдину систему" +
                        " загальнодержавного управління, створення умов для входження її в інформаційні структури європейської та трансатлантичної безпеки на основі використаної єдиних міжнародних стандартів;",
                        "заходів реалізації міжнародного військово-технічного співробітництва;",
                        "реалізації заходів оборонного розвитку Загальнодержавної національної космічної програми України на 2007-2011 роки;",
                        "НДДКР з питань технічного та криптографічного захисту інформації Збройних Сил України;",
                        "створення цифрової інтегральної мережі зв'язку Збройних Сил України, інтегрованої до" +
                        " телекомунікаційних мереж України;",
                        "проведення наукових досліджень на навчаннях та інших заходах оперативної, мобілізаційної і бойової підготовки"
                    ]
                } as List
            ]
        } as TextBlock,
        {
            images: [
                {
                    id: 1,
                    contentType: "",
                    imageFilename: ""
                } as Image,
                {
                    id: 1,
                    contentType: "",
                    imageFilename: ""
                } as Image,
            ]
        } as TextBlock,
        {
            textContent: [
                "<strong>Можливі напрямки надання наукових послуг НЦЗІ ВІТІ</strong>",
                "Перелік платних послуг, що можуть надаватися за напрямками захисту інформації, електромагнітна сумісність радіоелектронних засобів, автоматизації, зв’язку, кібернетичного захисту"
            ]
        } as TextBlock,
        {
            uLists: [
                {
                    title: "Наукова та науково-технічна експертиза:",
                    items: [
                        "результатів виконання наукових і науково-технічних програм, інноваційних програм щодо розвитку озброєння і військової техніки;",
                        "результатів виконання ініціативних НДДКР;",
                        "дисертаційних досліджень, науково-технічної документації на раціоналізаторські пропозиції, винаходи;",
                        "ефективності науково-технічних та інноваційних проектів;"
                    ]
                } as List
            ]
        } as TextBlock,
        {
            uLists: [
                {
                    title: "<string>Перелік платних послуг, що можуть надаватися за напрямком захисту інформації:</string>",
                    items: [
                        "створення КТЗІ",
                        "випробування та атестація КТЗІ",
                        "пошук закладних пристроїв",
                        "створення КСЗІ",
                        "проведення науково-дослідних робіт з розробки нормативних документів системи ТЗІ",
                        "проведення дослідно-конструкторських робіт з розробки засобів ТЗІ, засобів КЗІ, засобів" +
                        " спеціального зв’язку та іншого радіоелектронного обладнання",
                        "проведення робіт з сертифікації засобів зв’язку, засобів ТЗІ, засобів спеціального зв’язку, засобів КЗІ та спеціальних поглинаючих матеріалів, які призначені для об’єктів та техніки в захищеному виконанні",
                        "наукова та науково-технічна експертиза НДР та ДКР з питань захисту інформації",
                        "випробування обладнання, конструкцій, виробів, матеріалів щодо виконання вимог по електромагнітній сумісності",
                        "надання консультацій з питань наукових досліджень, їх організації та наукового обслуговування, послуг з розроблення науково-технічної документації на науково-технічну продукцію в галузі захисту інформації",
                        "організація підвищення кваліфікації спеціалістів в галузі захисту інформації",
                        "забезпечення розроблення державних стандартів і технічних умов на виробництво засобів ТЗІ, проведення її сертифікаційних випробувань"
                    ]
                } as List,
                {
                    title: "<string>Перелік платних послуг, що можуть надаватися за напрямком метрології та стандартизації:</string>",
                    items: [
                        "проведення робіт з діагностики, стандартизації та метрологічного забезпечення,:",
                        "метрологічна атестація засобів вимірювальної техніки (ЗВТ);",
                        "повірка ЗВТ;",
                        "калібрування ЗВТ;",
                        "атестація випробувального (лабораторного) обладнання;",
                        "проведення вимірювань;",
                        "державні випробування ЗВТ;",
                        "розробка методик повірки, калібрування, атестації ЗВТ;",
                        "розробка та експертиза методик виконання вимірювань;",
                        "атестація вимірювальних лабораторій і перевірка вже атестованих;",
                        "ведення переліку атестованих вимірювальних лабораторій України;",
                        "узгодження переліків ЗВТ, які знаходяться в експлуатації на підприємствах та в організаціях і підлягають повірці;",
                        "проведення метрологічної експертизи технічної документації на ЗВТ, що ввозяться на територію України;",
                        "виконання робіт з метрологічного забезпечення інформаційних вимірювальних систем, вимірювальних і обчислювальних каналів автоматизованих систем управління технологічними процесами;",
                        "методична допомога метрологічним службам підприємств і організацій;",
                        "метрологічної експертизи документації ЗВП на всіх етапах її життєвого циклу;",
                        "забезпечення розроблення державних стандартів і технічних умов на виробництво продукції, проведення її сертифікаційних випробувань.",
                    ]
                } as List,
                {
                    title: "<string>Перелік платних послуг, що можуть надаватися за напрямком електромагнітна сумісність радіоелектронних засобів:</string>",
                    items: [
                        "проведення науково-дослідних, пошукових, проектно-пошукових та дослідно-конструкторських робіт з питань розподілу, виділення і присвоєння радіочастот, їх міжнародно-правового захисту, забезпечення електромагнітної сумісності радіоелектронних засобів.",
                        "наукова та науково-технічна експертиза електромагнітної сумісності радіоелектронних засобів.",
                        "натурні випробування радіоелектронних засобів з метою визначення їх електромагнітної сумісності.",
                        "розроблення, впровадження, реалізація та супровід програмних засобів і продуктів по визначенню електромагнітної сумісності радіоелектронних засобів.",
                        "організація та проведення наукових семінарів, конференцій з питань забезпечення електромагнітної сумісності радіоелектронних засобів.",
                        "організація навчання роботи з комп’ютерною технікою та методик статистичної обробки інформації в наукових дослідженнях та з питань забезпечення електромагнітної сумісності радіоелектронних засобів.",
                        "надання консультацій з питань наукових досліджень у галузі електромагнітної сумісності радіоелектронних засобів, їх організації;",
                        "надання послуг з розроблення науково-технічної документації на науково-технічну продукцію, натурний зразок в частині що стосується забезпечення електромагнітної сумісності радіоелектронних засобів.",
                    ]
                } as List,
                {
                    title: "<string>Перелік платних послуг, що можуть надаватися за напрямком автоматизації:</string>",
                    items: [
                        "проведення науково-дослідних, дослідно-конструкторських робіт які спрямовані на створення інформаційно-аналітичних систем та автоматизованих систем управління.",
                        "проектування та виготовлення експериментальних зразків інформаційних систем, впровадження нових інформаційних технологій в системи, комплекси і засоби автоматизації.",
                        "випробування обладнання, виробів, зразків та комплексів засобів автоматизації, що розробляються в рамках дослідно-конструкторських робіт щодо створення автоматизованих систем управління та їх підсистем.",
                        "розроблення державних та галузевих стандартів щодо створення автоматизованих систем управління.",
                        "послуги з розроблення науково-технічної документації на інформаційні системи та автоматизовані системи управління.",
                        "розроблення програмного продукту, впровадження, реалізація та супровід програмних засобів і продуктів.",
                        "надання консультацій з питань наукових досліджень спеціального програмного забезпечення, їх організації та наукового обслуговування, послуг з розроблення науково-технічної документації на спеціальне програмне забезпечення;",
                        "організація та проведення наукових семінарів, конференцій, симпозіумів, лекторіїв, виставок, тренінгів з питань автоматизованих систем управління;",
                        "послуги з забезпечення доступу до локальних і корпоративних комп'ютерних мереж, до мережі Інтернет, автоматизованих баз даних та пошукових систем.",
                    ]
                } as List,
                {
                    title: "<string>Перелік платних послуг, що можуть надаватися за напрямком зв’язку:</string>",
                    items: [
                        "проведення науково-дослідних, дослідно-конструкторських, проектно-конструкторських, технологічних, пошукових та проектно-пошукових робіт які спрямовані на створення інформаційно-телекомунікаційних мереж",
                        "організація та проведення наукових семінарів, конференцій, симпозіумів, лекторіїв, виставок, тренінгів з питань зв’язку",
                        "надання консультацій з питань наукових досліджень телекомунікаційних мереж, їх організації та обслуговування, послуг з розроблення науково-технічної документації на інформаційно-телекомунікаційні мережі",
                        "послуги з розроблення науково-технічної документації на телекомунікаційні мережі, що створюються",
                        "випробування обладнання, виробів, зразків та комплексів засобів",
                    ]
                } as List,
                {
                    title: "<string>Перелік платних послуг, що можуть надаватися за напрямком кібернетичного захисту:</string>",
                    items: [
                        "планування заходів з кіберзахисту;",
                        "організація навчання спеціалістів з питань кібербезпеки;",
                        "надання консультативних послуг по відновлення інформаційно-телекомунікаційних систем від наслідків кібернетичних атак;",
                        "надання консультативних послуг по відновленню інформації;",
                        "надання консультативних послуг по розслідуванню інцендентів у кіберпросторі;",
                        "впровадження, реалізація та супровід програмних засобів і продуктів кіберзахисту;",
                        "забезпечення розроблення державних та галузевих стандартів з питань кіберзахисту;",
                        "наукова та науково-технічна експертиза НДР та ДКР з питань кібербезпеки;",
                        "надання консультацій з питань наукових досліджень, їх організації та наукового обслуговування, послуг з розроблення науково-технічної документації на науково-технічну продукцію в галузі кіберзахисту;\n",
                        "підвищення кваліфікації спеціалістів з кіберзахисту інформаційно-телекомунікаційних систем;",
                        "проведення робіт з кіберзахисту локальних та глобальних мереж."
                    ]
                } as List
            ]
        } as TextBlock,
    ]
}