import {Page} from "../../../../entities/page";
import {Image} from "../../../../entities/image";
import {RouterNames} from "../../../enums/RouterNames";
import {Superior} from "../../../../entities/superior";
import {TextBlock} from "../../../../entities/text-block";
import {Row, RowElement, Table} from "../../../../entities/text-block/model/types";

export const department2Page: Page = {
    title: "Кафедри",
    titleImage: {id: 16254} as Image,
    name: RouterNames.DEPARTMENTS.subLinks[1].name,
    textBlocks: [
        {
            title: "Кафедра Іноземних мов",
        },
        {
            textContent: [
                " є загальноінститутською кафедрою, яка здійснює підготовку висококваліфікованих офіцерських кадрів для Збройних Сил України та інших військових формувань. Основний акцент в підготовці фахівців викладацьким складом кафедри робиться на вдосконаленні мовної компетентності фахівців, приведення її у відповідність з міжнародними стандартами та сучасними потребами щодо забезпечення мовної взаємосумісності органів управління, частин та підрозділів Збройних Сил України з військовими формуваннями міжнародних організацій та країн-партнерів НАТО у рамках реалізації заходів міжнародного співробітництва."
            ]
        },
        {
            superiors: [{
                fullName: "КАПАНАЙКО Ірина Ярославівна",
                militaryRank: "Пр. ЗСУ",
                achievements: [
                    "кандидат філологічних наук"
                ],
                position: "Завідувач кафедри іноземних мов",
                image: {
                    id: 1,
                    contentType: "",
                    imageFilename: ""
                } as Image,
            } as Superior]
        },
        {
            textContent: [
                "Навчання проводиться за навчальними дисциплінами: Іноземна мова, Іноземна мова (військово-спеціальна підготовка), Іноземна мова професійного спрямування, Ділова іноземна мова (для ад’юнктів). Завданням кафедри під час вивчення іноземної мови є розвиток у курсантів професійно орієнтованої міжкультурної комунікативної компетентності. Ця компетентність є результатом взаємодії та комплексної реалізації низки компетентностей, а саме, розвитку загальнонавчальної компетентності, формування та розвитку лінгвістичної мовної компетентності, розвитку іншомовної комунікативної компетентності, розвитку соціокультурної та прагматичної компетентностей. Зазначені компетентності формують професійну комунікативну компетентність особистості курсанта (слухача, ад’юнкта), здатного брати безпосередню участь у розв’язанні важливих проблем та професійних завдань іноземною мовою.\n",
                "Науково-педагогічні працівники кафедри забезпечують якісне проведення практичних занять, використовуючи сучасні навчально-методичні комплекси.",
                "На кафедрі працює 9 викладачів та 2 працівники лаборантського складу, які забезпечують навчальний процес.\n",
                "Значна увага на кафедрі приділяється підвищенню кваліфікації викладачів та їх професійному самовдосконаленню. Основними напрямками наукових досліджень кафедри є: лінгвістичні, методичні та педагогічні засади взаємопов’язаного навчання різних видів мовленнєвої діяльності, шляхи поповнення словникового запасу мови, психолінгвістичні аспекти підвищення ефективності викладання іноземних мов, удосконалення професійно-орієнтованої іншомовної підготовки як фактор підвищення ефективності діяльності працівників."
            ]
        } as TextBlock,
        {
            title: "Розклад додаткових консультативних занять.",
            tables: [
                {
                    headers: [
                        "День тижня",
                        "Назва курсу",
                        "Час проведення",
                        "Куратори курсу"
                    ],
                    rows: [
                        {
                            elements: [
                                {value: ["ПОНЕДІЛОК"]} as RowElement,
                                {value: ["Advanced Grammar Lab / Підвищений курс Граматики"]} as RowElement,
                                {value: ["16.00 – 16.45"]} as RowElement,
                                {value: ["Бокій В.І., Дідурик А.І."]} as RowElement
                            ]
                        } as Row,
                        {
                            elements: [
                                {value: ["ВІВТОРОК"]} as RowElement,
                                {value: ["Speaking Booster (for officers) / Розмовний курс для офіцерів"]} as RowElement,
                                {value: ["16.00 – 16.45"]} as RowElement,
                                {value: ["Циганкова З.М., Бецько О.С"]} as RowElement
                            ]
                        } as Row,
                        {
                            elements: [
                                {value: ["СЕРЕДА"]} as RowElement,
                                {value: ["Basic Grammar Lab / Початковий курс Граматики"]} as RowElement,
                                {value: ["16.00 – 16.45"]} as RowElement,
                                {value: ["Шаблій О.С., Задорожна О."]} as RowElement
                            ]
                        } as Row,
                        {
                            elements: [
                                {value: ["ЧЕТВЕР"]} as RowElement,
                                {value: ["Speaking Club (for cadets) / Розмовний клуб для курсантів"]} as RowElement,
                                {value: ["16.00 – 16.45"]} as RowElement,
                                {value: ["Храбан Т.Є., Лемещенко А."]} as RowElement
                            ]
                        } as Row,
                        {
                            elements: [
                                {value: ["П’ЯТНИЦЯ"]} as RowElement,
                                {value: ["Pronunciation Course"]} as RowElement,
                                {value: ["16.00 – 16.45"]} as RowElement,
                                {value: ["Куценко М.А., Дзіман А.М."]} as RowElement
                            ]
                        } as Row,
                    ],
                } as Table
            ]
        } as TextBlock,
        {
            textContent: [
                "Відвідання занять буде проводитися за попереднім записом, який відкритий щоп’ятниці на кафедрі Іноземних мов у Навчальному кабінеті. Місце занять – 206 ауд."
            ],
            images: [
                {
                    id: 16473,
                    contentType: "",
                    imageFilename: ""
                } as Image,
                {
                    id: 16474,
                    contentType: "",
                    imageFilename: ""
                } as Image,
                {
                    id: 16475,
                    contentType: "",
                    imageFilename: ""
                } as Image,
                {
                    id: 16476,
                    contentType: "",
                    imageFilename: ""
                } as Image,
            ]
        } as TextBlock,
    ]
}