import {Image} from "../../../../entities/image";
import {RouterNames} from "../../../enums/RouterNames";
import {Superior} from "../../../../entities/superior";
import {TextBlock} from "../../../../entities/text-block";

export const department5Page = {
    title: "Кафедри",
    titleImage: {id: 16257} as Image,
    name: RouterNames.DEPARTMENTS.subLinks[4].name,
    textBlocks: [
        {
            title: "Кафедра математики та фізики",
            textContent: [
                "Кафедра забезпечує викладання фундаментальних <strong>математичних дисциплін</strong>(«Вища математика», «Теорія ймовірностей, імовірнісні процеси та математична статистика», «Теорія прийняття рішень») і <strong>фізики</strong> («Електрика і магнетизм», «Основи електродинаміки», «Основи квантової фізики», «Основи квантової механіки», «Фізика твердового тіла», «Фізика напвпровідників», «Контактні явища», «Квантова електроніка», «Ядерна фізика») для курсантів (студентів заочної форми навчання) усіх спеціальностей підготовки на трьох факультетах. З метою забезпечення високої якості навчального процесу підготовки курсантів, навчання на кафедрі організоване з урахуванням освітніх потреб учасників навчального процесу в частині поглибленого опанування програм навчальних дисциплін, як базових, для подальшого вивчення шляхом поєднання лекційного курсу з лабораторними та практичними заняттями, де кожний курсант активно включається в рішення поставлених завдань, а одержані результати запроваджує в практику навчання."
            ],
            superiors: [{
                image: {
                    id: 16487,
                    contentType: "",
                    imageFilename: ""
                } as Image,
                fullName: "РУДОМІНО-ДУСЯТСЬКА Ірина Анатоліївна",
                position: "Завідувач кафедри математики та фізики",
                militaryRank: "Пр. ЗСУ ",
                achievements: [
                    "кандидат фізико-математичних наук, доцент"
                ]
            } as Superior
            ]
        },
        {
            textContent: [
                "Протягом навчання курсанти отримують фундаментальну математичну підготовку, що поєднується з вмінням ставити, аналізувати і ефективно розв’язувати сучасні прикладні задачі та високими практичними навичками у подальшому програмуванні, вирішуванні завдання, які пов’язані з обробкою та аналізом даних.\n",
                "Метою кафедри є надання курсантам знань, які є необхідними для підготовки фахівців у галузях Інформаційних технологій, Електроніки та телекомунікації, Воєнних наук, національної безпеки, безпеки державного кордону.\n",
                "Стратегічним завданням кафедри залишається розробка дидактичних матеріалів, електронних посібників до занять з усіх навчальних дисциплін кафедри.\n",
                "На кафедрі працює 11 викладачів, з них 1 професор, кандидат фізико-математичних наук, доктор педагогічних наук, 4 доцента, кандидата фізико-математичних наук.",
                "Методичні матеріали (вища математика)\nМетодичні матеріали (фізика)",
            ]
        } as TextBlock
    ]
}