import {Page} from "../../entities/page";
import {RouterNames} from "../enums/RouterNames";
import {Image} from "../../entities/image";
import {List, TextBlock} from "../../entities/text-block";
import {Row, RowElement, Table} from "../../entities/text-block/model/types";
import {AccordionElement} from "../../entities/entrance";

export const entrancesPage: Page = {
    name: RouterNames.ENTRANTS.name,
    title: "Вступникам",
    titleImage: {id: 1} as Image,
    textBlocks: [
        {
            title: "Вступникам"
        } as TextBlock
    ],
    accordionElements: [
        {
            title: "Денна форма навчання ВІТІ",
            textBlocks: [
                {
                    textContent: [
                        "Оголошується прийом на навчання для здобуття вищої освіти (схема підготовки “курсант”) на денну форму навчання за рахунок видатків державного бюджету (для вступників на основі повної загальної середньої освіти)"
                    ],
                    tables: [
                        {
                            headers: [
                                " Ступінь вищої освіти бакалавр"
                            ],
                            rows: [
                                {
                                    elements: [
                                        {value: ["<strong>Галузі знань</strong>"]} as RowElement,
                                        {value: ["<strong>Спеціальність </strong>(спеціалізація)<strong>підготовки</strong>"]} as RowElement,
                                    ]
                                } as Row,
                                {
                                    elements: [
                                        {
                                            value: [
                                                "<strong>12 Інформаційні технології</strong>"
                                            ]
                                        } as RowElement,
                                        {
                                            value: [
                                                "<strong>122 Комп’ютерні науки</strong>\n (Математичне, інформаційне і програмне забезпечення \nвійськових інформаційних систем)",
                                                "<strong>125 Кібербезпека</strong> (Захист інформації та кібернетична безпека в інформаційно-телекомунікаційних системах)",
                                                "<strong>126 Інформаційні системи та технології</strong> (Автоматизовані системи управління військами та озброєнням)"
                                            ]
                                        } as RowElement,
                                        // {value: []} as RowElement,
                                    ]
                                } as Row,
                                {
                                    elements: [
                                        {value: ["<strong>17 Електроніка та телекомунікації</strong>"]} as RowElement,
                                        {value: ["<strong>172 Телекомунікації та радіотехніка </strong>(Системи військового зв'язку)"]} as RowElement,
                                    ]
                                } as Row,
                                {
                                    elements: [
                                        {value: ["<strong>25 Воєнні науки, національна безпека, безпека державного кордону</strong>"]} as RowElement,
                                        {
                                            value: [
                                                "<strong>172 Телекомунікації та радіотехніка </strong>(Системи військового зв'язку)",
                                                "<strong>253 Військове управління (за видами збройних сил)</strong> (Радіоелектронні інформаційні системи, оперативна техніка \n та спецозброєння)"
                                            ]
                                        } as RowElement,
                                    ]
                                } as Row,
                            ]
                        } as Table
                    ]
                } as TextBlock,
                {
                    textContent: [
                        "Нормативний термін навчання: 4 роки з можливістю подальшого вступу для здобуттям ступеня магістра (1,5 роки) за спеціальністю, 4 роки для спеціальності 253 Військове управління (за видами збройних сил) нормативний термін навчання - 4 роки.",

                    ]
                } as TextBlock,
                {
                    textContent: [
                        "<strong>Вступ буде відбуватися за:</strong>",
                        "<strong>або</strong> Мультипредметний тест 2022 року.\n",
                        "<strong>або</strong> ЗНО (2019, 2020, 2021 років):\n",
                    ],
                    oLists: [
                        {
                            items: [
                                "Українська мова.\n",
                                "Математика",
                                " Історія України або іноземна мова, або фізика, або географія, або хімія, або біологія.\n"
                            ]
                        } as List
                    ]
                } as TextBlock,
                {
                    textContent: [
                        "<strong>або</strong> очні іспити (українська мова, математика та історія України)",
                        "Вступники, які вступають на навчання до Військового інституту на денну форму навчання, крім надання сертифікату (сертифікатів) Українського центру оцінювання якості освіти або \n складання вступних екзаменів з конкурсних предметів, обов'язково проходять психологічне обстеження, оцінку рівня фізичної підготовки та медичний огляд військово-лікарською комісією."
                    ]
                } as TextBlock,
                {
                    oLists: [
                        {
                            title: "<strong>Строки прийому заяв і документів, вступних випробувань, конкурсного відбору та зарахування на навчання:</strong>",
                            items: [
                                "Початок прийому заяв, особових справ та документів відбірковою комісією Військового інституту на денну та заочну форми навчання -<strong> 20 липня 2022 року\n</strong>",
                                "Закінчення прийому заяв, особових справ та документів відбірковою комісією Військового інституту на денну та заочну форми навчання -<strong> до 18.00 07 серпня 2022 року\n</strong>",
                                "Вступні випробування (психологічне обстеження, оцінка рівня фізичної підготовленості, медичний огляд) -<strong> 08 серпня 2022 року - 20 серпня 2022 року\n</strong>",
                                "Проведення іспитів з української мови, історії України та математики -<strong> 08 серпня 2022 року - 20 серпня 2022 року\n</strong>",
                                "Термін видання наказу на зарахування вступників до Військового інституту на денну та заочну форми навчання -<strong> до 18.00 21 серпня 2022 року</strong>"
                            ]
                        } as List,
                        {
                            title: "<strong>Освітні програми:</strong>",
                            items: [
                                "Комп'ютерні науки та інформаційні технології.\n",
                                "Кібербезпека в інформаційно-телекомунікаційних системах.\n",
                                "Кіберрозвідка, системи та комплекси спеціального призначення.\n",
                                "Інформаційні системи та технології.\n",
                                "Телекомунікаційні системи та мережі.\n",
                                "Управління діями підрозділів зв'язку.\n",
                                "Спецозброєння та робототехнічні військові комплекси."
                            ]
                        } as List
                    ]
                } as TextBlock,
            ]
        } as AccordionElement,
        {
            title: "Денна форма навчання ВКСС ВІТІ",
            textBlocks: [
                {
                    textContent: [
                        "Оголошується набір для підготовки військових фахівців (схема підготовки “курсант”) на денну форму навчання за рахунок видатків державного бюджету (для вступників на основі повної загальної середньої освіти)"
                    ],
                    tables: [
                        {
                            headers: [
                                "Освітньо-професійний ступінь фаховий молодший бакалавр"
                            ],
                            rows: [
                                {
                                    elements: [
                                        {value: ["<strong>Галузі знань</strong>"]} as RowElement,
                                        {value: ["<strong>Спеціальність підготовки</strong>"]} as RowElement
                                    ]
                                } as Row,
                                {
                                    elements: [
                                        {value: ["<strong>12 Інформаційні технології</strong>"]} as RowElement,
                                        {value: ["<strong>122 Комп’ютерні науки</strong>", "<strong>125 Кібербезпека</strong>", "<strong>126 Інформаційні системи та технології</strong>"]} as RowElement
                                    ]
                                } as Row,
                                {
                                    elements: [
                                        {value: ["<strong>17 Електроніка та телекомунікації</strong>"]} as RowElement,
                                        {value: ["<strong>172 Телекомунікації та радіотехніка</strong>"]} as RowElement
                                    ]
                                } as Row,
                            ]
                        } as Table
                    ]
                } as TextBlock,
                {
                    textContent: [
                        "Нормативний термін навчання: <strong>4 роки</strong>"
                    ]
                } as TextBlock,
                {
                    textContent: [
                        "<strong>Вступ буде відбуватися за:</strong>",
                        "<strong>або</strong> Мультипредметний тест 2022 року.\n",
                        "<strong>або</strong> ЗНО (2019, 2020, 2021 років):\n",
                    ],
                    oLists: [
                        {
                            items: [
                                "Українська мова.\n",
                                "Математика",
                                " Історія України або іноземна мова, або фізика, або географія, або хімія, або біологія.\n"
                            ]
                        } as List
                    ]
                } as TextBlock,
                {
                    textContent: [
                        "<strong>або</strong> очні іспити (українська мова, математика та історія України)",
                    ]
                } as TextBlock
            ]
        } as AccordionElement,
        {
            title: "Заочна форма навчання",
            textBlocks: [
                {
                    textContent: [
                        "Оголошується набір на заочну форму навчання за рахунок видатків державного бюджету<strong> (для військовослужбовців військової служби за контрактом \n</strong>" +
                        "рядового, сержантського (старшинського) складу, які продовжили службу за новим контрактом)"
                    ],
                    tables: [
                        {
                            headers: [
                                "Освітньо-професійний ступінь фаховий молодший бакалавр"
                            ],
                            rows: [
                                {
                                    elements: [
                                        {value: ["<strong>Галузі знань</strong>"]} as RowElement,
                                        {value: ["<strong>Спеціальність підготовки</strong>"]} as RowElement
                                    ]
                                } as Row,
                                {
                                    elements: [
                                        {value: ["<strong>12 Інформаційні технології</strong>"]} as RowElement,
                                        {value: ["<strong>122 Комп’ютерні науки</strong>", "<strong>125 Кібербезпека</strong>", "<strong>126 Інформаційні системи та технології</strong>"]} as RowElement
                                    ]
                                } as Row,
                                {
                                    elements: [
                                        {value: ["<strong>17 Електроніка та телекомунікації</strong>"]} as RowElement,
                                        {value: ["<strong>172 Телекомунікації та радіотехніка</strong>"]} as RowElement
                                    ]
                                } as Row,
                            ]
                        } as Table
                    ]
                } as TextBlock,
                {
                    textContent: [
                        "Нормативний термін навчання: <strong>4 роки</strong>"
                    ]
                } as TextBlock,
                {
                    textContent: [
                        "<strong>Вступ буде відбуватися за:</strong>",
                        "<strong>або</strong> Мультипредметний тест 2022 року.\n",
                        "<strong>або</strong> ЗНО (2019, 2020, 2021 років):\n",
                    ],
                    oLists: [
                        {
                            items: [
                                "Українська мова.\n",
                                "Математика",
                                " Історія України або іноземна мова, або фізика, або географія, або хімія, або біологія.\n"
                            ]
                        } as List
                    ]
                } as TextBlock,
                {
                    textContent: [
                        "<strong>або</strong> очні іспити (українська мова, математика та історія України)",
                    ]
                } as TextBlock
            ]

        } as AccordionElement,
        {
            title: "Навчання в докторантурі та ад'юнктурі",
            textBlocks: [
                {
                    textContent: [
                        "Військовий інститут телекомунікацій та інформатизації імені Героїв Крут (далі - інститут) оголошує набір у 2022 році до очної докторантури та ад’юнктури за спеціальностями: \n" +
                        "126 інформаційні системи та технології, 255 озброєння та військова техніка.\n",
                        "До докторантури інституту приймаються офіцери Збройних Сил України віком не старше 47 років, які мають науковий ступінь доктора філософії (кандидата наук), \n" +
                        "наукові здобутки, опубліковані праці з обраної наукової спеціальності і які мають наукові результати, що потребують завершення або оформлення у вигляді дисертації, \n" +
                        "монографії чи наукової доповіді за сукупністю статей.\n",
                        "До ад’юнктури інституту приймаються офіцери Збройних Сил України у віком до 45 років включно, які перебувають на військовій службі, здобули вищу освіту ступеня магістра \n" +
                        "(освітньо-кваліфікаційний рівень спеціаліста), виявили здібності до педагогічної або науково-дослідної роботи та мають досвід служби у військах (силах) не менше 2 років.\n",
                        "При відборі кандидатів для вступу до докторантури та ад’юнктури перевага надається офіцерам – учасникам бойових дій.\n",
                        "Для зарахування кандидатом на вступ до очної докторантури та ад’юнктури необхідно до 1 лютого 2022 року подати рапорт на вступ за підпорядкованістю. Разом з рапортом, \n" +
                        "подаються документи, перелік яких наведений в „Правилах прийому до докторантури та ад’юнктури Військового інституту телекомунікацій та інформатизації \n" +
                        "за спеціальностями 126 інформаційні системи та технології, 255 озброєння та військова техніка”, які розміщені на офіційному сайті інституту.\n",
                        "Нормативний строк підготовки доктора філософії в ад’юнктурі становить чотири роки, а підготовки доктора наук у докторантурі - два роки.\n",
                        "Вступні іспити до ад’юнктури проводяться з 1 по 30 липня 2022 року.\n",
                        "Довідки за телефоном: 256-22-73."
                    ]
                } as TextBlock,
                {
                    textContent: [
                        "<strong>Вимоги до рівня освіти вступників</strong>: особи офіцерського складу віком не старше 47 років, які мають науковий ступінь доктора філософії (кандидата наук), наукові здобутки, \n" +
                        "опубліковані праці з обраної наукової спеціальності і які мають наукові результати, що потребують завершення або оформлення у вигляді дисертації, \n" +
                        "монографії чи наукової доповіді за сукупністю статей.",
                        "Оголошується набір до докторантури"
                    ],
                    tables: [
                        {
                            headers: [
                                "Освітньо-професійний ступінь <strong>доктор наук</strong>"
                            ],
                            rows: [
                                {
                                    elements: [
                                        {value: ["<strong>Галузі знань</strong>"]} as RowElement,
                                        {value: ["<strong>Спеціальність</strong> (спеціалізація) <strong>підготовки</strong>"]} as RowElement,
                                    ]
                                } as Row,
                                {
                                    elements: [
                                        {value: ["<strong>12 Інформаційні технології</strong>"]} as RowElement,
                                        {value: ["<strong>126 Інформаційні системи та технології</strong>"]} as RowElement,
                                    ]
                                } as Row,
                            ]
                        } as Table
                    ]
                } as TextBlock,
                {
                    textContent: [
                        "Нормативний термін навчання: <strong>2 роки</strong>"
                    ]
                } as TextBlock,
                {
                    textContent: [
                        "Оголошується набір до ад'юнктури",
                        "<strong>Вимоги до рівня освіти вступників:</strong> особи офіцерського складу віком не старше 45 років, які перебувають на військовій службі, здобули вищу освіту ступеня магістра (спеціаліста), \n" +
                        "виявили здібності до педагогічної або науково-дослідної роботи та мають досвід служби у військах (силах) не менше 2 років."
                    ],
                    tables: [
                        {
                            headers: [
                                "Освітньо-професійний ступінь <strong>доктор філософії</strong>"
                            ],
                            rows: [
                                {
                                    elements: [
                                        {value: ["<strong>Галузі знань</strong>"]} as RowElement,
                                        {value: ["<strong>Спеціальність</strong> (спеціалізація)<strong> підготовки</strong>"]} as RowElement,
                                    ]
                                } as Row,
                                {
                                    elements: [
                                        {value: ["<strong>12 Інформаційні технології</strong>"]} as RowElement,
                                        {value: ["<strong>126 Інформаційні системи та технології</strong>"]} as RowElement,

                                    ]
                                } as Row,
                                {
                                    elements: [
                                        {
                                            value: ["<strong>25 Воєнні науки, національна безпека, \n" +
                                            "безпека державного кордону</strong>"]
                                        } as RowElement,
                                        {value: ["<strong>255 Озброєння та військова техніка</strong>"]} as RowElement,
                                    ]
                                } as Row,
                            ]
                        } as Table
                    ]
                } as TextBlock,
                {
                    textContent: [
                        "Нормативний термін навчання:<strong> 4 роки</strong>"
                    ]
                } as TextBlock,
                {
                    textContent: [
                        "<strong>Додаткову інформацію про підготовку та вступ до Військового інституту телекомунікацій та інформатизації можна отримати електронною поштою за адресою:</strong>",
                        "vitivstup@viti.edu.ua\n",
                        "vitivstup@ukr.net"
                    ]
                } as TextBlock

            ]
        } as AccordionElement,
        {
            title: "Підготовка за програмою офіцерів запасу",
            textBlocks: [
                {
                    textContent: [
                        "Оголошується набір громадян України для підготовки за програмою офіцерів запасу з 03 березня по 31 липня 2022 року.",
                        "Набір громадян України для підготовки за програмою офіцерів запасу продовжено до<strong> 31 жовтня 2022 року.\n</strong>",
                        "Військову підготовку можуть проходити здобувачі вищої освіти (в тому числі особи жіночої статі) незалежно від форми навчання у вищих навчальних закладах та \n" +
                        "громадяни України, які мають освітній ступінь вищої освіти не нижче бакалавра, якщо їм на початок військової підготовки не виповнилося 40 років."
                    ]
                } as TextBlock,
                {
                    textContent: [
                        "<strong>Вартість навчання: 8 000 грн./семестр (2 роки навчання - 32 000 грн.).</strong>"
                    ]
                } as TextBlock,
                {
                    textContent: [
                        "Навчання громадян України здійснюється методом “військового дня” без відриву від основного місця навчання або роботи протягом 2 років.\n",
                        "Після закінчення навчання присвоюється військове звання – <strong>„молодший лейтенант запасу” Збройних Сил України.</strong>"
                    ],
                    oLists: [
                        {
                            title: "<strong>Військово-облікові спеціальності за якими здійснюється підготовка за програмою офіцерів запасу</strong>",
                            items: [
                                "Організація захисту інформації та кібернетична безпека в інформаційно-комунікаційних системах\n" +
                                "Застосування змішаних з’єднань, військових частин і підрозділів (крім підрозділів і військових частин зв’язку та радіотехнічного забезпечення авіації)\n",

                                "Математичне та програмне забезпечення функціонування автоматизованих систем\n",

                                "Експлуатація та ремонт наземної апаратури радіозв’язку різної потужності\n",

                                "Технічне забезпечення функціонування автоматизованих систем управління\n",

                                "Експлуатація та ремонт автомобільної техніки та її аналогів\n",
                                "Організація морально-психологічного забезпечення військ (сил)"
                            ]
                        } as List
                    ]
                } as TextBlock,
                {
                    textContent: [
                        "<strong>1) Абітурієнту до початку конкурсного відбору НЕОБХІДНО:</strong>"
                    ],
                    tables: [
                        {
                            rows: [
                                {
                                    elements: [
                                        {value: ["<strong>Якщо Ви здобувач вищої освіти</strong>"]} as RowElement,
                                        {value: ["<strong>Якщо у Вас вже є вища освіта</strong>"]} as RowElement,
                                    ]
                                } as Row,
                                {
                                    elements: [
                                        {
                                            value: ["Подати до приймальної комісії заяву підписану \n" +
                                            "деканом факультету (з основного місця навчання) \n" +
                                            "про бажання проходити військову підготовку"]
                                        } as RowElement,
                                        {
                                            value: ["Подати до приймальної комісії заяву на ім’я голови \n" +
                                            "відбіркової комісії, про бажання проходити військову підготовку"]
                                        } as RowElement,
                                    ]
                                } as Row,
                                {
                                    elements: [
                                        {value: ["<strong>до заяви додати</strong>"]} as RowElement,
                                        {value: ["<strong>до заяви додати</strong>"]} as RowElement,
                                    ]
                                } as Row,
                                {
                                    elements: [
                                        {value: ["4 фото 3х4"]} as RowElement,
                                        {value: ["4 фото 3х4"]} as RowElement,
                                    ]
                                } as Row,
                                {
                                    elements: [
                                        {value: ["копію паспорта громадянина України (1, 2, 11 сторінки)"]} as RowElement,
                                        {value: ["копію паспорта громадянина України (1, 2, 11 сторінки)"]} as RowElement,
                                    ]
                                } as Row,
                                {
                                    elements: [
                                        {
                                            value: ["копію довідки про присвоєння реєстраційного номера \n" +
                                            "облікової картки платника податків"]
                                        } as RowElement,
                                        {
                                            value: ["копію довідки про присвоєння реєстраційного номера \n" +
                                            "облікової картки платника податків"]
                                        } as RowElement,
                                    ]
                                } as Row,
                                {
                                    elements: [
                                        {
                                            value: ["копію посвідчення про приписку до призовної дільниці \n" +
                                            "(для осіб чоловічої статі)"]
                                        } as RowElement,
                                        {
                                            value: ["копію посвідчення про приписку до призовної дільниці \n" +
                                            "(для осіб чоловічої статі)"]
                                        } as RowElement,
                                    ]
                                } as Row,
                                {
                                    elements: [
                                        {
                                            value: ["витяг з навчальної картки з оцінками, \n" +
                                            "завіренний печаткою у деканаті"]
                                        } as RowElement,
                                        {value: ["копію диплому про вищу освіту, та додатка до нього"]} as RowElement,
                                    ]
                                } as Row,
                                {
                                    elements: [
                                        {value: ["пройти військово-лікарську комісію за місцем перебування на військовому обліку (Направлення для проходження військово-лікарської комісії видається на кафедрі військової підготовки Військового інституту телекомунікацій та інформатизації за адресою: м. Київ, вул. Московська 45/1 з 9:00 до 17:00 щоденно, крім суботи та неділі)"]} as RowElement,
                                        {value: ["пройти військово-лікарську комісію за місцем перебування на військовому обліку (Направлення для проходження військово-лікарської комісії видається на кафедрі військової підготовки Військового інституту телекомунікацій та інформатизації за адресою: м. Київ, вул. Московська 45/1 з 9:00 до 17:00 щоденно, крім суботи та неділі)"]} as RowElement,
                                    ]
                                } as Row,

                            ]
                        } as Table
                    ]
                } as TextBlock,
                {
                    textContent: [
                        "<strong>2) Відбіркова комісія розглядає:\n</strong>"
                    ],
                    tables: [
                        {
                            rows: [
                                {
                                    elements: [
                                        {
                                            value: ["Придатність до військової служби за висновками \n" +
                                            "Військово-лікарської комісії"]
                                        } as RowElement,
                                        {
                                            value: ["Придатність до військової служби за висновками \n" +
                                            "Військово-лікарської комісії"]
                                        } as RowElement,
                                    ]
                                } as Row,
                                {
                                    elements: [
                                        {value: ["Рівень успішності навчання здобувачів вищої освіти"]} as RowElement,
                                        {value: ["Рівень результатів навчання громадян у ВНЗ"]} as RowElement,
                                    ]
                                } as Row,
                                {
                                    elements: [
                                        {value: ["Рівень фізичної підготовки громадян"]} as RowElement,
                                        {value: ["Рівень фізичної підготовки громадян"]} as RowElement,
                                    ]
                                } as Row,
                                {
                                    elements: [
                                        {value: ["Засвоєння громадянами програми допризивної підготовки"]} as RowElement,
                                        {value: ["Засвоєння громадянами програми допризивної підготовки"]} as RowElement,
                                    ]
                                } as Row,
                            ]
                        } as Table
                    ]
                } as TextBlock,
                {
                    textContent: [
                        "<strong>3) Для участі у конкурсному відборі необхідно:</strong>",
                        "В день проведення конкурсного відбору (день буде доведений до абітурієнта під час подачі документів до приймальної комісії) прибути о 14 год.00 хв. \n" +
                        "у Військовий інститут телекомунікацій та інформатизації\n",
                        "При собі мати паспорт, приписне свідоцтво або військовий квиток, довідку з висновком військово-лікарської комісії про придатність до військової служби \n" +
                        "(ксерокопії не приймаються)."
                    ]
                } as TextBlock,
                {
                    textContent: [
                        "<strong>Довідка за телефонами:</strong>",
                        "098-233-46-07, 050-959-24-39, (044) 256-22-59, (044) 256-23-94\n"
                    ]
                } as TextBlock,
                {
                    textContent: [
                        "Додаткову інформацію про підготовку та вступ до Військового інституту телекомунікацій та інформатизації можна отримати електронною поштою за адресою:",
                        "vitivstup@viti.edu.ua\n",
                        "vitivstup@ukr.net",
                    ]
                } as TextBlock
            ]

        } as AccordionElement,

    ]
}
