import {Page} from "../../../entities/page";
import {Image} from "../../../entities/image";
import {RouterNames} from "../../enums/RouterNames";
import {Superior} from "../../../entities/superior";
import {List, TextBlock} from "../../../entities/text-block";

export const department4Page: Page = {
    title: "Кафедри",
    titleImage: {id: 16256} as Image,
    name: RouterNames.DEPARTMENT_4.name,
    textBlocks: [
        {
            title: "Кафедра військово-гуманітарних дисциплін",
            textContent: [
                "Кафедра призначена для провадження освітньої, методичної та наукової діяльності за всіма напрями підготовки та спеціальностями (спеціалізаціями) інституту по гуманітарним та соціально-економічним дисциплінам."
            ]
        },

        {
            superiors: [{
                fullName: "САЄНКО Олександр Григорович",
                position: "Начальник кафедри",
                militaryRank: "полковник",
                achievements: [
                    "кандидат технічних наук"
                ],
                image: {
                    id: 16482,
                    contentType: "",
                    imageFilename: ""
                } as Image,
            } as Superior,]
        },
        {
            uLists: [
                {
                    title: "Основні дисципліни кафедри:",
                    items: [
                        "Історія України та української культури;",
                        "Українська мова за професійним спрямуванням;",
                        "Філософія (філософія, релігієзнавство, логіка, етика, естетика);",
                        "Політологія та соціологія;",
                        "Правознавство (у тому числі основи військового законодавства та міжнародне гуманітарне право);",
                        "Військова педагогіка та психологія;",
                        "Морально-психологічне забезпечення підготовки та застосування Збройних Сил України.",
                    ]
                } as List,
                {
                    title: "Характеристика науково-педагогічних працівників кафедри:",
                    items: [
                        "Докторів наук – 1;",
                        "Кандидатів наук – 5;",
                        "Професорів – 1;",
                        "Доцентів – 3.",
                    ]
                } as List,
                {
                    title: "У своєму складі кафедра має навчальний кабінет, який дозволяє курсантам (студентам), ад’юнктам (здобувачам) під час самостійної роботи більш якісно готуватись до навчальних занять та займатись науковою роботою. У своєму розпорядженні він має:",
                    items: [
                        "більш 800 сучасних підручників навчального, наукового та навчально-методичного характеру;",
                        "100% підручників у електронному вигляді, які були віданні кафедрою;",
                        "електронну базу законодавства України щодо військових питань.",
                    ]
                } as List,
            ]
        } as TextBlock,
        {
            images: [
                {
                    id: 16483,
                    contentType: "",
                    imageFilename: ""
                } as Image,
                {
                    id: 16484,
                    contentType: "",
                    imageFilename: ""
                } as Image,
                {
                    id: 16485,
                    contentType: "",
                    imageFilename: ""
                } as Image,
                {
                    id: 16486,
                    contentType: "",
                    imageFilename: ""
                } as Image,
            ]
        } as TextBlock,
    ]
}