import {Page} from "../../../entities/page";
import {Image} from "../../../entities/image";
import {RouterNames} from "../../enums/RouterNames";
import {List, TextBlock} from "../../../entities/text-block";
import {Superior} from "../../../entities/superior";

export const department1Page: Page = {
    titleImage: {id: 1} as Image,
    title: "Кафедри",
    name: RouterNames.DEPARTMENT_1.name,
    textBlocks: [
        {
            title: "Кафедра загальної тактики",
        },
        {
            textContent: [
                "Кафедра загальної тактики є базовим структурним підрозділ інституту що провадить освітню, методичну та наукову діяльність за всіма спеціальностями та спеціалізаціями підготовки курсантів (слухачів, студентів).\n"
            ],
        },
        {
            uLists: [
                {
                    title: "Головними завданнями кафедри є:",
                    items: [
                        "виховування майбутніх офіцерів з твердою командирською волею та ініціативою, здатних самостійно вирішувати поставлені завдання та нести відповідальність за прийняті рішення;\n",
                        "навчання курсантів теорії та практиці застосування підрозділів Сухопутних військ в сучасному загальновійськовому бою, формам та способам тактичних дій, вмілому управлінню підрозділами в бою з дотриманням норм міжнародного гуманітарного права;\n",
                        "реалізація на практиці вимог начальника військ зв’язку Збройних Сил України – начальника Головного управління зв’язку та інформаційних систем Генерального штабу Збройних Сил України до випускників інституту в питаннях загальновійськової підготовки;\n",
                        "впровадження у підготовку курсантів (слухачів, студентів) інституту нових форм підготовки з урахуванням вимог стандартів НАТО та досвіду застосування Збройних сил України в антитерористичній операції.",
                    ]
                } as List
            ]
        },
        {
            superiors: [{
                fullName: "ПАВЛЕНКО Олег Анатолійович",
                militaryRank: "полковник",
                achievements: [
                    "кандидат педагогічних наук"
                ],
                position: "Начальник кафедри",
                image: {
                    id: 1,
                    contentType: "",
                    imageFilename: ""
                } as Image,
            } as Superior
            ]
        } as TextBlock,
        {
            textContent: [
                "На кафедрі викладаються наступні дисципліни: загальна тактика, основи військового управління (в тому числі штабні процедури НАТО), управління повсякденною діяльністю військ, інженерна підготовка, військова топографія, радіаційний, хімічний, біологічний захист підрозділів (в тому числі екологія), бойова система виживання воїна (у тому числі військово-медична підготовка), стрілецька зброя та вогнева підготовка, а також історія війн та воєнного мистецтва (у тому числі історія українського війська)."
            ],
            images: [
                {
                    id: 1,
                    contentType: "",
                    imageFilename: ""
                } as Image,
                {
                    id: 1,
                    contentType: "",
                    imageFilename: ""
                } as Image,
                {
                    id: 1,
                    contentType: "",
                    imageFilename: ""
                } as Image,
                {
                    id: 1,
                    contentType: "",
                    imageFilename: ""
                } as Image,
                {
                    id: 1,
                    contentType: "",
                    imageFilename: ""
                } as Image,
                {
                    id: 1,
                    contentType: "",
                    imageFilename: ""
                } as Image,
            ]
        } as TextBlock
    ]
}