import {Image} from "entities/image";
import {RouterNames} from "../../enums/RouterNames";
import {List, TextBlock} from "entities/text-block";

export const department6Page = {
    title: "Кафедри",
    titleImage: {id: 16258} as Image,
    name: RouterNames.DEPARTMENT_6.name,
    textBlocks: [
        {
            title: "Кафедра військової підготовки",

            textContent: [
                "Кафедра військової підготовки Військового інституту телекомунікацій та інформатизації здійснює підготовку громадян України за програмою підготовки офіцерів запасу за державним замовлення та за кошти фізичних осіб для Головного Управління військ зв’язку та інформаційних систем, Повітряних Сил Збройних Сил України,Військово-Морських Сил Збройних Сил України, Сухопутних військ Збройних Сил України, Головного управління по роботі з особовим складом Збройних Сил України, Департаменту фінансів Міністерства Оборони України, Центрального управління захисту інформації та криптології ГШ Збройних Сил України за 14 військово - обліковими спеціальностями."
            ],
            superiors: [
                {
                    militaryRank: "полковник",
                    fullName: "ТКАЧЕНКО Дмитро Віталійович",
                    position: "Начальник кафедри",
                    image: {
                        id: 1,
                        contentType: "",
                        imageFilename: ""
                    } as Image,
                }
            ]
        },
        {
            textContent: [
                "Нормативно-правова база військової підготовки\n",
                "Закон України \"Про військовий обов'язок і військову службу\" (витяг)\n",
                "Постанова Кабінету Міністрів України від 1.02.2012 №48 (зі змінами) \"Про затвердження Порядку проведення військової підготовки громадян України за програмою підготовки офіцерів запасу\"\n",
                "Наказ №719/1289 від 14.12.2015 \"Про затвердження Інструкції про організацію військової підготовки громадян України за програмою підготовки офіцерів запасу\"\n",
            ]
        } as TextBlock,
        {
            textContent: [
                "Рівень підготовки науково педагогічних працівників,стан озброєння та військової техніки, навчально-матеріальна база дозволяють формувати - особистості військового фахівця вищого рівня,здатного застосовувати бойову техніку в складних умовах сучасної війни; розвиток інженерного мислення і дослідницьких якостей,вмінь і навиків працювати в складі групи,керувати підлеглими під час експлуатації та бойового застосування техніки та озброєння.\n"
            ]
        } as TextBlock,
        {
            title: "ВІЙСЬКИВИЙ ІНСТИТУТ ТЕЛЕКОМУНІКАЦІЙ ТА ІНФОРМАТИЗАЦІЇ",
            uLists: [
                {
                    title: "Набір 2018 року буде здійснюватися для підготовки за програмою офіцерів запасу за військово-обліковими спеціальностями:\n",
                    items: [
                        "Організація захисту інформації та кібернетична безпека в інформаційно-комунікаційних системах.\n",
                        "Застосування змішаних з’єднань, військових частин і підрозділів (крім підрозділів і військових частин зв’язку та радіотехнічного забезпечення авіації).\n",
                        "Спеціальний зв'язок. Контроль за режимом секретності.\n",
                        "Математичне та програмне забезпечення функціонування автоматизованих систем.\n",
                        "Експлуатація та ремонт наземної апаратури радіозв’язку різної потужності.\n",
                        "Технічне забезпечення функціонування автоматизованих систем управління.\n",
                        "Експлуатація та ремонт автомобільної техніки і гусеничних тягачів.\n",
                        "Соціальна психологія.\n",
                    ]
                } as List
            ]
        } as TextBlock,
        {
            textContent: [
                "До військової підготовки можуть залучатись здобувачі вищої освіти незалежно від форми навчання у вищих навчальних закладах, у тому числі і військовослужбовці рядового складу, сержантського та старшинського складу, які проходять військову службу за контрактом та громадяни України, які мають освітній ступінь вищої освіти не нижче бакалавра, якщо їм на початок військової підготовки не виповнилося 40 років.\n",
                "<strong>Увага!</strong> Відповідно до пункту 173 Положення про проходження громадянами України військової служби у Збройних Силах України до навчання можуть залучатися військовослужбовці, які підписали другий контракт та мають дозвіл від командира з'єднання і вище.\n",
                "<strong>Вартість навчання: 4 500 грн./семестр (2 роки навчання - 18 000 грн.).\n</strong>",
                "Після закінчення навчання та складання випускного іспиту присвоюється військове звання „молодший лейтенант запасу” Збройних Сил України."
            ],
            images: [
                {
                    id: 16488,
                    contentType: "",
                    imageFilename: ""
                } as Image,
                {
                    id: 16490,
                    contentType: "",
                    imageFilename: ""
                } as Image,
                {
                    id: 16491,
                    contentType: "",
                    imageFilename: ""
                } as Image,
                {
                    id: 16492,
                    contentType: "",
                    imageFilename: ""
                } as Image,
                {
                    id: 16493,
                    contentType: "",
                    imageFilename: ""
                } as Image,
                {
                    id: 16494,
                    contentType: "",
                    imageFilename: ""
                } as Image,
            ]
        } as TextBlock,
        {
            textContent: [
                "<strong>Детальну інформацію дивіться:\n</strong>",
                "Правила прийому громадян України для навчання за програмою підготовки офіцерів запасу на кафедрі військової підготовки Військового інституту телекомунікацій та інформатизації (2019 рік)\n",
                "Документи (анкети) необхідні для вступу\n",
                "Графік проведення конкурсного відбору громадян України, які виявили бажання проходити військову підготовку у Військовому інституті телекомунікацій та інформатизації за програмою підготовки офіцерів запасу у 2018 році"
            ]
        } as TextBlock,
        {} as TextBlock,


    ]
}