import {Page} from "../../../entities/page";
import {RouterNames} from "../../enums/RouterNames";
import {Image} from "../../../entities/image";
import {ImageTextRow} from "../../../entities/text-block/model/types";

export const cooperationPage: Page = {
    title: "Співробітництво",
    name: RouterNames.COOPERATION.subLinks[0].name,
    titleImage: {id: 16537} as Image,
    textBlocks: [
        {
            title: "Міжнародне співробітництво Військового інституту телекомунікацій та інформатизації імені Героїв Крут",
            textContent: [
                "<h2 style=\"text-align: center; margin-top: 20px;\">«Дні НАТО» в Збройних Силах України:</h2>"
            ],
            imageTextRows: [
                {
                    image: {id: 16538} as Image,
                    text: `<h3>“Дні НАТО - 2021”</h3>
                          <sub>09 жовтня 2021 року</sub>
                          <br>
                           <strong>Учасники:</strong> 
                           Делегація Північноатлантичного альянсу,
                           яку очолили начальник Управління по
                           Партнерству в штабі Верховного головнокомандування
                           Об’єднаних збройних сил НАТО в Європі (SHAPE)
                           віце адмірал Бюлент Туран`,
                    imgLeft: true
                } as ImageTextRow,
                {
                    image: {id: 16539} as Image,
                    text: `<h3>Робоча зустріч з представниками НАТО в рамках підготовки до проведення «Днів НАТО -2021»</h3>
                          <sub>23 вересня 2021 року</sub>
                          <br>
                           <strong>Учасники:</strong> 
                           Представники Головного управління партнерства 
                           Стратегічного комундування НАТО,
                           начальник Військового інституту
                           телекомунікацій та інформатизації 
                           імені Героїв Крут генерал-майор Віктор Остапчук
                    `,
                } as ImageTextRow,
                {
                    image: {id: 16540} as Image,
                    text: `<h3>“Дні НАТО - 2019”</h3>
                           <sub>13 листопада 2019 року</sub>
                           <br>
                           <strong>Учасники:</strong> 
                           Делегація Північноатлантичного альянсу, яку очолили начальник Управління по Партнерству в штабі Верховного головнокомандування Об’єднаних збройних сил НАТО в Європі (SHAPE) віце адмірал Бюлент Туран, Військовий представник Місії України при НАТО генерал-лейтенант Володимир Аскаров`,
                    imgLeft: true
                } as ImageTextRow,
                {
                    image: {id: 16541} as Image,
                    text: `<h3>“Дні НАТО - 2017”</h3>
                          <sub>24 жовтня 2017 року</sub>
                          <br>
                           <strong>Учасники:</strong> 
                           Делегація Північноатлантичного альянсу, яку очолили заступник начальників штабів з питань військового партнерства стратегічних командувань НАТО генерал-майор Оддо Педерсен та військовий представник Місії України при Альянсі генерал-лейтенант Володимир Аскаров`,
                } as ImageTextRow,
                {
                    image: {id: 16542} as Image,
                    text: `<h3>“Дні НАТО - 2016”</h3>
                          <sub>26 жовтня 2016 року</sub>
                          <br>
                           <strong>Учасники:</strong> 
                           Делегація Північноатлантичного альянсу, яку очолив заступник начальників штабів з питань військового партнерства стратегічних командувань НАТО генерал-майор Оддо Педерсен, представники Альянсу, які обіймають різні посади з питань військового партнерства стратегічних командувань НАТО`,
                    imgLeft: true
                } as ImageTextRow,
            ]
        },
        {
            textContent: [
                "<h2 style=\"text-align: center; margin-top: 20px;\">Візити іноземних делегацій:</h2>"
            ],
            imageTextRows: [
                {
                    image: {id: 16543} as Image,
                    text: `<h3>Робочий візит литовської делегації на чолі з директором Регіонального центру кіберзахисту при Міністерстві Оборони Литовської республіки з метою ознайомлення з діяльністю інституту та обговорення напрямів та перспектив майбутнього співробітництва</h3>
                          <sub>15 лютого 2022 року</sub>
                          <br>
                           <strong>Учасники:</strong> 
                           Представники Регіонального центру кіберзахисту при Міністерстві Оборони Литовської республіки, начальник Військового інституту генерал-майор Віктор Остапчук, заступник начальника інституту з навчальної роботи полковник Олексій Сілко, полковник Владислав Чевардін, курсанти`,
                    imgLeft: true
                } as ImageTextRow,
                {
                    image: {id: 16544} as Image,
                    text: `<h3>Робочий візит експертів Європейської служби зовнішньої діяльності з метою ознайомлення з діяльністю інституту та обговорення напрямів та перспектив майбутнього співробітництва</h3>
                          <sub>02 лютого 2022 року</sub>
                          <br>
                           <strong>Учасники:</strong> 
                           Представники Європейської служби зовнішньої діяльності пан Жан Деман, пан Бертранд Ромейн та інші, представники Естонської республіки пані Мерле Майгре, пан Хеннес Асток, начальник Військового інституту генерал-майор Віктор Остапчук, заступник начальника інституту з навчальної роботи полковник Олексій Сілко, полковник Владислав Чевардін`
                } as ImageTextRow,
                {
                    image: {id: 16545} as Image,
                    text: `<h3> Робочий візит експертів НАТО з метою ознайомлення з діяльністю інституту та обговорення наявних навчальних можливостей та програм підготовки офіцерів зв’язку та інформаційних систем</h3>
                          <sub>12 січня 2022 року </sub>
                          <br>
                           <strong>Учасники:</strong> 
                            Офіцер військово-морських Сил Великобританії, представник об’єднаного командування НАТО з трансформації Джон Стівенсон та старший науковий співробітник служб командування та управління Агентства зв’язку та інформації НАТО пан Марк Терстон, заступник начальника інстиутут з навчальної роботи полковник Олексій Сілко, науково-педагогічні працівники інституту, курсанти
                            `,
                    imgLeft: true
                } as ImageTextRow,
                {
                    image: {id: 16546} as Image,
                    text: `<h3>Онлайн-зустріч керівництва Військового інституту телекомунікацій та інформатизації імені Героїв Крут та Вищої Військово-морської академії імені Ніколи Вапцарова </h3>
                          <sub> 27 жовтня 2021 року</sub>
                          <br>
                           <strong>Учасники:</strong> 
Координатором заходу виступив Радник з питань професійної військової освіти при Представництві НАТО в Україні підполковник Стасіс Палдунас, заступник начальника інстиутут з навчальної роботи полковник Олексій Сілко, представники вищої Військово-морської академії імені Ніколи Вапцарова, науково-педагогічні працівники інституту, курсанти
                            `,
                } as ImageTextRow,
                {
                    image: {id: 16547} as Image,
                    text: `<h3> Робочий візит іноземного Радника з питань професійної військової освіти з метою обговорення питання подальшого долучення Військового інституту до Програми НАТО «Удосконалення військової освіти»</h3>
                          <sub> 12 жовтня 2021 року</sub>
                          <br>
                           <strong>Учасники:</strong> 
Радник з питань професійної військової освіти при Представництві НАТО В Україні підполковник Стасіс Палдунас, заступник начальника інстиутут з навчальної роботи полковник Олексій Сілко, заступник начальника інституту з наукової роботи полковник Григорій Радзівілов, науково-педагогічні працівники інституту
                            `,
                    imgLeft: true
                } as ImageTextRow,
                {
                    image: {id: 16548} as Image,
                    text: `<h3>Робоча зустріч керівного складу Військового інституту із представниками Королівства Данії щодо ознайомлення з діяльністю Військового інституту та обговорення шляхів співпраці в обговорили можливості співпраці в напрямках гендерної рівності, міжнародного права, програм курсів лідерства та підготовки викладачів</h3>
                          <sub>4 жовтня 2021 року </sub>
                          <br>
                           <strong>Учасники:</strong> 
Військовий радник підполковник Йенс Якобсен та старший військовий радник при Національному університеті оборони України пан Френк Єппесен, заступник начальника інстиутут з навчальної роботи полковник Олексій Сілко
                            `,
                } as ImageTextRow,
                {
                    image: {id: 16549} as Image,
                    text: `<h3>Робоча зустріч керівного складу Військового інституту із представниками Королівства Данії щодо ознайомлення з діяльністю Військового інституту та обговорення шляхів співпраці в обговорили можливості співпраці в напрямках гендерної рівності, міжнародного права, програм курсів лідерства та підготовки викладачів </h3>
                          <sub> 04 жовтня 2021 року</sub>
                          <br>
                           <strong>Учасники:</strong> 
Військовий радник підполковник Йенс Якобсен та старший військовий радник при Національному університеті оборони України пан Френк Єппесен, заступник начальника інстиутут з навчальної роботи полковник Олексій Сілко
                            `,
                    imgLeft: true
                } as ImageTextRow,
                {
                    image: {id: 16550} as Image,
                    text: `<h3>Робоча зустріч керівного складу Військового інституту з делегацією Литовської республіки щодо ознайомлення з діяльністю Військового інституту та обговорення шляхів співпраці в сфері кібербезпеки </h3>
                          <sub>25 серпня 2021 року </sub>
                          <br>
                           <strong>Учасники:</strong> 
Аташе з питань оборони полковник Даріус Адомайтіс, директор регіонального центру кіберзахисту полковник Ромалдас Петкевічус, радник Стасіс Палдунас, заступник начальника інстиутут з навчальної роботи полковник Олексій Сілко, заступник начальника інституту з наукової роботи полковник Григорій Радзівілов науково-педагогічні працівники інституту
                            `,
                } as ImageTextRow,
                {
                    image: {id: 16551} as Image,
                    text: `<h3>Робоча зустріч з радником з питань професійної військової освіти (DEEP) Представництва НАТО в Україні </h3>
                          <sub> 22 липня 2021 року</sub>
                          <br>
                           <strong>Учасники:</strong> 
Радник Стасіс Палдунас, начальник інституту генерал-майор Віктор Остапчук, науково-педагогічні працівники інституту
                            `,
                    imgLeft: true
                } as ImageTextRow,
                {
                    image: {id: 16552} as Image,
                    text: `<h3> Візит делегації з США щодо підготовки до реалізації проєкту з розвитку IT-інфраструктури «Cable Dog»</h3>
                          <sub>29 червня 2021 року </sub>
                          <br>
                           <strong>Учасники:</strong> 
Командування Військ зв’язку та кібербезпеки ЗС України та Військового інституту телекомунікацій та інформатизації, науково-педагогічні працівники ВІТІ.
                            `,
                } as ImageTextRow,
                {
                    image: {id: 16553} as Image,
                    text: `<h3>Візит представництва НАТО для подальшого налагодження співробітництва в рамках Програми НАТО “Удосконалення військової освіти” (DEEP – Defence Education Enhancement Program) </h3>
                          <sub> 24 березня 2021 року</sub>
                          <br>
                           <strong>Учасники:</strong> 
Радник Стасіс Палдунас, начальник інституту генерал-майор Віктор Остапчук, науково-педагогічні працівники інституту
                            `,
                    imgLeft: true
                } as ImageTextRow,
                {
                    image: {id: 16554} as Image,
                    text: `<h3>Візит делегації представників США, з питань подальшого співробітництва щодо створення локальних мереж на об’єктах ЗС України та їх підключення до існуючої мережі U-NIPRNet </h3>
                          <sub>23 лютого 2021 року </sub>
                          <br>
                           <strong>Учасники:</strong> 
Командування Військ зв’язку та кібербезпеки ЗС України та Військового інституту телекомунікацій та інформатизації
                            `,
                } as ImageTextRow,
                {
                    image: {id: 16555} as Image,
                    text: `<h3>Робоча зустріч з представниками посольства США в Україні, фахівцями в галузі кібербезпеки форту Гордон США та інших відомств США </h3>
                          <sub>30 січня 2020 року </sub>
                          <br>
                           <strong>Учасники:</strong> 
НПП кафедри Захисту інформації та кіберзахисту, курсанти, які навчаються за спеціальністю 125 кібербезпека, військовослужбовці КВЗ та КБ
                            `,
                    imgLeft: true
                } as ImageTextRow,
                {
                    image: {id: 16556} as Image,
                    text: `<h3>Робочий візит представників кібернетичної безпеки Збройних Сил Італійської Республіки з питань подальшого двостороннього співробітництва, щодо тренування кібервоїнів </h3>
                          <sub>11 грудня 2018 року </sub>
                          <br>
                           <strong>Учасники:</strong> 
Представник Головного Штабу оборони Збройних Сил Італійської республіки полковник Феліче ДЕ РОЗА, фахівці ГУЗІС ГШ ЗСУ та ВІТІ
                            `,
                } as ImageTextRow,
                {
                    image: {id: 16557} as Image,
                    text: `<h3> Зустріч представників Бюро кібернетичної безпеки Міністерства оборони Грузії та ГУЗІС ГШ ЗСУ, обговорення питань двостороннього співробітництва у сфері кібернетичної безпеки, політики, планів Бюро кібернетичної безпеки Міністерства оборони Грузії, розгляд запланованих спільних проектів та подальшої співпраці</h3>
                          <sub> 02 грудня 2018 року</sub>
                          <br>
                           <strong>Учасники:</strong> 
Директор Бюро кібернетичної безпеки Міністерства оборони Грузії пан Леван Гіоргобіані, Начальник відділу міжнародних відносин та розвитку бюро кібернетичної безпеки Міністерства оборони Грузії пані Майа Абуладзе, предаставники ГУЗІС ГШ ЗСУ та ВІТІ
                            `,
                    imgLeft: true
                } as ImageTextRow,
                {
                    image: {id: 16558} as Image,
                    text: `<h3>Візит представників USEUCOM Joint Cyber Center (US Army Cyber School), щодо ознайомлення з процесом підготовки фахівців з кібернетичної безпеки для Збройних Сил України </h3>
                          <sub> 23 травня 2018 року</sub>
                          <br>
                           <strong>Учасники:</strong> 
Представники USEUCOM Joint Cyber Center (US Army Cyber School), заступник начальника інституту з навчальної роботи полковник Сілко О.В., доцент кафедри Захисту інформації та кібербезпеки підполковник Чевардін В.Є.
                            `,
                } as ImageTextRow,
                {
                    image: {id: 16559} as Image,
                    text: `<h3> Обговорення основних проблем розвитку системи кіберзахисту в Україні та можливості застосування в подальшому досвіду Сил Оборони Естонської Республіки та Об'єднаного центру передових технологій з кібероборони НАТО (NATO Cooperative Cyber Defence Centre of Excellence)</h3>
                          <sub> 26 березня 2018 року</sub>
                          <br>
                           <strong>Учасники:</strong> 
Візит делегації Міноборони Естонії в Україні в галузі оборонних технологи та інновацій на чолі з генералом Валерієм Саара та фахівців з кібернетичної безпеки Збройних Сил України, представників ГУЗІС ГШ ЗСУ та Військового інституту: НПП кафедри Захисту інформації та кіберзахисту факультету Бойового застосування систем управління та зв'язку
                            `,
                    imgLeft: true
                } as ImageTextRow,
                {
                    image: {id: 16560} as Image,
                    text: `<h3>Ознайомлення з новітніми технічними розробками Центру впровадження та супроводження автоматизованих систем оперативного (бойового) управління ЗС України </h3>
                          <sub> 27 вересня 2017 року</sub>
                          <br>
                           <strong>Учасники:</strong> 
Візит делегації Міністерства національної оборони Канади на чолі з Міністром національної оборони Канади паном Харджитом Сінгхом Сейджжаном
                            `,
                } as ImageTextRow,
            ]
        },
        {
            textContent: [
                "<h2 style=\"text-align: center; margin-top: 20px;\">NATO Hackathon (міжнародні змагання з програмування):</h2>"
            ],
            imageTextRows: [
                {
                    image: {id: 16561} as Image,
                    text: `<h3>Міжнародні змагання NATO TIDE Hackathon 2021 </h3>
                          <sub> 12 - 16 квітня 2021 року</sub>
                          <br>
                           <strong>Учасники:</strong> 
                           Команда ВІТІ у складі курсантів факультету інформаційних технологій
`,
                    imgLeft: true
                } as ImageTextRow,
                {
                    image: {id: 16562} as Image,
                    text: `<h3> Міжнародний проект «Peer-to-peer» (розробка програмного забезпечення з протидії дезінформації та фейковим новинам)</h3>
                          <sub> 15 грудня 2020 року</sub>
                          <br>
                           <strong>Учасники:</strong> 
                           Команда ВІТІ у складі курсантів факультету інформаційних технологій
`,
                } as ImageTextRow,
                {
                    image: {id: 16563} as Image,
                    text: `<h3>Міжнародні змагання з програмування Google HashCode 2020 </h3>
                          <sub> 20 лютого 2020 року</sub>
                          <br>
                           <strong>Учасники:</strong> 
                           Курсанти ВІТІ, спеціальності «Комп’ютерні науки»
`,
                    imgLeft: true
                } as ImageTextRow,
                {
                    image: {id: 16564} as Image,
                    text: `<h3> Міжнародні змагання з програмування Google HashCode 2019</h3>
                          <sub>02 березня 2019 року </sub>
                          <br>
                           <strong>Учасники:</strong> 
                           Команда курсантів факультету інформаційних технологій
`,
                } as ImageTextRow,
                {
                    image: {id: 16565} as Image,
                    text: `<h3> «TIDE Hackathon 2019» - змагання фахівців з програмування</h3>
                          <sub> 24.02.19 по 01.03.2019 року (Варшава, Республіка Польща)</sub>
                          <br>
                           <strong>Учасники:</strong> 
                           13 команд з 5 країн, серед яких Голландія, Туреччина, Німеччина , Польща, команда Збройних Сил України «MITI Hedgehogs» до складу якої входять курсанти Військового інституту телекомунікацій та інформатизації імені Героїв Крут
`,
                    imgLeft: true
                } as ImageTextRow,
                {
                    image: {id: 16566} as Image,
                    text: `<h3> Семінар з обговорювалися питання застосування сучасних інформаційних технологій в ході процесів прийняття рішень на перспективних командних пунктах НАТО</h3>
                          <sub>06 - 08 листопада 2018 року (Берлін, Німеччина) </sub>
                          <br>
                           <strong>Учасники:</strong> 
                           Курсанти ВІТІ: Теслов Д.С. (капітан команди), Румша Д.С. та Кика І.А., керівник команди – підполковник Шкіцький В.В., полковник Роберт Миузен, підполковники Марко Гангі, Федеріко Клементи, Ян Мазал, Крістофер Брілл - доктор філософії, старший науковий керівник з психології, Франсискус Даніель Ваммес - віце-президент, головний інноваційний директор, магістр ділового адміністрування в Європі, Гарольд Вірменен - директор Альянсу НАТО з Корпорацією Microsoft, Джелль ван Хаастер - дослідник кібер-операцій, Ян Віллем Стріфкерк - старший проектний щорічний семінар «Майбутнє командного пункту NATO C2COE 2018»,менеджер відділу даних в TNO в Нідерландах
`,
                } as ImageTextRow,
                {
                    image: {id: 16567} as Image,
                    text: `<h3>НАТО «TIDE Hackathon 2018» - змаганні фахівців з програмування </h3>
                          <sub>19 по 23 березня 2018 року (Подгориця, Республіка Чорногорія </sub>
                          <br>
                           <strong>Учасники:</strong> 
                           Курсанти Військового інституту
`,
                    imgLeft: true
                } as ImageTextRow,
                {
                    image: {id: 16568} as Image,
                    text: `<h3> «NATO Enterprise Architecture Hackathon» - змагання найкращих фахівців з програмування серед країн-партнерів НАТО</h3>
                          <sub> 27 по 31 березня 2017 року (Лондон, Великобританія)</sub>
                          <br>
                           <strong>Учасники:</strong> 
                           Курсанти факультету Інформаційних технологій
`,
                } as ImageTextRow,
            ]
        },
        {
            textContent: [
                "<h2 style=\"text-align: center; margin-top: 20px;\">Міжнародні семінари, конференції, виставки:</h2>"
            ],
            imageTextRows: [
                {
                    image: {id: 16569} as Image,
                    text: `<h3> Міжнародна конференція НАТО з опрацювання навчальних програм з розбудови доброчесност</h3>
                          <sub>13 жовтня 2021 року (Київ, Україна) </sub>
                          <br>
                           <strong>Учасники:</strong> 
                         Військовий інститут представляли заступник начальника інституту з навчальної роботи полковник Олексій Сілко, старший викладач кафедри військово-гуманітарних дисциплін підполковник Роман Скидан, викладач кафедри військової підготовки майор Павло Сердюк та методист навчального відділу працівник ЗС України Тетяна Лемак
`,
                    imgLeft: true
                } as ImageTextRow,
                {
                    image: {id: 16570} as Image,
                    text: `<h3>Міжнародний семінар з питань втілення гендерної політики </h3>
                          <sub>06 по 10 вересня 2021 року (Харків, Україна) </sub>
                          <br>
                           <strong>Учасники:</strong> 
                         Представники оборонного сектору України, Канади та НАТО у сфері реалізації гендерної політики. Військовий інститут представляли начальник науково-організаційного відділу підполковник Ірина Діянчук та старший помічник начальника навчального відділу підполковник Наталія Овсейко
`,
                } as ImageTextRow,
                {
                    image: {id: 16571} as Image,
                    text: `<h3> ХVІІ Міжнародна спеціалізована виставка «Зброя та безпека - 2021»</h3>
                          <sub> 15 по 18 червня 2021 року</sub>
                          <br>
                           <strong>Учасники:</strong> 
                         На виставці колектив інституту презентував безпілотний літальний апарат, основним завданням якого є забезпечення управління підрозділами, підвищення пропускної спроможності, доступності, резервування та живучості мереж зв’язку в інтересах управління військами. Представлена нейромережа «Саймон». Це система мультиоб'єктного інтерактивного наведення та навігації, яка здатна в режимі реального часу маючи потокове відео або ж зображення з супутника розпізнавати ті чи інші об’єкти, яким вона була навчена. Презентована інтелектуальна MЕSH мережа мультифункціональних сенсорних вузлів для військових систем моніторингу та прийняття рішень ISR-ISTAR.
`,
                    imgLeft: true
                } as ImageTextRow,
                {
                    image: {id: 16572} as Image,
                    text: `<h3> Презентація сучасного радіообладнання StreamCaster 4200 та StreamCaster 4400 виробництва компанії “Silvus” (США)</h3>
                          <sub> 16 жовтня - 20 жовтня 2020 року (смт Гуйва, Житомирська область, Україна)</sub>
                          <br>
                           <strong>Учасники:</strong> 
                         Представники компанії “Silvus” (США), КВЗтаКБ, представники військових частин, ВІТІ
`,
                } as ImageTextRow,
                {
                    image: {id: 16573} as Image,
                    text: `<h3> Презентація сучасних засобів УКХ радіозв’язку виробництва компанії “Elbit Systems” (Ізраїль)</h3>
                          <sub>06 жовтня - 20 жовтня 2020 року (Одеса, Україна) </sub>
                          <br>
                           <strong>Учасники:</strong> 
                         Представники компанії “Elbit Systems” (Ізраїль), КВЗтаКБ, представники військових частин, ВІТІ
`,
                    imgLeft: true
                } as ImageTextRow,
                {
                    image: {id: 16574} as Image,
                    text: `<h3> Конференція "Спецільні інфомаційні системи та робототехнічні комплекси"</h3>
                          <sub>30 січня 2020 року </sub>
                          <br>
                           <strong>Учасники:</strong> 
                         Іноземна делегація: Метью (Метт) Хаутбі та Камерон МакДугалл, викладачі, ад'юнкти і курсанти ВІТІ
`,
                } as ImageTextRow,
                {
                    image: {id: 16575} as Image,
                    text: `<h3>ХVІ Міжнародна спеціалізована виставка «Зброя та безпека - 2019» </h3>
                          <sub>08 по 11 жовтня 2019 року </sub>
                          <br>
                           <strong>Учасники:</strong> 
                         Курсанти та викладачі ВІТІ представили фрагмент сенсорної MASH мережі спеціального призначення
`,
                    imgLeft: true
                } as ImageTextRow,
                {
                    image: {id: 16576} as Image,
                    text: `<h3> Міжнародні командно-штабні навчання із залученням військ «Rapid Trident – 2019»</h3>
                          <sub>13-27 вересня 2019 року </sub>
                          <br>
                           <strong>Учасники:</strong> 
                         Підрозділи України, США, Великої Британії, Канади, Грузії, Литви, Туреччини, Молдови, Польщі, Румунії, представники ВІТІ: курсанти 5-х курсів Військового інституту телекомунікацій та інформатизації імені Героїв Крут
`,
                } as ImageTextRow,
                {
                    image: {id: 16577} as Image,
                    text: `<h3> Семінар з питань трансформації системи управління військами (силами)</h3>
                          <sub>06 листопада 2019 року </sub>
                          <br>
                           <strong>Учасники:</strong> 
                         Представники Секретаріату штаб-квартири НАТО з питань консультацій, командування та управління, представники Агенції НАТО з питань зв’язку та інформації та представники інформаційних систем ГШ ЗСУ; представники ІТС видів ЗС України, викладачі, науковці й курсанти ВІТІ
`,
                    imgLeft: true
                } as ImageTextRow,
                {
                    image: {id: 16578} as Image,
                    text: `<h3>Українсько-американські навчання “Сі-Бриз-2019” </h3>
                          <sub>Липень 2019 року </sub>
                          <br>
                           <strong>Учасники:</strong> 
                         17 держав-членів НАТО, курсанти ВІТІ
`,
                } as ImageTextRow,
                {
                    image: {id: 16579} as Image,
                    text: `<h3>Семінар на тему: "Жінки у збройних силах" </h3>
                          <sub> 09 березня 2019 року</sub>
                          <br>
                           <strong>Учасники:</strong> 
                         Посольство Великобританії в Україні, капітан 2 рангу Елеонора Старк, курсантки ВІТІ
`,
                    imgLeft: true
                } as ImageTextRow,
                {
                    image: {id: 16580} as Image,
                    text: `<h3>ХV Міжнародна спеціалізована виставка «Зброя та безпека - 2018» </h3>
                          <sub>09 по 12 жовтня 2018 року </sub>
                          <br>
                           <strong>Учасники:</strong> 
                         16 країн світу, зокрема зі США, Туреччини, Пакистану, Польщі, Австрії. Представники ВІТІ представили програмний продукт за допомогою якого реалізована система захвату, ідентифікації та супроводження динамічних цілей
`,
                } as ImageTextRow,
                {
                    image: {id: 16581} as Image,
                    text: `<h3> Міжнародний практичний семінар «Технології у процесі стабільного розвитку» (Нью Йорк, США) за підтримки IEEE</h3>
                          <sub> 28 вересня - 2 жовтня 2018 року</sub>
                          <br>
                           <strong>Учасники:</strong> 
                         Завідувач кафедри іноземних мов Капанайко І.Я
`,
                    imgLeft: true
                } as ImageTextRow,
                {
                    image: {id: 16582} as Image,
                    text: `<h3>Семінар за темою: “21 st century skills development with National Geographic Learning material” </h3>
                          <sub> 14 травня 2018 року</sub>
                          <br>
                           <strong>Учасники:</strong> 
                         Представник міжнародної організації National Geographic, НПП кафедри іноземних мов ВІТІ
`,
                } as ImageTextRow,
                {
                    image: {id: 16583} as Image,
                    text: `<h3>ХІV Міжнародна спеціалізована виставка «Зброя та безпека - 2017» </h3>
                          <sub> 10—13 жовтня 2017 року</sub>
                          <br>
                           <strong>Учасники:</strong> 
Курсанти та викладачі Військового інституту телекомунікацій та інформатизації
`,
                    imgLeft: true
                } as ImageTextRow,
                {
                    image: {id: 16584} as Image,
                    text: `<h3>Перший практично-методичний семінар з обміну досвідом та знаннями в системах оперативного (бойового) управління (відповідно до концепції побудови об’єднаних бойових мереж FMN) </h3>
                          <sub> 15 - 19 травня 2017 року</sub>
                          <br>
                           <strong>Учасники:</strong> 
                         Представники Секретаріату штаб-квартири НАТО з питань консультацій, командування та управління, представники Агенції НАТО з питань зв’язку та інформації та представники інформаційних систем ГШ ЗСУ; представники ІТС видів ЗС України, викладачі, науковці й курсанти ВІТІ, які навчаються за спеціальністю “Кібербезпека”
`,
                } as ImageTextRow,
                {
                    image: {id: 16585} as Image,
                    text: `<h3> Семінар з питань стійких загроз у сфері кібернетичних технологій</h3>
                          <sub> 19 - 20 квітня 2017 року</sub>
                          <br>
                           <strong>Учасники:</strong> 
                         Експерти структури J6 Європейського командування ЗС США – 6 інструкторів; представники ГУЗІС ЗСУ; представники ІТС в/ч А0106 та А0334; а також викладачі, науковці й курсанти ВІТІ, які навчаються за спеціальністю “Кібербезпека”
`,
                    imgLeft: true
                } as ImageTextRow,
                {
                    image: {id: 16586} as Image,
                    text: `<h3> Міжнародний симпозіум (на базі Військового інституту Київського національного університету імені Тараса Шевченка)</h3>
                          <sub>24 – 26 листопада 2016 року </sub>
                          <br>
                           <strong>Учасники:</strong> 
                         Посадові особи Бюро міжнародної мовної координації НАТО (BILC), представники МОУ та профільних фахівців з ВВНЗ
`,
                } as ImageTextRow,
            ]
        }

    ]
}