import {Page} from "../../../entities/page";
import {Image} from "../../../entities/image";
import {RouterNames} from "../../enums/RouterNames";
import {List, TextBlock} from "../../../entities/text-block";
import {AccordionElement} from "../../../entities/accordion-element";
import {ImageTextRow} from "../../../entities/text-block/model/types";

export const sciencesPage: Page = {
    title: "Наука",
    titleImage: {id: 16246} as Image,
    name: RouterNames.SCIENCE.name,
    textBlocks: [
        {
            title: "Наука"
        },
    ],
    accordionElements: [
        {
            title: "Наукова і науково-технічна діяльність",
            textBlocks:
                [
                    {
                        oLists: [
                            {
                                items: [
                                    "Закон України “Про наукову і науково-технічну діяльність” від 26 грудня 2015 р. № 848-VIII;\n",
                                    "Закон України “Про наукову і науково-технічну експертизу” від 10 лютого 1995 року № 51/95 ВР;\n",
                                    "Закон України “Про інноваційну діяльність” від 04 липня 2002 року № 40- ІV;\n",
                                    "Постанова Кабінету Міністрів України Постанова Кабінету Міністрів України від 22 серпня 2018 року № 652 «Деякі питання проведення державної атестації закладів вищої освіти в частині провадження ними наукової (науково-технічної) діяльності, затверджений постановою Кабінету Міністрів України» від 22 серпня 2018 року № 652;\n",
                                    "Постанова Кабінету Міністрів України «Про затвердження Порядку формування тематики наукових досліджень і науково-технічних (експериментальних) розробок, що фінансуються за рахунок коштів державного бюджету, та визнання такими, що втратили чинність, деяких постанов Кабінету Міністрів України» від 11 січня 2018 року № 13;\n",
                                    "Розпорядження Кабінету Міністрів України «Про схвалення Стратегії розвитку сфери інноваційної діяльності на період до 2030 року» від 10 липня 2019 року № 526-р;\n",
                                    "Наказ Міністерства оборони України «Про затвердження Розподілу основних напрямів наукових досліджень між науковими установами та вищими військовими навчальними закладами Міністерства оборони України та Збройних Сил України» від 26 січня 2017 року № 53 (зі змінами, в редакції від 15.02.2019 № 65)\n",
                                    "Наказ Міністерства оборони України «Про затвердження Положення про організацію наукової і науково-технічної діяльності у Збройних Силах України» від 27 липня 2016 року № 385 (зі змінами) ;\n",
                                    "Наказ Міністерства оборони України «Про затвердження Положення про патентно-ліцензійну, винахідницьку та раціоналізаторську роботу в Збройних Силах України» від 05 березня 2001 року № 78 (у редакції наказу Міністра оборони України від 30.06.2010 № 338);\n",
                                    "Положення «Про організацію наукової та науково-технічної діяльності у Військовому інституті телекомунікацій та інформатизації імені Героїв Крут.  Наказ про введення в дію\n",
                                    "Річний план наукової і науково-технічної діяльності Військового інституту телекомунікацій та інформатизації імені Героїв Крут - Згідно підпункту 20.7 наказу начальника Генерального штабу Збройних сил України від 22.11.2017 року № 408 „Про затвердження Переліку відомостей Міністерства оборони України, які містять службову інформацію” (ПСІ-2017) має гриф „Для службового користування”.\n",
                                    "Положення «Про порядок реалізації міжнародних проектів, грантів, договорів у Військовому інституті телекомунікацій та інформатизації імені Героїв Крут.  Наказ про введення в дію\n",
                                    "Перелік наукових фахових видань України. (перехід по посиланню на сайт міністерства освіти України).",
                                ]
                            } as List
                        ],
                        images: [
                            {
                                id: 16312,
                            } as Image,
                            {
                                id: 16313,
                            } as Image,
                            {
                                id: 16314,
                            } as Image,
                            {
                                id: 16315,
                            } as Image,
                        ]
                    } as TextBlock,
                    {
                        textContent: [
                            "<strong>Наукова діяльність</strong> - інтелектуальна творча діяльність, спрямована на одержання нових" +
                            " знань" +
                            " та" +
                            " (або) пошук шляхів їх застосування, основними видами якої є фундаментальні та прикладні наукові дослідження.\n",
                            "\n" +
                            "<strong>Наукова (науково-технічна) робота</strong> - наукові дослідження та науково-технічні" +
                            " (експериментальні)" +
                            " розробки, проведені з метою одержання нових наукових і науково-технічних (прикладних) результатів, спрямованих на забезпечення воєнної безпеки України, підвищення ефективності військового будівництва, розвиток форм і способів підготовки, застосування і всебічного забезпечення Збройних Сил та Держспецтрансслужби, розвиток озброєння, військової та спеціальної техніки.\n",
                        ],
                        images: [
                            {
                                id: 16316,
                            } as Image,
                            {
                                id: 16317,
                            } as Image
                        ]

                    } as TextBlock,
                    {
                        textContent: [
                            "<strong>Видами наукової і науково-технічної діяльності є</strong> фундаментальні та прикладні наукові" +
                            " дослідження з воєнної проблематики суспільних, природничих та технічних наук."
                        ],
                        uLists: [
                            {
                                title: "<strong>Видами наукової (науково-технічної) роботи є:\n</strong>",
                                items: [
                                    "науково-дослідні, дослідно-конструкторські, проектно-конструкторські, дослідно-технологічні, технологічні, пошукові та проектно-пошукові роботи;\n",
                                    "науково-технічні (експериментальні) розробки;\n",
                                    "оперативні завдання, що пов’язані з одержанням нових наукових результатів та науковим супроводженням їх практичної реалізації у Збройних Силах та Держспецтрансслужби;\n",
                                    "випробування (попередні, визначальні, державні тощо) нових (модернізованих) зразків (комплексів, систем) озброєння і військової техніки;\n",
                                    "дослідження на навчаннях та інших заходах підготовки військ (штабів) Збройних Сил та Держспецтрансслужби;\n",
                                    "наукова і науково-технічна експертиза;",
                                    "винахідницька та раціоналізаторська робота;\n",
                                    "наукове та науково-технічне супроводження;\n",
                                    "підготовка наукових і науково-педагогічних кадрів;\n",
                                    "узагальнення і розповсюдження передового досвіду підготовки та застосування військ (сил) Збройних Сил та підрозділів Держспецтрансслужби;\n",
                                    "наукова робота слухачів (курсантів, студентів) у ВВНЗ, ВНП ЗВО.",
                                ]
                            } as List
                        ],
                        images: [
                            {
                                id: 16318,
                            } as Image,
                            {
                                id: 16319,
                            } as Image
                        ],
                    } as TextBlock,
                    {
                        uLists: [
                            {
                                title: "<strong>Основні напрямки наукової діяльності інституту:\n</strong>",
                                items: [
                                    "створення технічних проєктів елементів Єдиної автоматизованої системи управління (ЄАСУВ) військами, АСУЗ;\n",
                                    "наукове супроводження розробок сучасних інформаційно-телекомунікаційних систем та засобів зв’язку та АСУ (С4ІSR);\n",
                                    "створення стаціонарної цифрової мережі зв’язку Збройних Сил України, інтегрованої до телекомунікаційних мереж України;\n",
                                    "створення мобільної компоненти системи зв’язку оперативно-тактичної ланки управління;\n",
                                    "дослідження перспективних напрямків розвитку технічного забезпечення систем зв’язку та автоматизації;\n",
                                    "дослідження проблем захисту інформації, кібербезпеки спеціальних інформаційно-комунікаційних системах тощо;\n",
                                    "розробка тактико-технічних вимог до радіозасобів, комплексів, систем військового призначення;\n",
                                    "розробка та впровадження апаратно-програмних комплексів телекомунікаційних аероплатформ;\n",
                                    "розробка та впровадження безпровідних сенсорних мереж військового призначення;\n",
                                    "дослідження забезпечення електромагнітної сумісності радіоелектронних засобів, інформаційно - телекомунікаційних систем тощо."
                                ]
                            } as List
                        ],
                        images: [
                            {
                                id: 16320,
                            } as Image,
                            {
                                id: 16321,
                            } as Image
                        ],
                    } as TextBlock,
                    {
                        textContent: [
                            "Наукова і науково-технічна діяльність ВІТІ є складовою інтегрованої системи військової освіти і науки. Ця діяльність здійснюється керівним складом інституту, науковими працівниками наукового центру, науково-педагогічними працівниками кафедр інституту, докторантами, ад’юнктами, курсантами.\n",
                            "Інститут бере активну участь у виконанні науково-дослідних робіт, тематика яких спрямована на виконання цільових наукових програм згідно основних напрямів наукових досліджень інституту. Науково-педагогічні і наукові працівники залучаються до виконання оперативних завдань, досліджень на навчаннях та інших заходах оперативної, мобілізаційної та бойової підготовки.\n",
                            "До складу інституту входить Науковий центр зв’язку та інформатизації (далі НЦЗІ ВІТІ).\n",
                            "Науковий центр є головною науковою установою в галузі дослідження проблем розвитку зв’язку, автоматизації та кібербезпеки, наукового супроводження розробок в цьому напрямку. Основними напрямами діяльності НЦЗІ є виконання НДДКР, відпрацювання оперативних завдань, наукове супроводження та впровадження результатів дослідно-конструкторських робіт. Основною метою діяльності НЦЗІ ВІТІ є забезпечення реалізації державної політики у сфері науки, наукової техніки, інноваційної діяльності та інтелектуальної власності в системі Міністерства оборони України.\n",
                            "Якісне проведення наукової діяльності й освітнього процесу в інституті забезпечує колектив науково-педагогічних і наукових працівників, який складають: 16 докторів наук, 60 кандидатів наук, 11 професорів, 43 доцентів та старших наукових співробітників."
                        ]
                    } as TextBlock,
                    {
                        textContent: [
                            "Сформовані та активно працюють <strong>5 наукових шкіл</strong>, які відповідають спеціальностям" +
                            " підготовки" +
                            " наукових кадрів.\n",
                            "Також в інституті працюють науковці, що мають почесні звання:\n",
                            "<strong>Лауреати Державної премії України в галузі науки і техніки</strong> ‒ доктор технічних наук," +
                            " професор" +
                            " Науменко М.І.\n",
                            "<strong>Заслужені діячи науки і техніки України</strong> – доктор технічних наук, професор Креденцер" +
                            " Б.П.;" +
                            " доктор технічних наук, професор Науменко М.І..\n",
                            "<strong>Заслужені працівники освіти України</strong> – доктор технічних наук, професор Романюк В.А.," +
                            " доктор" +
                            " технічних наук, професор Міночкін А.І..\n"
                        ],
                        uLists: [
                            {
                                title: 'Наукові та науково-педагогічні кадри вищої кваліфікації в інституті готуються у' +
                                    ' докторантурі та очній ад’юнктурі за науковими спеціальностями:\n',
                                items: [
                                    "інформаційні системи та технології;\n",
                                    "озброєння та військова техніка.\n"
                                ]
                            } as List
                        ]
                    } as TextBlock,
                    {
                        textContent: [
                            "В інституті працює Спеціалізована вчена рада СРД 26.710.01 по захисту докторських та кандидатських дисертацій, якою за 2003-2020 роки проведено 118 засідань та захищено 6 докторських та 62 кандидатських дисертацій. За цей час в інших Спеціалізованих вчених радах науковцями інституту захищено 24 дисертації (5 докторських та 19 кандидатських)."
                        ],
                        images: [
                            {
                                id: 16322,
                            } as Image,
                            {
                                id: 16323,
                            } as Image
                        ]
                    } as TextBlock,
                    {
                        textContent: [
                            "В інституті проводиться патентна та винахідницька робота. Протягом 2019 року отримано: 5 патентів на корисну модель, один з них отримав трете місце на всеукраїнському конкурсі „Кращий винахід року”, свідоцтв про раціоналізаторську пропозицію – 22.\n",
                            "Для забезпечення ефективного та якісного виконання наукових досліджень інститут співпрацює з іншими установами, підприємствами, з провідними вищими навчальними закладами, науково-виробничими підприємствами, насамперед, з Національним університетом оборони України, Центральним науково-дослідним інститутом Збройних Сил України, Центральним науково-дослідним інститутом озброєння і військової техніки Збройних Сил України та закладами вищої військової освіти.\n",
                            "В інституті видається щоквартально Збірник наукових праць, який відповідає вимогам наукових періодичних видань та розміщений на Web-сторінці сайту інституту.\n",
                            "Щорічно інститут є організатором проведення науково-практичної конференції „Пріоритетні напрямки розвитку телекомунікаційних систем та мереж спеціального призначення. Застосування підрозділів, комплексів, засобів зв’язку, автоматизації та кібербезпеки в операції Об’єднаних сил”, до роботи в якій запрошуються провідні науковці вищих навчальних закладів, наукових установ, підприємств всієї країни."
                        ],
                        images: [
                            {
                                id: 16324,
                            } as Image,
                            {
                                id: 16325,
                            } as Image
                        ]
                    } as TextBlock,
                    {
                        textContent: [
                            "Крім того на протязі року науковці, науково-педагогічний склад інституту приймають участь у наукових конференціях та семінарах (втому числі в міжнародних).\n",
                            "Курсанти інституту втілюють свої творчі задуми у воєнно-науковому товаристві курсантів, де вони поглинають у світ науки. Члени товариства щорічно беруть участь у міжнародних та всеукраїнських конкурсах на кращу наукову роботу та посідають призові місця. Щорічно проводиться воєнно-наукова конференція курсантів інституту, яка присвячена Дню науки."
                        ]
                    } as TextBlock
                ]

        } as AccordionElement,
        {
            title: "Ад'юнктура і докторантура",
            textBlocks: [
                {} as TextBlock
            ]

        } as AccordionElement,
        {
            title: "Спеціалізована вчена рада",
            textBlocks: [
                {
                    oLists: [
                        {
                            items: [
                                "Постанова Кабінету Міністрів України «Про затвердження Порядку присудження наукових ступенів» від 24 липня 2013 року № 567\n",
                                "Наказ Міністерства освіти і науки України «Про опублікування результатів дисертацій на здобуття наукових ступенів доктора і кандидата наук» від 23 вересня 2019 року № 1220\n",
                                "Вимоги до опублікованої монографії, що подається на здобуття наукових ступенів доктора і кандидата наук, затверджені наказом Міністерства освіти і науки України від 23 вересня 2019 року № 1220\n",
                                "Наказ Міністерства освіти і науки України «Про оприлюднення дисертацій та відгуків офіційних опонентів» від 14 липня 2015 року № 758\n",
                                "Постанова Кабінету Міністрів України «Про проведення експерименту з присудження ступеня доктора філософії» від 06.03.2019 року № 167"
                            ]
                        } as List
                    ]
                } as TextBlock,
                {
                    uLists: [
                        {
                            title: "На підставі рішення Атестаційної колегії Міністерства освіти і науки України наказ від 28 грудень 2019 р. № 1643 створено спеціалізовану вчену раду СРД 26.710.01 Військового інституту телекомунікацій та інформатизації Міністерства оборони України з правом прийняття до розгляду та проведення захистів дисертацій з грифом \"таємно\" та \"цілком таємно\" на здобуття ступеня доктора (кандидата) технічних наук за спеціальностями:\n",
                            items: [
                                "05.13.06 \"Інформаційні технології\";\n",
                                "20.02.14 \"Озброєння та військова техніка\"."
                            ]
                        } as List
                    ],
                    images: [
                        {
                            id: 16326
                        } as Image,
                        {
                            id: 16327
                        } as Image
                    ],
                    imageTextRows: [
                        {
                            image: {
                                id: 16328
                            },
                            text: "Головою спеціалізованої вченої ради призначено <strong>доктора технічних наук," +
                                " професора" +
                                " Креденцера Бориса Петровича</strong>, спеціальність 20.02.14.\n",
                            imgLeft: true
                        } as ImageTextRow,
                        {
                            image: {
                                id: 16329
                            },
                            text: "Заступником голови спеціалізованої вченої ради призначено <strong>доктора технічних" +
                                " наук," +
                                " професора Романюка Валерія Антоновича</strong>, спеціальність 05.13.06.",
                            imgLeft: false
                        } as ImageTextRow,
                        {
                            image: {
                                id: 16330
                            },
                            text: "Вченим секретарем спеціалізованої вченої ради призначено кандидата <strong>технічних" +
                                " наук," +
                                " доцента Радзівілова Григорія Даниловича</strong>, спеціальність 20.02.14.",
                            imgLeft: true
                        } as ImageTextRow,
                    ]
                } as TextBlock,
                {
                    textContent: [
                        "З моменту створення спеціалізованою вченою радою підготовлено 6 докторів наук та 71 кандидатів наук.",
                    ]
                } as TextBlock,
                {
                    textContent: [
                        "<strong>Повідомлення про захист дисетації на здобуття ступеня доктора філософії:\n</strong>",
                        "Повідомлення про захист дисертації на здобуття ступеня доктора філософії ФЕСЬОХА Віталій Вікторович (29 грудня 2020 року)"
                    ]
                } as TextBlock
            ]

        } as AccordionElement,
        {
            title: "Науково-дослідна робота",
            textBlocks: [
                {
                    textContent: [
                        "<strong>Стан виконання науково-дослідних робіт в інституті</strong>"
                    ],
                    oLists: [
                        {
                            title: "Організація та виконання замовлень на створення наукової (науково-технічної) продукції у Військовому інституті телекомунікацій та інформатизації імені Героїв Крут здійснюється відповідно до:\n",
                            items: [
                                "Наказу Міністерства оборони України «Про затвердження Розподілу основних напрямів наукових досліджень між науковими установами та вищими військовими навчальними закладами Міністерства оборони України та Збройних Сил України» від 26 січня 2017 року № 53 (зі змінами, в редакції від 15.02.2019 № 65)\n",
                                "Річного плану наукової і науково-технічної діяльності Військового інституту телекомунікацій та інформатизації імені Героїв Крут - Згідно підпункту 20.7 наказу начальника Генерального штабу Збройних сил України від 22.11.2017 року № 408 „Про затвердження Переліку відомостей Міністерства оборони України, які містять службову інформацію” (ПСІ-2017) має гриф „Для службового користування”\n",
                                "Перспективного плану наукової і науково-технічної діяльності Військового інституту телекомунікацій та інформатизації імені Героїв Крут до 2023 року - Згідно підпункту 20.7 наказу начальника Генерального штабу Збройних сил України від 22.11.2017 року № 408 „Про затвердження Переліку відомостей Міністерства оборони України, які містять службову інформацію” (ПСІ-2017) має гриф „Для службового користування”."
                            ]
                        } as List
                    ]
                } as TextBlock,
                {
                    textContent: [
                        "<strong>У 2017</strong> році виконувалось 12 науково-дослідних робіт, наукове супроводження виконання 7" +
                        " дослідно-конструкторських робіт, 3 науково-технічні розробки, 188 оперативних завдань.\n",
                        "У 6 НДР ВІТІ був головним виконавцем, у 6 НДР – співвиконавцем.\n",
                        "<strong>У 2018</strong> році виконувалось 11 науково-дослідних робіт, наукове супроводження виконання" +
                        " 11" +
                        " дослідно-конструкторських робіт, 3 науково-технічні розробки, 100 оперативних завдань, наукове супроводження розробки та впровадження 4 військових стандартів.\n",
                        "У 10 НДР ВІТІ є головним виконавцем, у 1 НДР – співвиконавцем.\n",
                        "<strong>У 2019</strong> році виконувалось 11 науково-дослідних робіт, наукове супроводження виконання" +
                        " 11" +
                        " дослідно-конструкторських робіт, 3 науково-технічні розробки, 125 оперативних завдань, наукове супроводження розробки та впровадження 4 військових стандартів.\n",
                        "У 9 НДР ВІТІ є головним виконавцем у 2 НДР – співвиконавцем.\n",
                        "<strong>У 2020</strong> році виконується 15 науково-дослідних робіт, наукове супроводження виконання 6" +
                        " дослідно-конструкторських робіт, 175 оперативних завдань, наукове супроводження розробки та впровадження 4 військових стандартів.\n",
                        "У 14 НДР ВІТІ є головним виконавцем у 1 НДР – співвиконавцем.\n",
                        "Результати виконання науково-дослідних робіт інституту висвітлені у „Звіті про наукову та науково-технічну діяльність Військового інституту телекомунікацій та інформатизації імені Героїв Крут за поточний рік”, який згідно ст. 1.9.3 наказу начальника Служби безпеки України від 12.08.2005 року № 440 „Про затвердження Зводу відомостей, що становлять державну таємницю” (ЗВДТ) має гриф обмеження доступу „Таємно”.\n"
                    ],
                    oLists: [
                        {
                            title: '<strong>Організація та виконання замовлень на створення наукової (науково-технічної)' +
                                ' продукції у Військовому інституті телекомунікацій та інформатизації імені Героїв' +
                                ' Крут</strong>',
                            items: [
                                "Закон України “Про наукову і науково-технічну діяльність” від 26 грудня 2015 р. № 848-VIII.\n",
                                "Закон України “Про державне оборонне замовлення” від 3 березня 1999 року № 464– XIV зі змінами.\n",
                                "Закон України “Про наукову і науково-технічну експертизу” від 10 лютого 1995 року № 51/95 ВР.\n",
                                "ДСТУ 3973-2000. “Система розроблення та поставлення продукції на виробництво. Правила виконання науково-дослідних робіт. Загальні положення”. – Київ, 2001.\n",
                                "ДСТУ 3008:2015 “Звіти у сфері науки і техніки. Структура та правила оформлювання” – Київ, ДП УкрНДНЦ – 2016.\n",
                                "Наказ Міністерства освіти і науки України від 27.10 2008 № 977 Про затвердження Порядку державної реєстрації та обліку відкритих науково-дослідних, дослідно-конструкторських робіт і дисертацій.\n",
                                "Наказ Міністерства освіти і науки України від 01.11 2016 № 1297 Про внесення змін до Порядку державної реєстрації та обліку відкритих науково-дослідних, дослідно-конструкторських робіт і дисертацій.\n",
                                "Наказ Міністерства освіти і науки України від 09.06 2009 № 494 Про Порядок державного обліку секретних науково-дослідних, дослідно-конструкторських робіт і дисертацій."
                            ]
                        } as List,
                        {
                            title: '<strong>Ввідомості необхідні для реєстрації НДР (ДКР)</strong><p>Виконавець у' +
                                ' 30-денний строк з початку НДР (ДКР) подає до УкрІНТЕІ документи.\n</p>',
                            items: [
                                "Відомості про замовника: код за ЄДРПОУ (Ідентифікаційний номер); повне найменування юридичної особи (або П.І.Б.); місцезнаходження; телефон/Факс; E-mail/WWW.\n",
                                "Джерела та обсяги фінансування: КПКВК; назва державної цільової програми, в рамках якої виконується НДР (ДКР); код державної цільової програми згідно з переліком, затвердженим Мінекономіки; код джерела фінансування; загальний обсяг фінансування.",
                                "Терміни виконання роботи: початок та закінчення.\n",
                                "Основні відомості про НДР: назва НДР (1- українською мовою, 3- англійською мовою); мета НДР.\n",
                                "Заключні відомості: індекс УДК; П.І.Б. керівника розробки (1- українською мовою, 3- англійською мовою) науковий ступінь, вчене звання; П.І.Б. відповідального виконавця."
                            ]
                        } as List,
                        {
                            title: '<strong>Відомості необхідні для подання облікових та звітніх документів з' +
                                ' НДР</strong><p>Виконавець у 30-денний строк з моменту закінчення НДР (ДКР) подає' +
                                ' документи.\n</p>',
                            items: [
                                "Реферат (1- українською мовою, 3- англійською мовою).\n",
                                "Бібліографічний опис (статей, монографій, нормативно-технічної документації тощо).\n",
                                "Список виконавців (П.І.Б., Код посади, науковий ступінь, вчене звання).\n",
                                "Реферат – у стислій формі, не повторюючи назви НДР (ДКР), викладається основний зміст результатів НДР (ДКР): об’єкт дослідження (проектування), мета дослідження, методи дослідження та апаратура, теоретичні і практичні результати, новизна, ефективність впровадження, сфера (галузь) використання.\n",
                                "Бібліографічний опис (статей, монографій, нормативно-технічної документації тощо) – якщо результати НДР (ДКР) опубліковані, депоновані, захищені патентом або її результатом є тиражований нормативно-технічний чи інструктивно-методичний документ (його проект), то в цьому випадку зазначається бібліографічний опис відповідних документів."
                            ]
                        } as List,
                        {
                            title: '<strong>Відомості для оформлення інформаційної картки науково-технічної продукції' +
                                ' (НТП)</strong>',
                            items: [
                                "Назва НТП українською та англійською мовами.",
                                "Короткий опис науково-технічної розробки (максимум 500 знаків).\n",
                                "Технічні переваги НТП, науково-технічний рівень щодо кращих вітчизняних та зарубіжних аналогів (прототипів).\n",
                                "Економічна привабливість НТП для просування на ринок, впровадження та реалізації, показники, вартість.\n",
                                "Вплив науково-технічної розробки на зовнішнє середовище, її екологічність.\n",
                                "Строки впровадження науково-технічної розробки, виробники НТП, можливі споживачі, перспективні ринки збуту.",
                                "Відомості про власника НТП: код за ЄДРПОУ, повне найменування юридичної особи, місцезнаходження, телефон/факс, ПІБ власника НТП, відомча підпорядкованість, номер та дата видачі юридичного документа, який засвідчує право власності на НТП."
                            ]
                        } as List
                    ]
                } as TextBlock
            ]

        } as AccordionElement,
        {
            title: "Збірники наукових праць",
            textBlocks: [
                {} as TextBlock
            ]

        } as AccordionElement,
        {
            title: "Наукова робота здобувачів вищої освіти",
            textBlocks: [
                {} as TextBlock
            ]

        } as AccordionElement,
        {
            title: "Хакатон з питань галузі безпеки і оборони України",
            textBlocks: [
                {
                    textContent: [
                        "<strong>НАЦІОНАЛЬНИЙ ХАКАТОН З ПИТАНЬ ГАЛУЗІ БЕЗПЕКИ І ОБОРОНИ УКРАЇНИ</strong>"
                    ]
                } as TextBlock,
                {
                    images: [
                        {
                            id: 16331
                        } as Image,
                        {
                            id: 16332
                        } as Image
                    ]
                } as TextBlock,
                {
                    textContent: [
                        "Другий Національний оборонний хакатон відповідає формату змагань НАТО TIDE Hackaton\n",
                        "У Києві стартував другий Національний оборонний хакатон\n",
                        "У Києві триває робота Другого Національного оборонного хакатону\n",
                        "У Києві завершився другий Національний оборонний хакатон\n",
                        "Перемога курсантів ВІТІ у Другому Національному оборонному хакатоні\n"
                    ]
                } as TextBlock,
                {
                    textContent: [
                        "<strong>TIDE Hackathon 2020 (м. Мюнхен, ФРН)</strong>",
                    ],
                    images: [
                        {
                            id: 16333
                        } as Image,
                        {
                            id: 16334
                        } as Image
                    ]
                } as TextBlock,
                {
                    textContent: [
                        "<strong>«TIDE Hackathon 2020»: 4 команди від ЗС України взяли участь у змаганнях експертів міжнародного рівня з програмування НАТО</strong>",
                    ],
                    images: [
                        {
                            id: 16335
                        } as Image,
                        {
                            id: 16336
                        } as Image
                    ],
                    imageTextRows: [
                        {
                            image: {
                                id: 16337
                            },
                            text: "<strong>НАТО TIDE Hackathon 2020: курсанти ВІТІ посіли друге місце на міжнародних змаганнях із програмування</strong>",
                            imgLeft: false
                        } as ImageTextRow
                    ]
                } as TextBlock,
            ]

        } as AccordionElement,
        {
            title: "Наукометричні міжнародні бази даних",
            textBlocks: [
                {} as TextBlock
            ]

        } as AccordionElement
    ]
}
