import {Page} from "../../../entities/page";
import {Image} from "../../../entities/image";
import {RouterNames} from "../../enums/RouterNames";
import {ImageTextRow, List} from "../../../entities/text-block/model/types";

export const heroesPage: Page = {
    title: "Герої не вмирають",
    titleImage: {id: 16241} as Image,
    name: RouterNames.HEROES.name,
    textBlocks: [
        {title: "Герої не вмирають"},
        {
            imageTextRows: [
                {
                    image: {id: 16242} as Image,
                    text: "<h2>МЕМОРІЛ ЗАГИБЛИМ ОФІЦЕРАМ-ЗВЯЗКІВЦЯМ</h2><br>Військового інституту телекомунікацій та інформатизації імені Героїв Крут",
                    imgLeft: true
                },
            ]
        },
        {
            textContent: [
                "МЕМОРІАЛ загиблим офіцерам-зв’язківцям Військового інституту телекомунікацій та інформатизації імені Героїв Крут – меморіальний комплекс, який присвячений випускникам інституту, що загинули в зоні проведення Антитерористичної операції на території Донецької та Луганської областей проти російського агресора.\n",
                "Сам МЕМОРІАЛ включає в себе вимощену доріжку, 2 бетонні тумби з гранітним покриттям, 1 гранітний бюст Герою України генерал-майору Максиму ШАПОВАЛУ та зелені насадження. Знаходиться на території Військового інституту на Алеї героїв.\n",
                "З метою вшанування пам'яті офіцерів-звязківців, випускників інституту на Алеї Героїв інституту <strong>12 жовтня 2016 року</strong>, було відкрито МЕМОРІАЛ загиблим випускникам інституту за нашу вільну незалежну Україну. В урочистих заходах з нагоди відкриття МЕМОРІАЛУ взяли участь представники керівного складу ГШ ЗС України, рідні та близькі загиблих воїнів, представники духовенства, громадсько-політичні діячі, волонтери, військовослужбовці інституту та журналісти.\n",
                "На постаменті МЕМОРІАЛУ височіють два гранітні обеліски. Один з яких на честь вшанування пам’яті полковника Ігоря Павлова, який загинув у зоні АТО, виявивши мужність, героїзм, відвагу і самовіддані дії під час виконання військового обов’язку з захисту державного суверенітету та територіальної цілісності України.<strong> Начальник кафедри тактико-спеціальної підготовки факультету захисту інформації Військового інституту телекомунікацій та інформатизації, кандидат технічних наук, доцент полковник Павлов Ігор Миколайович був навічно зарахований до списку особового складу Військового інституту</strong>.Він був справжнім офіцером, високофаховим спеціалістом, науковцем, викладачем, патріотом України, людиною рідкісної доброти та порядності. Другий обеліск на честь вшанування пам’яті загиблим в АТО офіцерам-зв’язківцям випускникам нашого вишу."
            ]
        },
        {
            textContent: [
                "<strong>СПИСОК ЗАГИБЛИХ ВИПУСКНИКІВ ІНСТИТУТУ:<strong/>"
            ],
            oLists: [
                {
                    items: [
                        " полковник Кифоренко Борис Борисович,11.04.1974 - 29.08.2014.\n",
                        "2. полковник Соснюк Віктор Володимирович, 06.06.1973 – 17.02.2015.\n",
                        "3. полковник Павлов Ігор Миколайович, 28.05.1968 – 09.02.2015.\n",
                        "4. підполковник Музика Артур Сергійович, 13.05.1978 – 09.02.2015.\n",
                        "5. підполковник Василенко Святослав Вікторович, 26.04.1982 – 09.02.2015.\n",
                        "6. підполковник Сніжок Ігор Сергійович, 06.12.1973 – 02.02.2015 (добавился в 2019 ).\n",
                        "7. майор Губа Яків Миколайович, 28.11.1984 – 29.08.2014.\n",
                        "8. майор Хмельнийький Віктор Іванович,07.06.1978 – 28.08.2014.\n",
                        "9. майор Балагланов Павло Юрійович, 28.04.1974 – 29.08.2014.\n",
                        "10. майор Андрієць Олег Анатолійович, 23.04.1973 – 01.09.2014.\n",
                        "11. капітан Сковородін Олексій Володимирович, 18.03.1975 – 26.08.2014.\n",
                        "12. капітан Обухівський Олег Васильович,14.03.1980 – 13.08.2014.\n",
                        "13. капітан Шевчук Сергій Іванович, 25.11.1977 – 29.08.2014.\n",
                        "14. капітан Білокобильський Сергій Михайлович 25.01.1983 – 19.07.2014.\n",
                        "15. капітан Лимарь Сергій Вікторович, 21.02.1989 – 21.08.2014."
                    ]
                } as List
            ]
        },
        {
            textContent: [
                "Обеліски, водночас, символізують і скорботу, і гордість – скорботу за нашими офіцерами, які героїчно загинули виконавши свій обов’язок, а гордість за те,що є справжні захисники Батьківщини, для яких доля рідної країни дорожче власного життя. Ці обеліски продовжують Алею героїв-зв’язківців, які віддали своє життя, захищаючи Батьківщину в роки ІІ Світової війни. Це теж символічно, оскільки у всі часи захищати власний народ, рідну землю було почесно й відповідально.\n",
                "<strong>Й тому військовослужбовці вишу з честю виконували, виконують і будуть виконувати цей сакральний обов’язок. Серед військовослужбовців інституту 184 учасників АТО, з них 65 курсантів. За успішне виконання бойових завдань, сумлінне виконання службових обов’язків 17 військовослужбовців інституту нагороджені відзнакою Президента України «За участь в АТО». 7 старших офіцерів інституту відзначені державними нагородами: Орденом Бохдана Хмельницького ІІІ ст. – 5 із них 1 (посмертно), Орденом «За мужність» ІІІ ст. – 1, Орденом княгині Ольги ІІІ ст. – 1, 4 військовослужбовця нагороджені відзнаками Міністра оборони України, 111 військовослужбовців - відзнаками Начальника Генерального штабу – Головнокомандувача Збройних Сил України.</strong>"
            ]
        },
        {
            textContent: [
                '<strong>ПЕРШИЙ УКРАЇНСЬКИЙ «КІБОРГ» ГЕРОЙ УКРАЇНИ МАКСИМ ШАПОВАЛ.</strong>',
                "<strong>27 жовтня 2017 року у Військовому інституті телекомунікацій та інформатизації відбулась знаменна подія — урочисто відкрито пам’ятник випускнику військового навчального закладу 2000 року Герою України генерал-майору Максиму Шаповалу.\n</strong>",
                "В церемонії взяли участь начальник Головного управління розвідки МО України генерал-лейтенант Василь Бурба, перший заступник начальника Головного управління розвідки МО України — заступник начальника Генерального штабу ЗС України генерал-майор Олег Іващенко, представники громадськості та духовенства.\n",
                "— Україна втратила справжнього патріота, офіцера та відважного сина своєї Батьківщини. Це знаменна дата, адже саме на території навчального закладу, де навчався Максим, відкривається пам’ятник йому. Ворог не зміг здолати його у відкритому бою й вчинив підступний злочин. Він зустрів війну у званні полковника на посаді командира елітного підрозділу Головного управління розвідки.\n",
                "Указом Президента України від 30 червня 2017 року № 169/2017 полковнику Шаповалу Максиму Михайловичу присвоєно військове звання генерал-майора (посмертно).\n",
                "Його навічно зараховано до списків військової частини, якою він командував, та внесено в Книгу Слави Головного управління розвідки Міністерства оборони України, що була заснована з метою увічнення пам’яті осіб, які зробили вагомий внесок у розбудову воєнної розвідки України. Указом Президента України від 7 вересня 2017 року № 264/2017 за мужність і героїзм, виявлені у захисті державного суверенітету та територіальної цілісності України, вагомий особистий внесок у зміцнення обороноздатності та безпеки держави, самовіддане служіння Українському народові генерал-майору Шаповалу Максиму Михайловичу присвоєно звання Героя України з удостоєнням ордена «Золота Зірка» (посмертно). Тепер гранітний бюст Героя України генерал-майора Максима Шаповала височіє на Алеї героїв Військового інституту телекомунікацій та інформатизації.\n",
                "Начальник Військового інституту телекомунікацій та інформатизації імені Героїв Крут полковник Євгеній Степаненко та курсанти вишу 27 червня 2018 року взяли участь у відкритті меморіальної дошки випускнику ВІТІ генерал-майору розвідки Міноборони, Герою України Максиму Шаповалу. Пам’ятну дошку встановили на будинку, в якому жив і біля якого загинув Максим Шаповал."
            ]
        },
        {
            textContent:[
                "<strong>Біографічні дані:</strong>",
                "Народився Максим Михайлович Шаповал 6 лип-ня 1978 року в місті Вінниця у родині військового льотчика.\n" ,
                "Після закінчення школи обрав професію військового, як його батько й дід, закінчив Військовий інститут Національного технічного університету України та розпочав службу у військових частинах розвідки.\n" ,
                "За час служби брав участь у миротворчих операціях. Перед початком війни очолив спеціальний резерв Головного управління розвідки Міністерства оборони України.\n" ,
                "З початку російської збройної агресії Максим Михайлович виконував завдання щодо захисту незалежності і територіальної цілісності України в зоні проведення антитерористичної операції на території Донецької та Луганської областей.\n" ,
                "Був учасником найбільш важких боїв 2014–2015 років. У цей найскладніший час воїни-розвідники часто виконували бойові завдання ціною власного життя. Вони не зрадили, не сховалися за спинами інших, мужньо переносили надлюдські навантаження і разом з тим – майстерно виконували свою роботу.\n" ,
                "Безпосередньо брав участь у звільненні декількох окупованих українських міст, боях за стратегічно важливу висоту – Савур-Могилу, а також у плануванні та проведенні розвідувальних рейдів у глибокий тил противника.\n" ,
                "Максим Шаповал зробив вагомий особистий внесок у документування злочинної присутності збройних сил країни-агресора – Росії на території нашої держави. Організовував та проводив роботу щодо викриття кадрових військовослужбовців російських окупаційних військ, які вели бойові дії проти українських воїнів.\n" ,
                "Деякі операції, які проводив полковник Шаповал, стосувалися своєчасного оповіщення про розгортання російської артилерії, завдяки чому вдалося врятувати життя сотням українських військових та мирних мешканців, які могли загинути під ударами російських окупантів. Більшість часу Максим Михайлович проводив зі своїм підрозділом в районі проведення АТО та особисто очолював розвідувальні групи.\n" ,
                "У травні 2014 року він командував групою, яка звільняла Донецький аеропорт, та був першим із тих мужніх та сильних духом воїнів, яких навіть ворог, вражений їх безстрашністю та стійкістю, прозвав “кіборгами”.\n" ,
                "Максим Шаповал був справжнім професіоналом, офіцером з унікальними знаннями та навичками і головне – безмежно любив Україну. Полковник Максим Шаповал трагічно загинув 27 червня 2017 року внаслідок зухвалого терористичного акту, спланованого російськими спецслужбами. Похований на Байковому кладовищі в столиці України.\n" ,
                "З першого дня офіцерської служби і до останнього подиху Максим Шаповал проходив службу у воєнній розвідці. Його мужність і відвага, патріотизм та відданість своїй справі є прикладом для всіх курсантів та військовослужбовців інституту та співробітників воєнної розвідки України та Збройних Сил України."
            ]
        }

    ]
}