import {Page} from "../../../entities/page";
import {RouterNames} from "../../enums/RouterNames";
import {Image} from "../../../entities/image";
import {List, TextBlock} from "../../../entities/text-block";
import {ImageTextRow} from "../../../entities/text-block/model/types";

export const historyPage: Page = {
    name: RouterNames.HISTORY.name,
    title: "Історична довідка",
    titleImage: {id: 16297} as Image,
    textBlocks: [
        {
            title: "Історична довідка"
        } as TextBlock,
        {
            textContent: [
                "Постановою Кабінету Міністрів України від <strong>19 серпня 1992 року №490</strong> було створено" +
                " <strong>Київській військовий інститут управління і зв’язку</strong> на базі Київського вищого" +
                " військового двічі Червонопрапорного інженерного училища зв’язку ім. М. І. Калініна і Київського вищого інженерного радіотехнічного училища ППО імені маршала авіації О. І. Покришкіна.",
                "Згідно Указу Президента України від 30.10. 2000 р. №1173/2000 «Про впорядкування присвоєння" +
                " почесних найменувань військовим частинам та установам» та наказу начальника інституту (по стройовій частині) від 13.02.2001 р. №30 Київський військовий інститут управління і зв’язку перейменований в <strong>Київський військовий двічі орденів Червоного Прапора інститут управління і зв’язку.</strong>",
                "Постановою Кабінету Міністрів України від <strong>22 березня 2001 року №269,</strong> Директивою" +
                " Міністра оборони України від <strong>11.06.01.№Д-115/1/3280</strong>, наказом Начальника ГШ ЗС" +
                " України від <strong>18.07.01 №28</strong> було створено <strong>Військовий двічі орденів Червоного прапору" +
                " інститут телекомунікацій та інформатизації Національного технічного університету України" +
                " «Київський політехнічний інститут».</strong>",
                "Згідно розпорядження Кабінету Міністрів України від <strong>26 червня 2013 року № 509-р</strong>," +
                " спільної директиви Міністерства оборони України та Генерального штабу ЗС України від" +
                " <strong>01.07.13 №Д-322/1/02</strong> було змінено назву Військового інституту телекомунікацій та" +
                " інформатизації Національного технічного університету України «Київський політехнічний інститут» на <strong>Військовий інститут телекомунікацій та інформатизації Державного університету телекомунікацій.</strong>",
                "Постановою Кабінету Міністрів України від <strong>30 січня 2015 року №94</strong>, спільною" +
                " директивою Міністерства оборони України та Генерального штабу Збройних Сил України від" +
                " <strong>01.04.15 року №Д-322/1/11ДСК</strong> було змінено назву <strong>Військовий інститут" +
                " телекомунікацій та інформатизації Державного університету телекомунікацій на Військовий інститут телекомунікацій та інформатизації.</strong>"
            ]
        } as TextBlock,
        {
            imageTextRows: [
                {
                    image: {
                        id: 16298,
                        contentType: "",
                        imageFilename: ""
                    },
                    text: "<strong>24 серпня 2015 року Військовому інституту телекомунікацій та інформатизації" +
                        " вручено Бойовий прапор.</strong>",
                    imgLeft: true
                } as ImageTextRow,
                {
                    image: {
                        id: 16299,
                        contentType: "",
                        imageFilename: ""
                    },
                    text: "<strong>До 100-ї річниці історичних подій під Крутами</strong> та з метою вшанування" +
                        " подвигу Героїв Крут і військово-патріотичного виховання військовослужбовців Збройних Сил" +
                        " України, <strong>Президент України – Верховний Головнокомандувач Збройних Сил України Петро Порошенко 29 січня 2018 року присвоїв Військовому інституту телекомунікацій та інформатизації почесне найменування імені Героїв Крут.</strong>",
                    imgLeft: false
                } as ImageTextRow,
            ]
        } as TextBlock,
        {
            textContent: [
                "Відповідний Указ Глава держави  підписав під час відвідування інституту на урочистостях у присутності всього особового складу."
            ]
        } as TextBlock,
        {
            images: [
                {
                    id: 16300,
                    contentType: "",
                    imageFilename: ""
                } as Image,
                {
                    id: 16301,
                    contentType: "",
                    imageFilename: ""
                } as Image
            ]
        } as TextBlock,
        {
            imageTextRows: [
                {
                    image: {
                        id: 16302,
                        contentType: "",
                        imageFilename: ""
                    },
                    text: "З нагоди присвоєння інституту імені Героїв Крут Верховний Головнокомандувач ЗС України вручив начальнику інституту полковнику Євгену Степаненку бойовий прапор інституту.",
                    imgLeft: true
                } as ImageTextRow
            ]
        } as TextBlock,
        {
            textContent: [
                "Згідно наказу начальника Військового інституту телекомунікацій та інформатизації імені Героїв Крут" +
                " від 17.01.2019 року №31 та листа від Української інституту національної пам’яті №91/42-06-19 від 17.01.2019 року <strong>Днем створення інституту встановлено 29 січня 1918 року.</strong>"
            ]
        } as TextBlock,
        {
            images: [
                {
                    id: 16303,
                    contentType: "",
                    imageFilename: ""
                } as Image,
                {
                    id: 16304,
                    contentType: "",
                    imageFilename: ""
                } as Image,
                {
                    id: 16305,
                    contentType: "",
                    imageFilename: ""
                } as Image,
                {
                    id: 16306,
                    contentType: "",
                    imageFilename: ""
                } as Image
            ]
        } as TextBlock,
        {
            textContent: [
                "<strong>Додаток до історичної довідки</strong>",
                "<strong>І. Передісторія навчального закладу (1835-1917).</strong>",
                "1835 рік – розпочато будівництво оборонної казарми на два батальйони на території Печерської фортеці.",
                "1839 рік – завершення будівництва будівлі і введення її в експлуатацію. Відкрита школа кантоністів.",
                "1865 рік – на базі школи кантоністів створено Київське піхотне юнкерське училище.",
                "1897 рік – училище перейменовано з Київського піхотного юнкерського училища в Київське військове училище.",
                "1915 року Київське військове училище перейменовано на 1-ше Київське Костянтинівське військове училище.",
                "5 листопада 1917 року, після збройних сутичок з більшовиками, особовий склад Київського Костянтинівського військового училища захопив потяг і виїхав на Кубань, де в подальшому приймав участь у боях з загонами Червоної армії.",
                "За роки свого існування училище підготувало тисячі офіцерів. Серед них було багато таких, які під час Української Революції 1917-1921 років служили у війську УНР, Української держави та Дієвій Армії УНР.",
                "Відомі випускники:",
                "<strong>Сікевич Володимир Васильович</strong>  — український військовий і політичний діяч;" +
                " генерал-хорунжий" +
                " армії Української Народної Республіки (генерал-поручник у еміграції).",
                "<strong>Трутенко Валентин Максимович</strong>  — український військовий діяч; генерал-хорунжий" +
                " армії Української Народної Республіки.",
                "<strong>Дроздовський Лев Антонович</strong> — український військовий і політичний діяч;" +
                " генерал-хорунжий армії Української Народної Республіки, військовий аташе УНР в Швейцарії та Італії.",
                "<strong>Ніколіч Микола Миколайович</strong>  — генеральний хорунжий Армії Української Держави." +
                " Ізотов Сергій Васильович —  полковник Дієвої армії УНР."
            ]
        } as TextBlock,
        {
            textContent: [
                "<strong>ІІ. Період Української революції (1917-1921).</strong>",
                "<strong>20 листопада 1917 року на території Костянтинівського військового училища за наказом Генерального секретаря з військових справ Симона Петлюри була розгорнута Перша українська військова юнацька школа. Школі було присвоєно ім'я гетьмана Богдана Хмельницького.</strong>",
                "В січні 1918 року, коли війська червоногвардійців загрожували захопленням столиці Української Республіки, юнкера з 1-ї української військової юнацької школи взяли активну участь у боях з червоногвардійцями, зокрема в бою під Крутами, захищаючи Центральну Раду.",
                "Упродовж 21-26 січня 1918 року старшини та юнкери Першої Київської юнацької школи ім. Б.Хмельницького, студенти Університету Святого Володимира та Українського народного університету, які виявили бажання захищати свою країну, збиралися у казармах колишнього Костантинівського військового училища, де відбувався початковий військовий вишкіл.",
                "29 січня 1918 року під станцією Крути 450 юнкерів і 20 старшин 1-ї Української військової юнацької школи імені Богдана Хмельницького спільно з сотнею (116–130 осіб) новоствореного добровольчого Помічного Студентського куреня січових стрільців вступили в бій з переважаючими силами ворога, та затримали ворога на чотири дні, що дозволило українському урядові забезпечити визнання української державності на міжнародному рівні.",
                "З п’яти сотень воїнів, які нехтуючи своїм молодим життям, закрили власними грудьми рідний Київ – 140 юнаків і старшин загинули, до 150 було поранено, чи потрапили в полон та були жорстоко закатовані ворогом."
            ]
        } as TextBlock,
        {
            imageTextRows: [
                {
                    image: {
                        id: 16307,
                        contentType: "",
                        imageFilename: ""
                    },
                    text: "Перед розстрілом 28 українських героїв, серед яких були юнкери Божко-Божинський, Тарнавський, Соколовський, М.Лизогуб, О.Попович, В.Шульгін, М.Ганкевич, заспівали національний гімн “Ще не вмерла Україна”.",
                    imgLeft: false
                } as ImageTextRow
            ]
        } as TextBlock,
        {
            textContent: [
                "<strong>ІІІ. Радянській період історії (1919-1991).</strong>",
                "В 1919 році радянська влада організувала інженерні курси (коли Реввоєнрада республіки затвердила штати Інженерних курсів по підготовці командного складу Робітничо-Селянської Червоної Армії. На цих курсах навчались курсанти саперно-будівельного, шляхо-мостового та електротехнічного відділень (зв’язківці). 23 квітня 1920 року курси двома ешелонами виїхали із Москви у Київ. Проте, через загрозу захвату польською армією м.Києва, курси розташувалися на іподромі м. Харкова. 16 серпня 1920 року Московські інженерні курси прибули в м. Київ і розташувались у будівлі училища на Печерську.",
                "11 серпня 1920 року курси були перейменовані у 2 Київські військово-інженерні курси чисельністю 600 чоловік,а 21 січня 1921 року - в 3 Київську військову інженерну школу. 01.11.1924 перейменовані на військову школу зв'язку, яка з часом перетворилась на Київське вище військове інженерне двічі Червонопрапорне училище зв'язку ім.М.І.Калініна (1968 - 1992)."
            ]
        } as TextBlock,
        {
            textContent: [
                "<strong>ІV. Часи Незалежності України.</strong>",
                "2 жовтня 1994 року Київському військовому інституті управління і зв’язку вручено Бойовий Червоний Прапор.",
                "З 2001 року військовий інститут перейшов до нової технології навчання – підготовки бакалаврів та присвоєння наукового ступеня магістра.",
                "4 травня 1995 року на території інституту, на Алеї Героїв була відкрита стела на честь майже 2000 випускників, що загинули у роки Другої світової війни.",
                "Наказом Міністра оборони України №252 від 07.08.2000 р. \"За мужність і героїзм, проявлені в роки Другої Світової війни, значний особистий внесок у захист Батьківщини від фашистських загарбників та з метою підвищення рівня військово – патріотичного виховання особового складу військ зв’язку ЗС України на бойових традиціях фронтового покоління захисників Вітчизни почесним солдатом Київського військового інституту управління і зв’язку ЗАРАХОВАНО Героя Радянського Союзу, учасника вигнання нацистів з Києва генерал – лейтенанта у відставці Пилипенка Михайла Корнійовича\", який з 1973 по 1989 роки був начальником цього навчального закладу.",
                "29 січня 2008 року з нагоди 90-ї річниці бою під Крутами на будівлі Військового інституту телекомунікацій та інформатизації було встановлено меморіальну дошку.",
                "Наказом Міністра оборони України від 29.01.2016 року №47 \"За виявлення мужності, героїзму, відваги і самовіддані дії під час виконання військового обов’язку в районі проведення АТО на території Донецької та Луганської областей ЗАРАХОВАНО НАВІЧНО до списків Військового інституту телекомунікацій та інформатизації полковника Павлова Ігоря Миколайовича\", начальника кафедри тактико-спеціальної підготовки факультету Захисту інформації Військового інституту телекомунікацій та інформатизації.",
                "На честь вшанування пам’яті випускників вишу, які виявили мужність, героїзм, відвагу і самовіддані дії під час виконання військового обов’язку з захисту державного суверенітету та територіальної цілісності України по забезпеченню зв’язку в зоні проведення Антитерористичної операції на території Донецької та Луганської областей 12 жовтня 2016 року на Алеї Героїв інституту — відкрито Меморіал загиблим випускникам в АТО офіцерам-зв’язківцям (14 офіцерів, із них полковників -3, підполковників – 2, майорів –4, капітанів -5).",
                "27 жовтня 2017 року, у Військовому інституті телекомунікацій та інформатизації відбулась знаменна" +
                " подія — відкрито пам’ятник випускнику вишу 2000-го року, <strong>учаснику АТО, Герою України генерал-майору Максиму Михайловичу Шаповалу, який загинув від терористичного акту в м. Києві.</strong>",
                "За роки Незалежності України в Інституті підготовлено понад п’ять тисяч висококласних спеціалістів для Збройних Сил України та інших військових формувань.",
                "Досвід боїв вкотре довів, якою важливою фігурою на полі бою був і залишається офіцер. Саме від його компетентності, професіоналізму, патріотизму, сили духу залежить не тільки результат битви, а й життя солдат.",
                "Серед військовослужбовців інституту 184 учасника АТО з них 65 курсантів.",
                "За успішне виконання бойових завдань, сумлінне виконання службових обов’язків 17 військовослужбовців інституту нагороджені відзнакою Президента України «За участь в АТО».",
                "7 старших офіцерів інституту відзначені державними нагородами: Орденом Богдана Хмельницького ІІІ ст. – 5 із них 1 (посмертно), Орденом «За мужність» ІІІ ст. – 1, Орденом княгині Ольги ІІІ ст. – 1, 4 військовослужбовця нагороджені відзнаками Міністра оборони України, 111 військовослужбовців - відзнаками Начальника Генерального штабу – Головнокомандувача Збройних Сил України."
            ]
        } as TextBlock,
        {
            uLists: [
                {
                    title: "<strong>Начальники військового інституту з 2001 року по т.ч.:</strong>",
                    items: [
                        "Полковник Тетерятник Віктор Данілович (14.07.2001- 17.11.2003), на теперішній час пенсіонер МО України;",
                        "Генерал-майор Міночкін Анатолій Іванович (18.03.2004-23.02.16), на теперішній час пенсіонер МО України;",
                        "Полковник Степаненко Євген Олексндрович (26.04.2016- т.ч.)."
                    ]
                } as List
            ]
        } as TextBlock,
        {
            textContent: [
                "<strong>Інститут по праву заслужив високе звання імені Героїв Крут. Ним будуть пишатися і ті, хто навчається зараз, і ті, хто вже завершив його та служить в українському війську!</strong>"
            ]
        } as TextBlock,
        {
            images: [
                {
                    id: 16308,
                    contentType: "",
                    imageFilename: ""
                } as Image,
                {
                    id: 16309,
                    contentType: "",
                    imageFilename: ""
                } as Image,
                {
                    id: 16310,
                    contentType: "",
                    imageFilename: ""
                } as Image,
                {
                    id: 16311,
                    contentType: "",
                    imageFilename: ""
                } as Image
            ]
        } as TextBlock
    ]
}