import {Page} from "../../../entities/page";
import {Image} from "../../../entities/image";
import {RouterNames} from "../../enums/RouterNames";
import {List, TextBlock} from "../../../entities/text-block";
import {Superior} from "../../../entities/superior";

export const faculty3Page = {
    titleImage: {id: 1} as Image,
    title: "Факультети",
    name: RouterNames.FACULTY_3.name,
    textBlocks: [
        {
            title: "Факультет бойового застосування систем управління та зв'язку"
        } as TextBlock,
        {
            textContent: [
                "Факультет призначений для підготовки висококваліфікованих офіцерських кадрів за освітньо-кваліфікаційним рівнем «бакалавр», «магістр» та фахівців заочної форми навчання з числа військовослужбовців за контрактом."
            ]
        } as TextBlock,
        {
            superiors: [
                {
                    fullName: "ПОНОМАРЬОВ Олександр Анатолійович",
                    position: "Начальник факультету",
                    achievements: [
                        "учасник бойових дій"
                    ],
                    image: {
                        id: 1,
                        contentType: "",
                        imageFilename: ""
                    } as Image,
                    militaryRank: "полковник"
                } as Superior,
                {
                    fullName: "КУЗЮРА Сергій Леонідович",
                    position: "Заступник начальника факультету з навчальної та наукової роботи - начальник" +
                        " навчальної частиник",
                    achievements: [
                        "учасник бойових дій"
                    ],
                    image: {
                        id: 1,
                        contentType: "",
                        imageFilename: ""
                    } as Image,
                    militaryRank: "підполковник"
                } as Superior,
                {
                    fullName: "РИЖКОВ Андрій Юрійович",
                    position: "Заступник начальника факультету з морально-психологічного забезпечення",
                    achievements: [
                        "учасник бойових дій"
                    ],
                    image: {
                        id: 1,
                        contentType: "",
                        imageFilename: ""
                    } as Image,
                    militaryRank: "підполковник"
                } as Superior,
            ]
        } as TextBlock,
        {
            uLists: [
                {
                    title: "На Факультеті здійснюється підготовка за спеціальностями:",
                    items: [
                        "“Кібербезпека” за спеціалізацією “Захист інформації та кібернетична безпека в інформаційно-телекомунікаційних системах”;",
                        "“Військове управління (за видами збройних сил)” за спеціалізацією “Управління діями підрозділів зв’язку”;",
                        "“Озброєння та військова техніка” за спеціалізацією “Радіоелектронні інформаційні системи, оперативна техніка та спецозброєння”."
                    ]
                } as List
            ]
        } as TextBlock,
        {
            images: [
                {
                    id: 1,
                    contentType: "",
                    imageFilename: ""
                } as Image,
                {
                    id: 1,
                    contentType: "",
                    imageFilename: ""
                } as Image
            ]
        } as TextBlock,
        {
            textContent: [
                "ДО СКЛАДУ ФАКУЛЬТЕТУ ОРГАНІЗАЦІЙНО ВХОДЯТЬ 3 КАФЕДРИ:"
            ]
        } as TextBlock,
        {
            superiors: [
                {
                    textContent: [
                        "Кафедра \"БОЙОВОГО ЗАСТОСУВАННЯ ПІДРОЗДІЛІВ ЗВ’ЯЗКУ\"",
                        "Кафедра здійснює теоретичну та практичну підготовку курсантів інституту з" +
                        " тактико-спеціальних дисциплін в інтересах підготовки фахівців інформаційно - телекомунікаційних систем та мереж військового призначення.",
                        "Кафедра забезпечує підготовку майбутніх офіцерів інформаційно-телекомунікаційних мереж в комплексі з усіма кафедрами інституту, надаючи практичні навички з управління інформаційними та телекомунікаційними системами з урахуванням досвіду АТО, а також проводить підготовку на курсах підвищення кваліфікації офіцерів (слухачів) призваних за мобілізацією."
                    ],
                    fullName: "ПИВОВАРЧУК Сергій Андрійович",
                    position: "Начальник кафедри",
                    achievements: [
                        "учасник бойових дій"
                    ],
                    image: {
                        id: 1,
                        contentType: "",
                        imageFilename: ""
                    } as Image,
                    militaryRank: "полковник"
                } as Superior
            ]
        } as TextBlock,
        {
            uLists: [
                {
                    title: "Тактико-спеціальні дисципліни по яких здійснюється підготовка:",
                    items: [
                        "основи організації роботи органів управління;",
                        "основи управління та прийняття рішень у військовій справі;",
                        "бойове застосування систем та комплексів військового зв’язку з’єднання;",
                        "організація військового зв’язку;",
                        "експлуатація засобів інформаційно-телекомунікаційних систем;",
                        "організація зв’язку в тактичній ланці управління;",
                        "організація зв’язку."
                    ]
                } as List
            ]
        } as TextBlock,
        {
            images: [
                {
                    id: 1,
                    contentType: "",
                    imageFilename: ""
                } as Image,
                {
                    id: 1,
                    contentType: "",
                    imageFilename: ""
                } as Image,
                {
                    id: 1,
                    contentType: "",
                    imageFilename: ""
                } as Image,
                {
                    id: 1,
                    contentType: "",
                    imageFilename: ""
                } as Image,
                {
                    id: 1,
                    contentType: "",
                    imageFilename: ""
                } as Image,
                {
                    id: 1,
                    contentType: "",
                    imageFilename: ""
                } as Image
            ]
        } as TextBlock,
        {
            superiors: [
                {
                    textContent: [
                        "Кафедра \"СПЕЦІАЛЬНИХ ІНФОРМАЦІЙНИХ СИСТЕМ ТА РОБОТОТЕХНІЧНИХ КОМПЛЕКСІВ\"",
                        "Кафедра \" Спеціальних інформаційних систем та робототехнічних комплексів\" здійснює теоретичну та практичну підготовку фахівців у галузі знань „Воєнні науки, національна безпека, безпека державного кордону” спеціальність 255 Озброєння та військова техніка, спеціалізація Радіоелектронні інформаційні системи, оперативна техніка та спецозброєння за денною формою навчання.",
                        "Кафедра здійснює підготовку офіцерських кадрів оперативно-технічної діяльності для проходження служби на посадах Головного управління розвідки Міністерства Оборони, Державної прикордонної служби, Служби зовнішньої розвідки та підрозділів Сил спеціальних операцій."
                    ],
                    fullName: "ПАНЧЕНКО Ігор В'ячеславович",
                    position: "Начальник кафедри",
                    achievements: [
                        "кандидат технічних наук",
                        "учасник бойових дій"
                    ],
                    image: {
                        id: 1,
                        contentType: "",
                        imageFilename: ""
                    } as Image,
                    militaryRank: "полковник"
                } as Superior
            ]
        } as TextBlock,
        {
            textContent: [
                "На кафедрі активно ведеться робота по створенню власних безпілотних авіаційних комплексів-ретрансляторів та підготовлено і впроваджено у навчальний процес нову дисципліну “Бойове застосування безпілотних авіаційних комплексів ” Бюджет даної дисципліни передбачає 90 годин для всіх спеціальностей в інституті, яка буде викладатись на протязі 5-го та 6-го семестрів з обов'язковими практичними польотами на БпЛА у польових умовах."
            ]
        } as TextBlock,
        {
            uLists: [
                {
                    title: "Програми підготовки кафедри передбачають вивчення:",
                    items: [
                        "теоретичних та практичних питань основ побудови безпілотних авіаційних комплексів та основних принципів їх використання у якості телекомунікаційної аеро-платформи;",
                        "порядку розробки засобів на базі мікроконтролерів;",
                        "основ інформаційної безпеки;",
                        "спеціального поліграфічного виробництва при виконанні до друкарських, формних та після друкарських процесів, інформаційних системам спеціального призначення і технології для вирішення практичних завдань інформаційної війни та інформаційної протидії;",
                        "методів та засобів контролю каналів витоку інформації."
                    ]
                } as List
            ]
        } as TextBlock,
        {
            images: [
                {
                    id: 1,
                    contentType: "",
                    imageFilename: ""
                } as Image,
                {
                    id: 1,
                    contentType: "",
                    imageFilename: ""
                } as Image,
                {
                    id: 1,
                    contentType: "",
                    imageFilename: ""
                } as Image,
                {
                    id: 1,
                    contentType: "",
                    imageFilename: ""
                } as Image,
                {
                    id: 1,
                    contentType: "",
                    imageFilename: ""
                } as Image,
                {
                    id: 1,
                    contentType: "",
                    imageFilename: ""
                } as Image
            ]
        } as TextBlock,
        {
            superiors: [
                {
                    textContent: [
                        "Кафедра \"ЗАХИСТУ ІНФОРМАЦІЇ ТА КІБЕРЗАХИСТУ\"",
                        "Ведуча кафедра в галузі підготовки фахівців комплексного забезпечення інформаційної безпеки в Інформаційно-телекомунікаційних системах Збройних Сил України. Кафедра охоплює напрямки від математичних аспектів до найсучасніших систем захисту інформації. На кафедрі працюють: докторів технічних наук – 1, кандидатів технічних наук – 5, з них мають наукові звання старший науковий співробітник - 1, доцент - 2."
                    ],
                    fullName: "ЧЕВАРДІН Владислав Євгенійович",
                    position: "Начальник кафедри",
                    achievements: [
                        "доктор технічних наук",
                        "старший науковій співробітник",
                        "учасник бойових дій"
                    ],
                    image: {
                        id: 1,
                        contentType: "",
                        imageFilename: ""
                    } as Image,
                    militaryRank: "полковник"
                } as Superior
            ]
        } as TextBlock,
        {
            uLists: [
                {
                    title: "Кафедра здійснює підготовку слухачів за наступними освітньо-професійними рівнями:",
                    items:[
                        "бакалавр зі спеціальності Кібербезпека - очна та заочна форма навчання;",
                        "магістр – зі спеціальності Кібербезпека - очна форма навчання;",
                        "кандидат технічних наук (Ph.D) зі спеціальності 05.13.21 – Системи захисту інформації."
                    ]
                } as List
            ]
        } as TextBlock,
        {
            images: [
                {
                    id: 1,
                    contentType: "",
                    imageFilename: ""
                } as Image,
                {
                    id: 1,
                    contentType: "",
                    imageFilename: ""
                } as Image,
                {
                    id: 1,
                    contentType: "",
                    imageFilename: ""
                } as Image,
                {
                    id: 1,
                    contentType: "",
                    imageFilename: ""
                } as Image
            ]
        } as TextBlock,
        {
            textContent: [
                "На кафедрі проводиться курсова підготовка офіцерів запасу за напрямком Технічний захисту інформації, Кіберхзахист в інформаційно-телекомунікаційних системах, Робота на виробах криптографічного захисту інформації.",
                "Слухачі отримають знання та навички з трьох напрямків: технічний захист інформації, побудова криптографічних систем захисту інформації, кібернетичний захист."
            ]
        } as TextBlock,
        {
            uLists: [
                {
                    title: "Технічний захист інформації:",
                    items: [
                        "організаційно-правові питання побудови комплексних систем захисту інформації, систем і комплексів технічного захисту інформації;",
                        "практичні навички з проектування, побудови, контролю та оцінки ефективності комплексних систем захисту інформації, систем і комплексів технічного захисту інформації."
                    ]
                } as List,
                {
                    title: "Побудова криптографічних систем захисту інформації:",
                    items: [
                        "теоретичні основи побудови криптографічних систем захисту інформації;",
                        "практичні навички з проектування, розробки та оцінки криптостійкості та обчислювальної" +
                        " складності криптографічних систем захисту інформації;",
                        "теоретичні знання та практичні навички з розгортання, експлуатації та управління виробами криптографічного захисту, комплексами та системами захисту інформації в ІТС ЗСУ."
                    ]
                } as List,
                {
                    title: "Кібернетичний захист:",
                    items: [
                        "організаційно-правові питання побудови систем кібернетичного захисту інформаційно-телекомунікаційних систем;",
                        "математичні аспекти аналізу великих масивів даних;",
                        "основи побудови систем штучного інтелекту;",
                        "проектування та управління системами та комплексами кібернетичного захисту інформаційно-телекомунікаційних систем;",
                        "контроль та оцінка захищеності кібернетичного простору на об’єктах критичної інфраструктури держави."
                    ]
                } as List
            ]
        } as TextBlock,
        {
            textContent: [
                "ОСВІТНЯ ТА НАУКОВА ДІЯЛЬНІСТЬ"
            ]
        } as TextBlock,
        {
            textContent: [
                "Основним завданням Факультету є здійснення освітньої діяльності, яка відповідає стандартом вищої освіти, та забезпечує підготовку згідно з державним замовленням висококваліфікованих військових фахівців.",
                "Освітня діяльність реалізується у вигляді освітнього процесу. Вона включає навчальну, виховну, методичну роботу та наукову, науково-технічну діяльність.",
                "Основним видом освітньої діяльності є навчальна робота. Вона включає в себе заходи керівництва Факультету та його структурних підрозділів, науково-педагогічних та інших працівників з питань: підготовки за фахом курсантів; організації та науково-методичного забезпечення всіх форм (видів) навчальних занять, самостійної роботи, практичної підготовки; удосконалення змісту навчання із врахування сучасних досягнень науки, техніки, технологій, а також досвіду проведення антитерористичної операції на сході країни; проведення діагностики результатів навчання, виховання і розвитку курсантів; їх атестування та управління якістю навчального процесу."
            ]
        } as TextBlock,
        {
            images: [
                {
                    id: 1,
                    contentType: "",
                    imageFilename: ""
                } as Image,
                {
                    id: 1,
                    contentType: "",
                    imageFilename: ""
                } as Image,
            ]
        } as TextBlock,
        {
            uLists: [
                {
                    title: "",
                    items: [
                        "",
                        "",
                        "",
                        "",
                    ]
                } as List
            ]
        } as TextBlock,
        {
            images: [
                {
                    id: 1,
                    contentType: "",
                    imageFilename: ""
                } as Image,
                {
                    id: 1,
                    contentType: "",
                    imageFilename: ""
                } as Image,
                {
                    id: 1,
                    contentType: "",
                    imageFilename: ""
                } as Image,
                {
                    id: 1,
                    contentType: "",
                    imageFilename: ""
                } as Image,
                {
                    id: 1,
                    contentType: "",
                    imageFilename: ""
                } as Image,
                {
                    id: 1,
                    contentType: "",
                    imageFilename: ""
                } as Image,
                {
                    id: 1,
                    contentType: "",
                    imageFilename: ""
                } as Image,
                {
                    id: 1,
                    contentType: "",
                    imageFilename: ""
                } as Image,
                {
                    id: 1,
                    contentType: "",
                    imageFilename: ""
                } as Image,
                {
                    id: 1,
                    contentType: "",
                    imageFilename: ""
                } as Image,
            ]
        } as TextBlock,
        {
            textContent: [
                "КУРСАНТСЬКИЙ ПОБУТ"
            ]
        } as TextBlock,
        {
            images: [
                {
                    id: 1,
                    contentType: "",
                    imageFilename: ""
                } as Image,
                {
                    id: 1,
                    contentType: "",
                    imageFilename: ""
                } as Image,
                {
                    id: 1,
                    contentType: "",
                    imageFilename: ""
                } as Image,
                {
                    id: 1,
                    contentType: "",
                    imageFilename: ""
                } as Image,
                {
                    id: 1,
                    contentType: "",
                    imageFilename: ""
                } as Image,
                {
                    id: 1,
                    contentType: "",
                    imageFilename: ""
                } as Image,
            ]
        } as TextBlock,
        {
            textContent: [
                "ВИХОВНА РОБОТА"
            ]
        } as TextBlock,
        {
            images: [
                {
                    id: 1,
                    contentType: "",
                    imageFilename: ""
                } as Image,
                {
                    id: 1,
                    contentType: "",
                    imageFilename: ""
                } as Image,
                {
                    id: 1,
                    contentType: "",
                    imageFilename: ""
                } as Image,
                {
                    id: 1,
                    contentType: "",
                    imageFilename: ""
                } as Image,
                {
                    id: 1,
                    contentType: "",
                    imageFilename: ""
                } as Image,
                {
                    id: 1,
                    contentType: "",
                    imageFilename: ""
                } as Image,
                {
                    id: 1,
                    contentType: "",
                    imageFilename: ""
                } as Image,
                {
                    id: 1,
                    contentType: "",
                    imageFilename: ""
                } as Image,
            ]
        } as TextBlock
    ]
} as Page