import {List, TextBlock} from "../../../entities/text-block";
import {Superior} from "../../../entities/superior";
import {Image} from "../../../entities/image";
import {Page} from "../../../entities/page";
import {RouterNames} from "../../enums/RouterNames";

export const secondFacultyPage: Page = {
    titleImage: {id: 1} as Image,
    title: "Факультети",
    name: RouterNames.FACULTY_2.name,
    textBlocks: [
        {
            title: "Факультет інформаційних технологій"
        } as TextBlock,
        {
            textContent: [
                "<strong>Факультет Інформаційних технологій</strong> є одним з основних організаційних і навчально-наукових структурних підрозділів Військового інституту телекомунікацій та інформатизації.",
                "Основною метою діяльності Факультету є забезпечення умов, необхідних для здійснення освітньої діяльності, яка відповідає стандартам вищої освіти та забезпечує підготовку, згідно з державним замовленням, висококваліфікованих військових фахівців на рівнях вищої освіти перший (бакалаврський) рівень, другий (магістерський) рівень.",
                "Освітня діяльність на факультеті забезпечує здобуття курсантами (студентами, слухачами) знань, умінь і навичок у гуманітарній, соціальній, науково-природничій, технічній та військовій сферах, необхідних для професійної діяльності, та їх інтелектуального, морального, духовного, естетичного і фізичного розвитку."
            ]
        } as TextBlock,
        {
            superiors: [
                {
                    position: "<strong>Начальник факультету</strong>",
                    fullName: "ОЛЕКСЕНКО Віталій Петрович",
                    achievements: [
                        "учасник бойових дій"
                    ],
                    image: {
                        id: 1
                    },
                    militaryRank: "полковник"
                } as Superior,
                {
                    position: "<strong>Заступник начальника факультету з навчальної та наукової роботи - начальник" +
                        " навчальної частини</strong>",
                    fullName: "ТРОЦЬКО Олександр Олександрович",
                    achievements: [
                        "кандидат технічних наук",
                        "доцент"
                    ],
                    image: {
                        id: 1
                    },
                    militaryRank: "підполковник"
                } as Superior,
                {
                    position: "<strong>Заступник начальника факультету з морально-психологічного забезпечення</strong>",
                    fullName: "ГЕСЬ Євгеній Анатолійович",
                    achievements: [
                        "учасник бойових дій"
                    ],
                    image: {
                        id: 1
                    },
                    militaryRank: "підполковник"
                } as Superior,
            ]
        } as TextBlock,
        {
            textContent: [
                "На Факультеті здійснюється підготовка:"
            ]
        } as TextBlock,
        {
            uLists: [
                {
                    title: "<strong>1. Військових фахівців (курсантів) за очною (денною) формою навчання, за" +
                        " спеціальностями:</strong>",
                    items: [
                        "Комп’ютерні науки;",
                        "Інформаційні системи та технології."
                    ]
                } as List
            ]
        } as TextBlock,
        {
            textContent: [
                "<strong>2. Військовослужбовців контрактної служби в системі заочної форми навчання за рівнем вищої освіти перший (бакалаврський) рівень.</strong>",
                "<strong>3. Підготовка на курсах підвищення кваліфікації офіцерів призваних за мобілізацією (слухачів).</strong>"
            ]
        } as TextBlock,
        {
            uLists: [
                {
                    title: "<strong>Основні замовники на підготовку фахівців:\n</strong>",
                    items: [
                        "Головне управління зв’язку та інформаційних систем ГШ ЗС України;",
                        "Головне управління розвідки;",
                        "Державна прикордонна служба України;",
                        "Міністерство внутрішніх справ;",
                        "Служба безпеки України;",
                        "Служба зовнішньої розвідки."
                    ]
                } as List
            ]
        } as TextBlock,
        {
            textContent: [
                "Структура факультету"
            ]
        } as TextBlock,
        {
            uLists: [
                {
                    title: "Основними структурними підрозділами Факультету є:",
                    items: [
                        "управління Факультету;",
                        "навчальна частина Факультету;",
                        "кафедра автоматизованих систем управління;",
                        "кафедра комп’ютерних інформаційних технологій;",
                        "кафедра технічного та метрологічного забезпечення;",
                        "підрозділи курсантів (студентів, слухачів)."
                    ]
                } as List
            ]

        } as TextBlock,
        {
            superiors: [
                {
                    textContent: [
                        "Кафедра \"АВТОМАТИЗОВАНИХ СИСТЕМ УПРАВЛІННЯ\"",
                        "Наукова та науково-технічна діяльність кафедри спрямована на дослідження та вдосконалення побудови сучасних інформаційно-обчислювальних мереж, розроблення теоретичних і прикладних засад інтелектуального управління потоками даних з урахуванням досвіду проведення антитерористичної операції на сході країни для створення новітніх систем мобільних радіомереж автоматизованого управління військами."
                    ],
                    position: "<strong>Начальник кафедри</strong>",
                    fullName: "<strong>СОВА Олег Ярославович</strong>",
                    achievements: [
                        "доктор технічних наук",
                        "старший науковий співробітник",
                        "учасник бойових дій"
                    ],
                    image: {
                        id: 1
                    },
                    militaryRank: "<strong>полковник</strong>",
                } as Superior,
                {
                    textContent: [
                        "Кафедра \"КОМП’ЮТЕРНИХ ІНФОРМАЦІЙНИХ ТЕХНОЛОГІЙ\"",
                        "Наукова та науково-технічна діяльність кафедри спрямована на дослідження закономірностей побудови інформаційних комунікацій та розроблення теоретичних і прикладних засад побудови і впровадження інтелектуальних інформаційних технологій з урахуванням досвіду проведення антитерористичної операції на сході країни для створення новітніх систем накопичування, переробки, збереження інформації та систем управління військами та зброєю."
                    ],
                    position: "<strong>Начальник кафедри</strong>",
                    fullName: "<strong>БОВДА Едуард Миколайович</strong>",
                    achievements: [
                        "кандидат технічних нау",
                        "доцент"
                    ],
                    image: {
                        id: 1
                    },
                    militaryRank: "<strong>полковник</strong>",
                } as Superior,
                {
                    textContent: [
                        "Кафедра \"ТЕХНІЧНОГО ТА МЕТРОЛОГІЧНОГО ЗАБЕЗПЕЧЕННЯ\"",
                        "Кафедра забезпечує фундаментальну технічну та метрологічну підготовку курсантів (студентів, слухачів). Процес навчання тісно пов’язаний з характером їх майбутньої професійної діяльності. Кафедра здійснює підготовку водіїв транспортних засобів категорій “В”, “С” з числа курсантів Інституту; надання воєнно-наукового супроводу, розробки та випробування телекомунікаційних засобів та АСУ польової компоненти системи військового зв’язку."
                    ],
                    position: "<strong>Начальник кафедри</strong>",
                    fullName: "<strong>Гриценок Константин Миколайович</strong>",
                    image: {
                        id: 1
                    },
                    militaryRank: "<strong>полковник</strong>",
                } as Superior,
            ]
        } as TextBlock,
        {
            textContent: [
                "НАВЧАЛЬНА ТА НАУКОВА ДІЯЛЬНІСТЬ ФАКУЛЬТЕТУ",
                "Головним завданням факультету є і залишається підготовка фахівців у галузі створення програмних і апаратних елементів та комплексів АСУВ, розвиток та удосконалення організації освітнього процесу, формування професійно важливих особистісних якостей та військово-професійної майстерності, з використанням бойового досвіду безпосередньої участі офіцерів, які приймали та приймають участь у проведенні антитерористичної операції на Сході України, подальший розвиток військових інформаційних систем, автоматизованих систем управління військами та розробки ЄАСУ Збройних Сил України, їх практична експлуатація і модернізація."
            ]
        },
        {
            images: [
                {
                    id: 1
                } as Image,
                {
                    id: 1
                } as Image
            ]
        } as TextBlock,
        {
            textContent: [
                "На базі інформаційно–телекомунікаційного вузла кафедри \"Бойового застосуввання математичного та програмного забезпечення АСУ\" розгорнута локально-обчислювальна мережа інституту, яка об'єднує навчальні класи та аудиторії, обладнані сучасними засобами інформатизації навчального процесу. Викладання матеріалу супроводжується електронними презентаціями з використанням сучасних засобів інтерактивного навчання: мультимедійних дошок, оригінальних програмно-технічних комплексів, віртуальних лабораторій, систем дистанційного навчання та інше.",
                "На кафедрі \"Бойового застосування автоматизованих систем управління військами\" розгорнуто спеціалізований клас по вивченню обладнання фірми Cisco, в якому курсанти набувають навичок практичної роботи з сучасним обладнанням комп’ютерних мереж та вдосконалюють свої теоретичні знання з дисциплін кафедри.",
                "На кафедрі «Технічного та метрологічного забезпечення» отриманно ліцензії на підготовку водіїв категорії «В», «С»."
            ]
        } as TextBlock,
        {
            uLists: [
                {
                    title: "Загальна кількість ліцензійного обсягу:",
                    items: [
                        "категорія «С» - 200 чоловік;",
                        "категорія «В» - 130 чоловік."
                    ]
                } as List
            ]
        } as TextBlock,
        {
            images: [
                {
                    id: 1
                } as Image,
                {
                    id: 1
                } as Image
            ]
        } as TextBlock,
        {
            textContent: [
                "Під час аудиторних занять та у години самостійної роботи, а також під час відпрацювання питань військово-наукової роботи, курсанти мають оперативний доступ до ресурсів та сервісів глобальної інформаційної мережі Інтернет. Створено сучасне середовище для підготовки військових фахівців з виконання завдань інформаційної боротьби в комп'ютеризованих системах, зокрема, забезпечення безпеки комп'ютеризованих систем, а також планування та нав'язування руйнівного кібернетичного впливу на комп'ютеризовані системи противника."
            ]
        } as TextBlock,
        {
            images: [
                {
                    id: 1
                } as Image,
                {
                    id: 1
                } as Image
            ]
        } as TextBlock,
        {
            imageTextRows: [
                {
                    image: {
                        id: 1
                    },
                    text: "Курсанти та студенти, що навчаються за напрямком підготовки на факультеті є лауреатами та призерами Всеукраїнських та інститутських конкурсів студентських робіт.",
                    imgLeft: false
                }
            ]
        } as TextBlock,
        {
            textContent: [
                "Науково-педагогічній потенціал факультету складається з провідних вчених та висококваліфікованих фахівців."
            ]
        } as TextBlock,
        {
            uLists: [
                {
                    title: "На даний час освітню діяльність здійснюють 34 науково-педагогічних працівника, з них:",
                    items: [
                        "докторів наук – 3;",
                        "кандидатів наук – 13;",
                        "професорів – 2;",
                        "доцентів – 11;",
                        "старший науковий співробітник – 1."
                    ]
                } as List
            ]
        } as TextBlock,
        {
            textContent: [
                "Наукові інтереси викладачів факультету включають питання створення систем підтримки прийняття рішень з елементами штучного інтелекту; дослідження мережевих технологій з точки зору інформаційної безпеки; створення інтелектуальних систем навчання та розробка технологій дистанційного навчання; моделювання складних систем та автоматизація процесів управління ними; забезпечення безпеки інформації у комп'ютеризованих системах; розробки методології та способів нав'язування руйнівного кібернетичного впливу у кіберпросторі; дослідження питань підвищення ефективності функціонування інформаційно-пошукових систем; розробку інформаційно-розрахункових та аналітичних систем; підвищення ефективності технічного обслуговування і ремонту військової техніки зв'язку і автоматизації; зменшення працезатрат на технічне обслуговування і ремонт військової техніки зв'язку і автоматизації; підвищення якості зберігання засобів зв'язку і автоматизації Збройних Сил України; автоматизація процесів управління технічним забезпеченням зв'язку і АСУВ на всіх рівнях підпорядкування; оптимізація номенклатури засобів вимірювальної техніки з урахуванням їх морального стану, фізичного старіння та можливостей поставок для забезпечення."
            ]
        } as TextBlock,
        {
            images: [
                {
                    id: 1
                } as Image,
                {
                    id: 1
                } as Image
            ]
        } as TextBlock,
        {
            textContent: [
                "На кафедрах ефективно діють гуртки військово-наукових товариств курсантів та студентів."
            ]
        } as TextBlock,
        {
            images: [
                {
                    id: 1
                } as Image,
                {
                    id: 1
                } as Image
            ]
        } as TextBlock,
        {
            textContent: [
                "Науково-педагогічні працівники кафедр проводять додаткові заняття і консультації з курсантами та студентами."
            ]
        } as TextBlock,
        {
            images: [
                {
                    id: 1
                } as Image,
                {
                    id: 1
                } as Image,
                {
                    id: 1
                } as Image,
                {
                    id: 1
                } as Image
            ]
        } as TextBlock,
        {
            textContent: [
                "ПРОВЕДЕННЯ ТАКТИКО-СПЕЦІАЛЬНИХ ЗАНЯТЬ"
            ]
        } as TextBlock,
        {
            images: [
                {
                    id: 1
                } as Image,
                {
                    id: 1
                } as Image
            ]
        } as TextBlock,
    ]
}