import {Page} from "../../../../entities/page";
import {RouterNames} from "../../../enums/RouterNames";
import {Image} from "../../../../entities/image";
import {List, TextBlock} from "../../../../entities/text-block";
import {ImageTextRow} from "../../../../entities/text-block/model/types";

export const whyMITITPage: Page = {
    name: RouterNames.WHY_MITIT.name,
    title: "Чому ВІТІ?",
    titleImage: {id: 16243} as Image,
    textBlocks: [
        {
            title: "Чому ВІТІ?"
        } as TextBlock,
        {
            imageTextRows: [
                {
                    image:{
                        id: 16270,
                        contentType: "",
                        imageFilename: ""
                    },
                    text: "<h2>1.ВІТІ – потужний навчальний заклад у складі 3-х факультетів та 15 кафедр," +
                        " Наукового центру зв'язку та інформатизації та Військового коледжу сержантського" +
                        " складу.</h2><p><strong>Ти отримаєш диплом бакалавра, магістра в галузі ІТ-технологій та телекомунікацій!</strong></p>",
                    imgLeft: true
                } as ImageTextRow
            ]
        } as TextBlock,
        {
            textContent: [
                "<h2>2. ВІТІ – міжвидовий військовий навчальний заклад,</h2> який розташований в історичному центрі" +
                " Києва на Печерських пагорбах та має славетні традиції та своїх видатних вихованців. Багато випускників інституту стали провідними військовими фахівцями та генералами.",
                "Інститут готує офіцерів для Збройних Сил України (Сухопутні війська, Військово-Повітряні та Військово-Морські Сили, Сили спеціальних операцій, Десантно-штурмових військ, Головного управлінння розвідки), Служби безпеки України, Служби зовнішьої розвідки України, Національної гвардії України, Державної прикордонної служби України, Державного космічного агентства України, Державної спеціальної служби транспорту.",
                "Ми навчимо тебе бути професіоналом військової справи, бути сильним, вольовим та хоробрим. У нас ти знайдеш справжніх товаришів.",
                "<strong>Ти станеш командиром! Ти можеш стати генералом!</strong>"
            ]
        } as TextBlock,
        {
            images: [
                {
                    id: 16271,
                    contentType: "",
                    imageFilename: ""
                } as Image,
                {
                    id: 16272,
                    contentType: "",
                    imageFilename: ""
                } as Image
            ]
        } as TextBlock,
        {
            textContent: [
                "<h2>3. ВІТІ – надає професійну освіту за ступенями вищої освіти магістра</h2> за такими сучасними" +
                " спеціальностями як: комп’ютерні науки та інформаційні технології, комп’ютерна інженерія, телекомунікації та радіотехніка, кібербезпека, озброєння та військова техніка.",
                "<strong>Ти станеш професіоналом в галузі ІТ-технологій та телекомунікацій!</strong>"
            ]
        } as TextBlock,
        {
            images: [
                {
                    id: 16273,
                    contentType: "",
                    imageFilename: ""
                } as Image,
                {
                    id: 16275,
                    contentType: "",
                    imageFilename: ""
                } as Image,
            ]
        } as TextBlock,
        {
            textContent: [
                "<h2>4. ВІТІ – це база підготовки майбутніх кібервоінів</h2>. Протягом всього терміну навчання ти будеш" +
                " вивчати сучасні системи захисту інформації, апаратно-програмні засоби CISCO, волоконно-оптичні технології побудови мереж передачі повідомлень.",
                "<strong>Ти зможеш професійно захищати Україну в кіберпросторі!</strong>"
            ]
        } as TextBlock,
        {
            images: [
                {
                    id: 16276,
                    contentType: "",
                    imageFilename: ""
                } as Image,
                {
                    id: 16277,
                    contentType: "",
                    imageFilename: ""
                } as Image,
            ]
        } as TextBlock,
        {
            textContent: [
                "<h2>5. ВІТІ – це сучасний рівень викладання</h2> з використанням інноваційних технологій та сучасних" +
                " програмних продуктів на базі різноманітних навчальних класів (комп’ютерні класи, спеціалізовані лабораторії, навчально-тренувальний комплекс тощо) з залученням значного наукового потенціалу (15 докторів наук, 12 професорів, 61кандидата наук, 48 доцентів, 2 Заслужених діяча науки та техніки, 1 Заслужений працівник освіти, 1 Лауреат Державної премії України, 1 – академік галузевої академії). Постійний доступ до інститутської локальної мережі а також до мережі Internet дає можливість курсантам опановувати знання на сучасному рівні",
                "<strong>Навчатись дуже цікаво та перспективно.</strong>"
            ]
        } as TextBlock,
        {
            images: [
                {
                    id: 16278,
                    contentType: "",
                    imageFilename: ""
                } as Image,
                {
                    id: 16279,
                    contentType: "",
                    imageFilename: ""
                } as Image,
            ]
        } as TextBlock,
        {
            textContent: [
                "<h2>6. ВІТІ – це можливість підвищити рівень володіння англійською мовою</h2>.В інституті створений" +
                " сучасний лінгафонний клас для поглибленого вивчення англійської мови загального, технічного та військового спрямування.",
                "Курсанти інституту залучаються як перекладачі при проведенні міжнародних навчань, зустрічей з військовослужбовцями країн-членів НАТО.",
                "Випускники інституту беруть участь в міжнародних навчаннях, миротворчих місіях, навчаються у військових коледжах та академіях збройних сил іноземних держав.",
                "При закінченні ти можеш отримати свідоцтво про особистий рівень володіння іноземною мовою стандарту НАТО.",
                "<strong>Ти можеш навчитись та вільно спілкуватися іноземною мовою!</strong>"
            ]
        } as TextBlock,
        {
            images: [
                {
                    id: 16280,
                    contentType: "",
                    imageFilename: ""
                } as Image,
                {
                    id: 16281,
                    contentType: "",
                    imageFilename: ""
                } as Image,
            ]
        } as TextBlock,
        {
            textContent: [
                "<h2>7. ВІТІ – розвиває сучасні наукові школи в галузях інформаційних технологій, електроніки та" +
                " телекомунікації</h2>. В інституті функціонує ад’юнктура та докторантура з підготовки наукових кадрів" +
                " вищої кваліфікації та спеціалізована вчена рада щодо захисту кандидатських (докторських) дисертацій з визначеними науковими спеціальностями.",
                "<strong>Після закінчення інституту ти можеш навчатись в ад’юнктурі, докторантурі та отримати наукові ступені доктора філософії та доктора наук.</strong>"
            ]
        } as TextBlock,
        {
            images: [
                {
                    id: 16282,
                    contentType: "",
                    imageFilename: ""
                } as Image,
                {
                    id: 16283,
                    contentType: "",
                    imageFilename: ""
                } as Image,
            ]
        } as TextBlock,
        {
            textContent: [
                "<h2>8. ВІТІ – надає прекрасні умови для заняття спортом.Під керівництвом досвідчених" +
                " офіцерів-фахівців" +
                " курсанти покращують особистий рівень фізичної підготовки з бігу та силових вправ. Відпрацьовуються" +
                " також й воєнно-спортивні види спорту – перетин полоси перешкод, вправи на витривалість з" +
                " озброєнням.</h2>",
                "Кожного року наш інститут представляє команду з військово-спортивного багатоборства, де курсанти показують свої уміння з плавання, бігу та стрільбі з пістолету.",
                "Щорічно відбуваються спартакіади київських ВНЗ з різних видів спорту: плавання, легкої атлетики, баскетболу, шахів, волейболу, футболу, настільному тенісу, армспорту та інше.",
                "<strong>Ти будеш добре фізично розвиненим!</strong>"
            ]
        } as TextBlock,
        {
            images: [
                {
                    id: 16284,
                    contentType: "",
                    imageFilename: ""
                } as Image,
                {
                    id: 16285,
                    contentType: "",
                    imageFilename: ""
                } as Image,
            ]
        } as TextBlock,
        {
            textContent: [
                "<h2>9. ВІТІ – створює умови повноцінного, змістовного проведення вільного часу. Військовий колектив" +
                " виховує талановитих творчих особистостей, яскраві творчі колективи.</h2>",
                "Курсанти інституту постійно беруть участь та займають призові місця у Всеукраїнських конкурсах, олімпіадах, творчих виступах, в міжвишівські КВК.",
                "Під час звільнення та у вихідні дні є можливість знайомства зі столицею, відвідування історичних" +
                " місць Києва, похід у театри.",
                "<strong>Ти маєш можливість розвинутись як особистість.</strong>"
            ]
        } as TextBlock,
        {
            images: [
                {
                    id: 16286,
                    contentType: "",
                    imageFilename: ""
                } as Image,
                {
                    id: 16287,
                    contentType: "",
                    imageFilename: ""
                } as Image,
            ]
        } as TextBlock,
        {
            textContent: [
                "<h2>10. ВІТІ – заохочує іменними стипендіями</h2>. Крім постійного щомісячного грошового забезпечення," +
                " кращі курсанти за результатами навчання та участі в суспільній діяльності інституту заохочуються іменними стипендіями: Президента України, Верховної Ради України, Кабінету Міністрів України, та іншими",
                "<strong>Ти можеш отримувати додаткову стипендію!</strong>"
            ]
        } as TextBlock,
        {
            textContent: [
                "<h2>11. Випусники ВІТІ отримують посвідчення водія категорій “В”, “С”</h2> Під час основного терміну" +
                " навчання ти зможеш вивчити складові автомобіля та опанувати його водіння.",
                "<storng>Ти можеш стати класним водієм!</storng>"
            ]
        } as TextBlock,
        {
            images: [
                {
                    id: 16288,
                    contentType: "",
                    imageFilename: ""
                } as Image,
                {
                    id: 16289,
                    contentType: "",
                    imageFilename: ""
                } as Image,
            ]
        } as TextBlock,
        {
            uLists: [
                {
                    title: "<h2>12. ВІТІ – це гарант соціального захисту:</h2>",
                    items: [
                        "Ти навчаєшся тільки на бюджетній формі навчання (за кошти держави);",
                        "Ти отримуєш щомісячне грошове забезпечення протягом всього терміну навчання, за навчання на «добре» та «відмінно» - підвищене;",
                        "Тебе повністю забезпечують одягом, харчуванням, місцем для проживання;",
                        "Весь термін твого навчання зараховується до загальної вислуги років."
                    ]
                } as List
            ]
        } as TextBlock,
        {
            images: [
                {
                    id: 16290,
                    contentType: "",
                    imageFilename: ""
                } as Image,
                {
                    id: 16291,
                    contentType: "",
                    imageFilename: ""
                } as Image,
            ]
        } as TextBlock,
        {
            textContent: [
                "<h2>ТИ І ТВОЯ РОДИНА БУДЕТЕ СОЦІАЛЬНО ЗАХИЩЕНІ!</h2>"
            ]
        } as TextBlock,
    ]
}