import {Page} from "../../entities/page";
import {RouterNames} from "./RouterNames";
import {Image} from "../../entities/image";
import {List} from "../../entities/text-block";

export const contactsPage: Page = {
    name: RouterNames.CONTACTS.name,
    title: "контакти",
    titleImage: {id: 1} as Image,
    textBlocks: [
        {
            title: "Гаряча лінія"
        },
        {
            textContent: [
                "<br>Телефон/факс (черговий Військового інституту):</br> (044) 290-41-48, в мережі ЗСУ:442-00"
            ]
        },
        {
            uLists: [
                {
                    items: [
                        "Заступник начальника: (044) 256-23-08\n",
                        "Заступник начальника інституту з навчальної роботи: (044) 290-41-64\n",
                        "Заступник начальника інституту з наукової роботи: (044) 290-40-30\n",
                        "Начальник факультету телекомунікаційних систем: (044) 256-22-21\n",
                        "Начальник факультету інформаційних технологій: (044) 256-22-35\n",
                        "Начальник факультету бойового застосування систем управління та зв'язку: (044) 256-23-37\n",
                        "Начальник кафедри військової підготовки: (044) 290-40-33\n",
                        "Начальник навчального відділу: (044) 290-40-37\n",
                        "Начальник відділу особового складу та стройового: (044) 290-40-17"
                    ]
                } as List
            ]
        }
    ]
}