import {Page} from "../../entities/page";
import {RouterNames} from "./RouterNames";
import {Image} from "../../entities/image";
import {List, TextBlock} from "../../entities/text-block";
import {AccordionElement} from "../../entities/entrance";

export const educationsPage: Page = {
    name: RouterNames.STUDY.name,
    title: "Навчання",
    titleImage: {id: 1} as Image,
    textBlocks: [
        {
            title: "Навчання"
        } as TextBlock
    ],
    accordionElements: [{
        title: "Організація освітньої діяльності",
        textBlocks: [
            {
                textContent: [
                    "<strong>Освітня діяльність у Військовому інституті телекомунікацій та інформатизації імені" +
                    " Героїв" +
                    " Крут</strong>" +
                    " (далі – ВІТІ) реалізується як освітній процес, що включає навчальну, виховну, методичну роботу та \n" +
                    "наукову і науково-технічну діяльність, відповідно до ліцензії на здійснення освітньої діяльності закладів освіти (вища освіта) наказ Міносвіти від 11.05.1995 №126 (вперше), наказ МОН від 25.02.2016 №309л \n" +
                    "(переоформлення), та передбачає видання випускникам ВІТІ документів про вищу освіту державного зразка відповідно до сертифікатів про акредитацію за відповідними спеціальностями \n" +
                    "(освітньо-професійними програмами).",
                    "<strong>Підготовка військових фахівців у ВІТІ здійснюється</strong> за очною (денною) та заочною формами" +
                    " навчання шляхом реалізації стандартів вищої освіти.",
                    "<strong>Освітній процес у ВІТІ спрямований</strong> на на реалізацію стандартів освітньої діяльності та вищої освіти як сукупності вимог до змісту та результатів освітньої діяльності ВІТІ за освітніми ступенями \n" +
                    "“бакалавр” та “магістр” в межах кожної спеціальності, за якою здійснюється підготовка" +
                    " військових фахівців у ВІТІ."
                ],
                oLists: [
                    {
                        title: "<strong>Нормативно-правові документи, які регламентують порядок здійснення освітньої діяльності У ВІТІ:</strong>",
                        items: [
                            "Закон України від 05.09.2017 № 2145-VIII \"Про освіту\";",
                            "Закон України від 01.07.2014 № 1556-VII\"Про вищу освіту;",
                            "Постанова Кабінету Міністрів України від 30 грудня 2015 р. № 1187 \"Про затвердження Ліцензійних умов провадження освітньої діяльності\";",
                            "Наказ Міністерства освіти і науки України від 11.07.2019 року № 977 “Про затвердження Положення про акредитацію освітніх програм, за якими здійснюється підготовка \n" +
                            "здобувачів вищої освіти”;",
                            "Постанова Кабінету Міністрів України від 17.08.2002 № 1134 \"Про затвердження нормативів чисельності студентів (курсантів), аспірантів (ад'юнктів), докторантів, здобувачів \n" +
                            "наукового ступеня кандидата наук, слухачів, інтернів, клінічних ординаторів на одну штатну посаду науково-педагогічного працівника у вищих навчальних закладах III і IV рівня \n" +
                            "акредитації та вищих навчальних закладах післядипломної освіти державної форми власності\";",
                            "Наказ Міністерства оборони України від 09.01.2020 № 4 \"Про затвердження Положення про особливості організації освітньої діяльності у вищих військових навчальних \n" +
                            "закладах Міністерства оборони України та військових навчальних підрозділах закладів вищої освіти\";",
                            "Наказ Міністерства оборони України від 27.05.2015 № 240 \"Про затвердження Положення про вищі військові навчальні заклади\";",
                            "Наказ Міністерства оборони України, Міністерства освіти і науки України від 19.10.2016 № 542/1255 \"Про затвердження Інструкції про порядок заміщення на конкурсній основі \n" +
                            "вакантних посад науково- педагогічних працівників у вищих військових навчальних закладах, військових навчальних підрозділах вищих навчальних закладів, що належать до \n" +
                            "сфери управління Міністерства оборони України\";",
                            "Наказ Міністерства Оборони України № 412 від 12.11.2020 «Про організацію підготовки офіцерських кадрів тактичного рівня та сержантського (старшинського) складу у закладах \n" +
                            "фахової передвищої військової освіти, вищих військових навчальних закладах Міністерства оборони України та військових навчальних підрозділах закладів вищої освіти»;",
                            "Наказ Міністерства оборони України від 05.06.2014 № 360 \"Про затвердження Інструкції про організацію та проведення військово-професійної орієнтації молоді та прийому до \n" +
                            "вищих військових навчальних закладів та військових навчальних підрозділів закладів вищої освіти\";",
                            "Наказ Міністерства оборони України від 12.01.2016 № 5 \"Про затвердження Інструкції про порядок організації і проведення військового (флотського) стажування, навчальної, \n" +
                            "виробничої, ремонтної, корабельної та інших видів практики курсантів (слухачів, студентів) вищих військових навчальних закладів, військових навчальних підрозділів \n" +
                            "вищих навчальних закладів\";",
                            "Лист Міністерства освіти і науки України від 15.08.2018 № 1/11-8681 \" Рекомендації щодо запобігання академічному плагіату та його виявлення в наукових роботах \n" +
                            "(авторефератах, дисертаціях, монографіях, наукових доповідях, статтях тощо)\";",
                            "Наказ Міністерства оборони України, Міністерства освіти і науки України від 08.05.2002 № 155/291 \"Про затвердження Інструкції з планування та обліку діяльності \n" +
                            "науково-педагогічних (педагогічних) працівників вищих військових навчальних закладів (військових навчальних підрозділів вищих навчальних закладів, \n" +
                            "навчальних центрів Збройних Сил України);",
                            "Наказ Міністерства оборони України, Міністерства освіти і науки України від 11.02.2016 №71/109 \"Про затвердження Положення про проведення атестації науково-педагогічних \n" +
                            "працівників вищих військових навчальних закладів, військових навчальних підрозділів вищих навчальних закладів, що належать до сфери управління Міністерства оборони України\";",
                            "Наказ Міністерства оборони України, Міністерства освіти і науки України від 14.12.2015 № 719/1289 \"Про затвердження Інструкції про організацію військової підготовки \n" +
                            "громадян України за програмою підготовки офіцерів запасу\";",
                            "Наказ Міністерства оборони України від 09.09.2015 № 472 \"Про затвердження Положення про екзаменаційні комісії вищих військових навчальних закладів та військових \n" +
                            "навчальних підрозділів вищих навчальних закладів\".",
                        ]
                    } as List
                ]
            } as TextBlock
        ]

    } as AccordionElement,
        {
            title: "Документи освітнього процесу",
            textBlocks: [
                {
                    oLists: [
                        {
                            title: "<strong>Статут та інші установчі документи</strong>",
                            items: [
                                "Статут Військового інституту телекомунікацій та інфоматизації імені Героїв Крут(нова редакція, Наказ МОУ від 16.10.2019 № 535)",
                                "Статут Військового інституту телекомунікацій та інфоматизації (Наказ МОУ від 20.10.2015 № 572)",
                                "Стратегія і перспективні напрями розвитку освітньої, наукової та інноваційної діяльності Військового інституту телекомункаіцій та інформатизації імені Героїв Крут на період до 2025 року",
                                "Стратегія і перспективні напрями розвитку освітньої, наукової та інноваційної діяльності Військового інституту телекомункаіцій та інформатизації на період до 2020 року",
                                "Ліцензія на провадження освітньої діяльності",
                                "Відомості щодо здійснення освітньої діяльності у сфері вищої освіти",
                                "Відомості щодо права здійснення освітньої діяльності у сфері фахової передвищої освіти",
                                "Сертифікати про акредитацію освітніх програм",
                                "Державний контракт на підготовку військових фахівців, наукових, науково-педагогічних кадрів, на підвищення кваліфікації та перепідготовку кадрів 2020 2019 2018 2017",
                                "Положення про Вчену раду Військового інституту телекомунікацій та інформатизації імені Героїв Крут",
                                "Положення «Про дорадчий орган курсантської ініціативи ВІТІ імені Героїв Крут»  Наказ про введення в дію\n",
                                "Положення про воєнно-наукове товаритство курсантів ВІТІ\n",
                                "Положення «Про запобігання та врегулювання конфлікту інтересів Військового інституту" +
                                " телекомунікацій та інформатизації імені Героїв Крут»  Наказ про введення в дію</p>" +
                                "<p>Методичні рекомендації щодо запобігання та врегулювання конфлікту інтересів</p>" +
                                "<p>Роз'яснення положень антикорупційного законодавства щодо обмеження спільної роботи близьких осіб</p>" +
                                "<p>Антикорупційна програма Міністерства оборони України на 2018 - 2020 роки</p>" +
                                "<p>Організаційно-методичні вказівки з питань реалізації державної антикорупційної політики в діяльності Міністерства оборони України та Збройних Сил України в 2020 році</p>" +
                                "<p>Матеріали для інформування військовослужбовців та працівників Збройних Сил України в рамках міжнародного дня боротьби з корупцією</p>",
                                "Положенням «Про комісію з питань етики та професійної діяльності у Військовому інституті телекомунікації та інформатизації імені Героїв Крут»  Наказ про введення в дію\n",
                                "Положенням «Про забезпечення академічної доброчесності у Військовому інституті телекомунікації та інформатизації імені Героїв Крут»  Наказ про введення в дію\n" +
                                "<p>Кодекс академічної доброчесності</p>" +
                                "<p>Кодекс доброчесної поведінки та професійної етики військових посадових осіб, державних службовців та інших осіб, уповноважених на виконання функцій держави, \n" +
                                "в Міністерстві оборони України та Збройних Силах України</p>" +
                                "<p>Декларація про дотримання академічної доброчесності у Військовому інституті телекомунікації та інформатизації імені Героїв Крут</p>",
                            ]
                        } as List,
                        {
                            title: "<strong>Документи закладу вищої освіти, якими регулюється порядок здійснення освітнього процесу</strong>",
                            items: [
                                "Положення про організацію освітнього процесу у Військовому інституті телекомунікацій та інформатизації\n",
                                "Положення «Про порядок організації академічної мобільності здобувачів вищої освіти у Військовому інституті телекомунікації та інформатизації імені Героїв Крут»\n",
                                "Положення «Про визнання та перезарахування результатів навчання учасників академічної мобільності»\n",
                                "Положення «Про реалізацію права на вільний вибір навчальних дисциплін здобувачами вищої освіти Військового інституту телекомунікації та інформатизації імені Героїв Крут»  \n" +
                                "Наказ про введення в дію\n",
                                "Положення «Про індивідуальні плани здобувачів вищої освіти Військового інституту телекомунікації та інформатизації імені Героїв Крут»  Наказ про введення в дію\n",
                                "Положенням «Про переведення, відрахування та поновлення курсантів Військового інституту телекомунікацій та інформатизації імені Героїв Крут  Наказ про введення в дію\n",
                                "Положення «Про систему внутрішнього забезпеченн якості освітньої діяльності та якості вищої освіти ВІТІ»\n",
                                "Положення «Про екзаменаційні комісії вищих військових навчальних закладів та навчальних підрозділів вищих навчальних закладів»\n",
                                "Положення «Про контроль та оцінювання навчальних досягнень здобувачів вищої освіти у Військовому інституті телекомунікації та інформатизації імені Героїв Крут»\n",
                                "Положенням «Про порядок визнання у Військовому інституті телекомунікації та інформатизації імені Героїв Крут результатів навчання, здобутих у неформальній та інформальній освіті»\n",
                                "Положення про дистанційне навчання у Військовому інституті телекомунікацій та інформатизації імені Героїв Крут»\n",
                                "Положення «Про підвищення кваліфікації педагогічних та науково-педагогічних працівників у Військовому інституті телекомунікації та інформатизації імені Героїв Крут»\n" +
                                "<p>Методичні рекомендації для професійного розвитку науково-педагогічних праціників</p>" +
                                "<p>Порядок підвищення кваліфікації педагогічних і науково-педагогічних працівників</p>",
                                "Положення «Про вимоги Вченої ради ВІТІ до здобувачів вчених звань професора, доцента і старшого дослідника та порядку розгляду їх атестаційних матеріалів»\n",
                                "Положення «Про контроль освітнього процесу, вивчення стану справ на факультетах і кафедрах ВІТІ імені Героїв Крут",
                            ]
                        } as List
                    ]
                } as TextBlock
            ]

        } as AccordionElement,
        {
            title: "Ліцензія, сертифікати, акредитація",
            textBlocks: [
                {
                    textContent: [
                        "Ліцензія ВІТІ\n",
                        "Відомості щодо здійснення освітньої діяльності у сфері вищої освіти\n",
                        "Відомості щодо права здійснення освітньої діяльності у сфері фахової передвищої освіти"
                    ],
                } as TextBlock,
                {
                    textContent: [
                        "<strong>Сертифікати про акредитацію:</strong>",
                        "12 Інформаційні технології 122 Комп’ютерні науки (бакалавр)",
                        "12 Інформаційні технології 123 Комп’ютерна інженерія (бакалавр)",
                        "12 Інформаційні технології 125 Кібербезпека (бакалавр)",
                        "17 Електроніка та телекомунікації 172 Телекомунікації та радіотехніка (бакалавр)",
                        "25 Воєнні науки, національна безпека, безпека державного кордону 253 Військове управління (за видами збройних сил) (бакалавр)",
                        "25 Воєнні науки, національна безпека, безпека державного кордону 254 Забезпечення військ (сил) (бакалавр)",
                        "25 Воєнні науки, національна безпека, безпека державного кордону 255 Озброєння та військова техніка",
                        "12 Інформаційні технології 122 Комп’ютерні науки (магістр)",
                        "Освітньо-професійна програма Кібербезпека за спеціальністю 125 Кібербезпека (другий (магістерських) рівень вищої освіти)",
                        "Освітньо-професійна програма Інформаційні системи та технології за спеціальністю 126 Інформаційні системи та технології (другий (магістерських) рівень вищої освіти)",
                        "17 Електроніка та телекомунікації 172 Телекомунікації та радіотехніка (магістр)",
                        "Освітньо-професійна програма Озброєння та військова техніка за спеціальністю 255 Озброєння та військова техніка (другий (магістерських) рівень вищої освіти)",
                        "12 Інформаційні технології 122 Комп’ютерні науки (молодший спеціаліст)",
                        "17 Електроніка та телекомунікації 172 Телекомунікації та радіотехніка (молодший спеціаліст)"
                    ],
                } as TextBlock,
                {
                    textContent: [
                        "<strong>Акредитація 2020 (ВКСС ВІТІ):</strong>",
                        "Експертний висновок експертної комісії Міністрерства освіти і науки України за результами акредитаційної експертизи освтітньо-професійної програми \"Комп'ютерні науки\" \n" +
                        "зі спеціальності 122 Комп'ютерні науки галузі знань 12 Інформаційні технології рівня вищої освіти молодший спеціаліст у Військовому коледжі сержантського складу Військового \n" +
                        "інституту телекомунікацій та інформатизаціх імені Героїв Крут\n",
                        "Експертний висновок експертної комісії Міністрерства освіти і науки України за результами проведення первинної акредитатійної експертизи підготовки молодших спеціалістів \n" +
                        "за освтітньо-професійною програмою \"Телекомунікації та радіотехніка\" зі спеціальності 172 Телекомунікації та радіотехніка у Військовому коледжі сержантського складу Військового \n" +
                        "інституту телекомунікацій та інформатизаціх імені Героїв Крут",
                    ],
                } as TextBlock,
                {
                    textContent: [
                        "<strong>Акредитація 2018:</strong>",
                        "Експертний висновок експертної комісії Міністерства освіти і науки України за результатами чергової акредитаціної експертизи освітньо-кваліфікаційного рівня бакалавр з напряму \n" +
                        "підготовки 6.160101 Військове управління у Військовому інституті телекомунікацій та інформатизації\n",
                        "Висновок експертної комісії Міністерства освіти і науки України з проведення акредитаційної експертизи освітньо-професійної програми \"Кібербезпека\" галузі знань 12 \"Інформаційні технології\" \n" +
                        "за другим (магістерським) рівнем вищої освіти у Військовому інституті телекомунікацій та інформатизації\n",
                        "Експертний висновок експертної комісії Міністерства освіти і науки України за результатами акредитаційної експертизи освітньо-професійної програми \"Інформаційні системи та технології\" \n" +
                        "зі спеціальності 126 Інформаційні системи та технології за другим (магістерським) рівнем вищої освіти у Військовому інституті телекомунікацій та інформатизації\n",
                        "Експертний висновок експертної комісії Міністерства освіти і науки України за результатами первинної акредитаційної експертизи освітньо-професійної програми \"Озброєння та військова техніка\" \n" +
                        "зі спеціальності 255 Озброєння та військова техніка за другим (магістерським) рівнем вищої освіти у Військовому інституті телекомунікацій та інформатизації",
                    ],
                } as TextBlock,
                {
                    textContent: [
                        "<strong>Акредитація 2016:</strong>",
                        "Експертні висновоки про результати проведення чергової акредитаційної експертизи підготовки бакалаврів і спеціалістів з напряму підготовки 6.170101 \"Безпека інформаційних і \n" +
                        "комунікаційних систем\" спеціальності 7.17010181 \"Безпека інформації у спеціальних інформаційних системах\" у Військовому інституті телекомунікацій та інформатизації\n",
                        "Експертні висновоки проведення чергової акредитаційної експертизи підготовки фахівців освітньо-кваліфікаційних рівнів \"бакалаврів\", \"спеціаліст\", \"магістр\" за напрямом підговтовки 6.050903 \n" +
                        "Телекомунікації зі спеціальності 7.05090381, 8.05090381 Системи та комплекси військового зв'язку у Військовому інституті телекомунікацій та інформатизації\n",
                        "Експертні висновки за результатами акредитаційної експертизи підготовки бакалаврів, спеціалістів, магістрів з напряму підготовки, 6.050101 \"Комп'ютерні науки\", спеціальностей 7.05010181, 8.05010181 \n" +
                        "\"Інформаційні управляючі системи та технології спеціального призначаення\" у Військовому інституті телекомунікацій та інформатизації\n",
                        "Експертні висновки за результатами акредаційної експертизи підготовки фахівців освітньо-кваліфікаційного рівня \"бакалавр\" та \"спеціаліст\" з напряму підготовки 6.050201 \"Системна інженерія\" \n" +
                        "за спеціальністю 7.05020181 - \"Комплекси, системи та засоби автоматизації управління військами і озброєнням\" у Військовий інститут телекомунікацій та інформатизації\n",
                        "Експертні висновки за результатами акредитаційної експеритизи підготовки фахівців освітньо-кваліфікаційних рівнів \"бакалавр\" і \"спеціаліст\" з напряму підготовки 6.170102 \"Системи технічного \n" +
                        "захисту інформації\", спеціальності 7.17010281 \"Організація захисту інформації з обмежиним доступом та автоматизація її обробки\" у Військовому інституті телекомунікацій та інформатизації",
                    ],
                } as TextBlock
            ]

        } as AccordionElement,
        {
            title: "Освітні програми",
            textBlocks: [
                {
                    textContent: [
                        "<strong>Стандарти. Перший (бакалаврський) рівень вищої освіти</strong>",
                        "122 Комп’ютерні науки (Наказ МОН України від 10.07.2019 р. № 962)\n",
                        " 125 Кібербезпека (Наказ МОН України від 04.10.2018 р. № 1074)\n",
                        " 126 Інформаційні системи та технології (Наказ МОН України від 12.12.2018 р. № 1380)\n",
                        " 172 Телекомунікації та радіотехніка (Наказ МОН України від 12.12.2018 р. № 1382)\n",
                        " 253 Військове управління (за видами збройних сил) (Наказ МОН України від 29.10.2018 р. № 1168)\n",
                        " 255 Озброєння та військова техніка (Наказ МОН України від 05.12.2018 р. № 1341)",
                    ]
                } as TextBlock,
                {
                    textContent: [
                        "<strong>Стандарти. Другий (магістерський) рівень вищої освіти</strong>",
                        "122 Комп’ютерні науки (Проект)\n",
                        " 125 Кібербезпека\n",
                        " 126 Інформаційні системи та технології\n",
                        " 172 Телекомунікації та радіотехніка\n",
                        " 255 Озброєння та військова техніка (Наказ МОН України від 30.04.2020 р. № 583)",
                    ]
                } as TextBlock,
                {
                    textContent: [
                        "<strong>Стандарти. Третій (освітньо-науковий) рівень вищої освіти</strong>",
                        "Тимчасовий стандарт вищої освіти третій (освітньо-науковий) рівень “Інформаційні системи та технології” 2020  Наказ про введення в дію\n",
                        " Тимчасовий стандарт вищої освіти третій (освітньо-науковий) “Озброєння та військова техніка” 2020  Наказ про введення в дію"
                    ]
                } as TextBlock,
                {
                    textContent: [
                        "<strong>Професійні стандарти:</strong>",
                        "Про затвердження та введення в дію професійних стандартів 2020\n",
                        " Про затвердження та введення в дію професійних стандартів 2017"
                    ]
                } as TextBlock,
                {
                    textContent: [
                        "<strong>Освітні програми:</strong>",
                        "Положення «Про розроблення, затвердження, моніторинг та перегляд освітніх програм Військового інституту телекомунікацій та інформатизації імені Героїв Крут»  Наказ про введення в дію\n",
                        "<strong>Пройти опитування:</strong>  Визначення рівня залучення здобувачів вищої освіти до" +
                        " розроблення і перегляду освітньої програми"
                    ]
                } as TextBlock,
                {
                    textContent: [
                        "<strong>Перший (бакалаврський) рівень вищої освіти</strong>",
                        " Наказ про введення в дію освітньо-професійних програм першого (бакалаврського) рівня вищої освіти\n",
                        " Освітня програма першого (бакалаврського) рівня “Комп'ютерні науки та технології” 2020\n",
                        " Освітня програма першого (бакалаврського) рівня “Кібербезпека в інформаційно-телекомунікаційних системах” 2020\n",
                        " Освітня програма першого (бакалаврського) рівня “Інформаційні системи та технології” 2020\n",
                        " Освітня програма першого (бакалаврського) рівня “Телекомунікаційні системи та мережі” 2020\n",
                        " Освітня програма першого (бакалаврського) рівня “Управління діями підрозділів зв'язку” 2020\n",
                        " Освітня програма першого (бакалаврського) рівня “Спецозброєння та робототехнічні військові комплекси” 2020"
                    ]
                } as TextBlock,
                {
                    textContent: [
                        " Освітня програма першого (бакалаврського) рівня “Комп'ютерні науки” 2017\n",
                        " Освітня програма першого (бакалаврського) рівня “Кібербезпека” 2017\n",
                        " Освітня програма першого (бакалаврського) рівня “Інформаційні системи та технології” 2017\n",
                        " Освітня програма першого (бакалаврського) рівня “Телекомунікація та радіотехніка” 2017\n",
                        " Освітня програма першого (бакалаврського) рівня “Військове управління” 2017\n",
                        " Освітня програма першого (бакалаврського) рівня “Озброєння та військова техніка” 2017",
                    ]
                } as TextBlock,
                {
                    textContent: [
                        "<strong>Другий (магістерський) рівень вищої освіти</strong>",
                        " Освітня програма другого (магістерського) рівня “Комп'ютерні науки” 2017\n",
                        " Освітня програма другого (магістерського) рівня “Кібербезпека” 2017\n",
                        " Освітня програма другого (магістерського) рівня “Інформаційні системи та технології” 2017\n",
                        " Освітня програма другого (магістерського) рівня “Телекомунікація та радіотехніка” 2017\n",
                        " Освітня програма другого (магістерського) рівня “Озброєння та військова техніка” 2017",
                    ]
                } as TextBlock,
                {
                    textContent: [
                        "<strong>Третій (освітньо-науковий) рівень вищої освіти</strong>",
                        " Освітня програма третього (освітньо-наукового) рівня “Інформаційні системи та технології” 2020\n",
                        " Освітня програма третього (освітньо-наукового) рівня “Озброєння та військова техніка” 2020\n",
                        " Освітня програма третього (освітньо-наукового) рівня “Комп'ютерні науки” 2017\n",
                        " Освітня програма третього (освітньо-наукового) рівня “Інформаційні системи та технології” 2017\n",
                        " Освітня програма третього (освітньо-наукового) рівня “Озброєння та військова техніка” 2017\n",
                        " Освітня програма третього (освітньо-наукового) рівня “Комп'ютерні науки та інформаційні технології” 2016\n",
                        " Освітня програма третього (освітньо-наукового) рівня “Озброєння та військова техніка” 2016",
                    ]
                } as TextBlock,
            ]

        } as AccordionElement,
        {
            title: "Силабуси",
            textBlocks: [
                {
                    textContent: [
                        "<strong>Навчальні плани. Перший (бакалаврський) рівень вищої освіти</strong>",
                        " Навчальний план підготовки за ОПП першого (бакалаврського) рівня “Комп'ютерні науки” 2018\n",
                        " Навчальний план підготовки за ОПП першого (бакалаврського) рівня “Кібербезпека” 2018\n",
                        " Навчальний план підготовки за ОПП першого (бакалаврського) рівня “Інформаційні системи та технології” 2018\n",
                        " Навчальний план підготовки за ОПП першого (бакалаврського) рівня “Телекомунікація та радіотехніка” 2018\n",
                        " Навчальний план підготовки за ОПП першого (бакалаврського) рівня “Військове управління” 2018\n",
                        " Навчальний план підготовки за ОПП першого (бакалаврського) рівня “Озброєння та військова техніка” 2018",
                    ]
                } as TextBlock,
                {
                    textContent: [
                        "<strong>Навчальні плани. Другий (магістерський) рівень вищої освіти</strong>",
                        " Навчальний план підготовки за ОПП другого (магістерського) рівня “Комп'ютерні науки” 2018\n",
                        " Навчальний план підготовки за ОПП другого (магістерського) рівня “Кібербезпека” 2018\n",
                        " Навчальний план підготовки за ОПП другого (магістерського) рівня “Інформаційні системи та технології” 2018\n",
                        " Навчальний план підготовки за ОПП другого (магістерського) рівня “Телекомунікація та радіотехніка” 2018\n",
                        " Навчальний план підготовки за ОПП другого (магістерського) рівня “Озброєння та військова техніка” 2018",
                    ]
                } as TextBlock,
                {
                    textContent: [
                        "<strong>Силабуси. Перший (бакалаврський) рівень вищої освіти</strong>",
                        " Компоненти освітньо-професійної програми Комп'ютерні науки та технології першого (бакалаврського) рівня 2020\n",
                        " Компоненти освітньо-професійної програми Кібербезпека в інформаційно-телекомуінкаційних системах першого (бакалаврського) рівня 2020\n",
                        " Компоненти освітньо-професійної програми Інформаційні системи та технології першого (бакалаврського) рівня 2020\n",
                        " Компоненти освітньо-професійної програми Телекомунікаційні системи та мережі першого (бакалаврського) рівня 2020\n",
                        " Компоненти освітньо-професійної програми Управління діями підрозділів зв'язку першого (бакалаврського) рівня 2020\n",
                        " Компоненти освітньо-професійної програми Спецозброєння та робототехнічні військові комплекси першого (бакалаврського) рівня 2020",
                    ]
                } as TextBlock,
                {
                    textContent: [
                        "<strong>Силабуси. Другий (магістерський) рівень вищої освіти</strong>",
                        " Компоненти освітньо-професійної програми Комп'ютерні науки другого (магістерського) рівня 2018\n",
                        " Компоненти освітньо-професійної програми Кібербезпека другого (магістерського) рівня 2018\n",
                        " Компоненти освітньо-професійної програми Інформаційні системи та технології другого (магістерського) рівня 2018\n",
                        " Компоненти освітньо-професійної програми Телекомунікації та радіотехінка другого (магістерського) рівня 2018\n",
                        " Компоненти освітньо-професійної програми Озброєння та військова техніка другого (магістерського) рівня 2018",
                    ]
                } as TextBlock,
                {
                    textContent: [
                        "<strong>Силабуси. Третій (освітньо-науковий) рівень вищої освіти</strong>",
                        " Компоненти освітньо-наукової програми Інформаційні системи та технології третього (освітньо-наукового) рівня 2020\n",
                        " Компоненти освітньо-наукової програми Озброєння та військова техніка третього (освітньо-наукового) рівня 2020",
                    ]
                } as TextBlock
            ]

        } as AccordionElement,
        {
            title: "Методична робота",
            textBlocks: [
                {
                    textContent: [
                        "Методична робота в інституті є складовою освітнього процесу і одним з основних видів діяльності командування інституту, факультетів, кафедр, науково-педагогічних працівників, \n" +
                        "командирів підрозділів курсантів, яка спрямована на вирішення завдань з підвищення якості підготовки фахівців на основі комплексного підходу до вдосконалення змісту, організації й методів навчання",
                        "<strong>Документи закладу вищої освіти, якими регулюється порядок здійснення освітнього процесу:\n</strong>"
                    ],
                    oLists: [
                        {
                            title: "Положення «Про навчально-методичний кабінет Військового інституту телекомунікацій та інформатизації імені Героїв Крут»  Наказ про введення в дію\n",
                            items: [
                                "Положення «Про планування та облік навантаження НПП»  Наказ про введення в дію",
                                "Інструкція з планування та обліку навчальної, методичної, наукової, науково-технічної, організаційної та інших видів діяльності науково-педагогічних працівників Військового інституту \n" +
                                "телекомунікацій та інформатизації імені Героїв Крут\n",
                                "Інструкція щодо порядку ведення поточних (звітних) документів з методичної роботи у Військовому інституті телекомунікацій та інформатизації імені Шероїв Крут\n",
                                "Інструкція про порядок розробки, обліку та зберігання навчально-методичних матеріалів у Військовому інституті телекомунікацій та інформатизації імені Героїв Крут\n",
                                "Методичні рекомендації щодо форм документів для проведення навчальних занять\n",
                                "Положення «Про оцінювання роботи та визначення рейтингів наукових, науково-педагогічних і педагогічних працівників у Військовому інституті телекомунікації та інформатизації імені Героїв Крут»\n",
                                "Положення «Про кураторів навчальних груп Військового інституту телекомунікацій та інформатизації»  Наказ про введення в дію\n",
                                "Методичні рекомендації кураторам навчадьних грул курсантів і слухачів ВВНЗ і ВНП ЗВО\n" +
                                "<p>Наказ Про призначення кураторів навчальних груп курсантів на 2020-2021 навчальний рік\n</p>" +
                                "<p>Наказ Про призначення кураторів навчальних груп курсантів на 2019-2020 навчальний рік\n</p>" +
                                "<p>Наказ Про призначення кураторів навчальних груп курсантів на 2018-2019 навчальний рік\n</p>",
                                "Наказ Міністерства оборони України від 01 листопада 2005 року № 654 «Про затвердження Інструкції про порядок підготовки до видання навчальної літератури та наукових \n" +
                                "публікацій у Збройних Силах України»\n",
                                "Положення «Про організацію проведення конкурсу на кращий підручник, навчальний посібник, монографію Військового інституту телекомунікацій та інформатизації імені Героїв Крут» \n" +
                                "(2021 рік)  Наказ про введення в дію\n" +
                                "<p>Положення «Про організацію проведення конкурсу на кращий підручник, навчальний посібник, монографію Військового інституту телекомунікацій та інформатизації імені Героїв Крут» (2017 рік)</p>",
                            ]
                        } as List,
                        {
                            title: "<strong>Основні завдання методичної роботи інституту на 2020 - 2021 навчальний рік\n</strong>",
                            items: [
                                "Удосконалення організації та забезпечення освітнього процесу, підвищення мотивації" +
                                " курсантів на більш глибоке засвоєння військової підготовки.\n",
                                "Підвищення наукового і методичного рівня викладання, його фундаментальність та військово-професійну спрямованість під час проведення міжкафедральних нарад науково-педагогічних \n" +
                                "працівників та інструкторсько-методичних занять.\n",
                                "Удосконалення організації та методики проведення практичної підготовки, практики та військового стажування, домагаючись при цьому прищеплення курсантам навичок у практичному \n" +
                                "застосуванні засобів зв’язку, телекомунікаційного обладнання, засобів обчислювальної техніки, експлуатації та ремонту військової техніки зв’язку.\n",
                                "Продовження впровадження новітніх технологій інтенсифікації навчального процесу та активних методів навчання за рахунок підвищення методичної майстерності науково-педагогічних \n" +
                                "працівників, командирів підрозділів курсантів та широкого застосування технічних засобів навчання, ЕОМ та дидактичних матеріалів до них.\n",
                                "Постійне вдосконалення змісту робочих програм навчальних дисциплін шляхом введення питань експлуатації військової техніки зв’язку в умовах ведення бойових дій у зоні проведення \n" +
                                "антитерористичній операції.\n",
                                "Продовження практики написання підручників, навчальних посібників, навчально-методичних і дидактичних матеріалів з використанням досвіду проведення бойових дій, використання \n" +
                                "зразків техніки зв’язку та програмних продуктів в зоні АТО.\n",
                                "Проведення аналізу відгуків на випускників та здійснення дієвих заходів щодо усунення недоліків в їх підготовці, максимально наближаючи освітній процес до вимог сьогодення, керівних \n" +
                                "документів Міністерства освіти та науки, Міністерства оборони України, Генерального штабу ЗС України."
                            ]
                        } as List
                    ]
                } as TextBlock
            ]

        } as AccordionElement,
        {
            title: "Матеріально-технічна база",
            textBlocks: [
                {
                    textContent: [
                        "Матеріально-технічна база військового інституту – це потужний комплекс навчальних, матеріальних і технічних засобів, будівель, споруд, майнових комплексів, обладнання, іншого майна, \n" +
                        "призначених для забезпечення підготовки курсантів відповідно до освітньо-професійних програм, навчальних планів, сучасних технологій та методик навчання, а також для виконання наукових \n" +
                        "досліджень і підготовки науково-педагогічних кадрів.\n",
                        "Матеріально-технічна база інституту відповідає вимогам, які висуваються сьогодні для підготовки військових фахівців за відповідними спеціальностями підготовки."
                    ],
                    uLists: [
                        {
                            title: "<strong>Основними елементами матеріально-технічної бази інституту є:</strong>",
                            items: [
                                "лекційних аудиторій - 9\n",
                                "навчальних аудиторій - 39\n",
                                "лабораторних аудиторій - 13\n",
                                "спеціалізованих аудиторій - 40\n",
                                "комп'ютерних та інших аудиторій - 10\n",
                                "лінгафонний кабінет - 2\n",
                                "спортивні зали -4 (зал атлетичний, зал ігровий, зал тренажерний, зал рукопашного бою)\n",
                                "стрілецький тир (25 м) -1\n",
                                "гімнастичний майданчик з багатопрогоновими спортивними приладами, спортивне містечко для занять силовими вправами, 4 майданчика для гри, смуга перешкод\n",
                                "комплекс (навчально-тренувальний) -1",
                            ]
                        } as List
                    ]
                } as TextBlock,
                {
                    textContent: [
                        "Батальйон забезпечення навчального процесу розміщується в двох будівлях, що знаходяться на території військової частини польова пошта А0415 смт. Семиполки, має навчальні майданчи \n" +
                        "з розгорнутими засобами зв'язку, навчальне тактичне поле з загальновійськових дисциплін."
                    ],
                    oLists: [
                        {
                            title: "<strong>Документи закладу вищої освіти, якими регулюється порядок здійснення освітнього процесу:\n</strong>",
                            items: [
                                "Наказ начальника інституту Про введення в дію положень з охорони праці та перегляд інструкцій з охорони праці\n",
                                "Положення про службу охорони праці Військового інституту телекомунікацій та інформатизації імені Героїв Крут\n",
                                "Положення про порядок проведення навчання і перевірки знань з питань охорони праці та безпеки життєдіяльності у Військовому інституті телекомунікацій та інформатизації імені Героїв Крут",
                                "Положення про медичний огляд праціників певних категорій Військового інституту телекомунікацій та інформатизації імені Героїв Крут\n",
                                "Положення про систему управління охороною праці у Військовому інституті телекомунікацій та інформатизації імені Героїв Крут\n",
                                "Положення про комісію з питань охорони праці Військового інституту телекомунікацій та інформатизації імені Героїв Крут\n",
                                "Положення про діяльність уповноважених найманими працівниками осіб з питань охорони праці Військового інституту телекомунікацій та інформатизації імені Героїв Крут\n",
                                "Інструкція з охорони праці №37 для начальника науково-організаційного відділу\n",
                                "Інструкція з охорони праці №38 для старшого помічника начальника науково-організаційного відділу\n",
                                "Інструкція з охорони праці №39 для помічника начальника науково-організаційного відділу\n",
                                "Інструкція з охорони праці №40 для старшого наукового спвіробітника науково-організаційного відділу\n",
                                "Інструкція з охорони праці №41 для наукового співробітника науково-організаційного відділу\n",
                                "Інструкція з охорони праці №42 для молодшого наукового співробтника науково-організаційного відділу\n",
                                "Інструкція з охорони праці №43 для начальника групи військово-технічної інформації\n",
                                "Інструкція з охорони праці №44 для редактора групи військово-технічної інформації",
                            ]
                        } as List
                    ]
                } as TextBlock
            ]

        } as AccordionElement,
        {
            title: "Дистанціне навчання ВІТІ",
            textBlocks: [
                {
                    oLists: [
                        {
                            title: "<strong>Керівні документи</strong>",
                            items: [
                                "Положення про дистанційне навчання, затверджене наказом Міністерства освіти і науки України від 25 квітня 2013 року № 466\n",
                                "Наказ Міністерства освіти і науки України 30.10.2013 № 1518 Про затвердження Вимог до вищих навчальних закладів та закладів післядипломної освіти, наукових, освітньо-наукових установ, \n" +
                                "що надають освітні послуги за дистанційною формою навчання з підготовки та підвищення кваліфікації фахівців за акредитованими напрямами і спеціальностями",
                                "Концепція дистанційного навчання у Збройних Силах України\n",
                                "Концепція розвитку дистанційного навчання у Військовому інституті телекомунікацій та інформатизації імені Героїв Крут\n",
                                "Положення про дистанційне навчання у Військовому інституті телекомунікацій та інформатизації імені Героїв Крут"
                            ]
                        } as List
                    ]
                } as TextBlock,
                {
                    textContent: [
                        "<strong>Мережева Академія Сisco</strong>",
                        "У Військовому інституті телекомунікацій та інформатизації успішно функціонує локальна Мережева Академія Сisco: на кафедрі Автоматизованих систем систем управління факультету \n" +
                        "Інформаційних технологій.\n",
                        "Керівник Академії - начальник кафедри Автоматизованих систем управління д.т.н., с.н.с." +
                        " підполковник <strong>СОВА Олег Ярославович.</strong>",
                        "З числа особового складу Військового інституту було підготовлено 3 сертифікованих інструктори: підполковник Троцько О.О., підполковник Білан А.М., майор Симоненко О.А."
                    ],
                    uLists: [
                        {
                            title: "<strong>Військовий інститут телекомунікацій та інформатизації здійснює підготовку військових фахівців на курсах:</strong>",
                            items: [
                                "IT Essentials\n",
                                "CCNA R&S;: Introduction to Networks\n",
                                "CCNA Security"
                            ]
                        } as List,
                        {
                            title: "<strong>Курси дистанційного навчання</strong>",
                            items: [
                                "Система дистанційного навчання ВІТІ (Moodle)\n",
                                "Кафедра автоматизованих систем управління (CISCO Networking Academy)\n",
                                "Кафедра захисту інформації та кібербезпеки (Linux Professional Institute)\n",
                                "Кафедра математики та фізики (Авторські матеріали доктора педагогічних наук, професора Суся Б.А.)\n",
                                "Основи програмування CS50 2019 (Prometheus)\n",
                                "Курси з програмування (SoloLearn)"
                            ]
                        } as List
                    ]
                } as TextBlock
            ]

        } as AccordionElement,
        {
            title: "Бібліотека ВІТІ",
            textBlocks: [
                {
                    textContent: [
                        "Бібліотека Військового інституту телекомунікацій та інформатизації є бібліотечно-бібліографічним, культурно-просвітницьким підрозділом інституту. \n" +
                        "Вона робить вагомий внесок у бібліотечно-інформаційне, освітнє та культурне обслуговування наукових та науково-педагогічних працівників, докторантів, ад’юнктів, робітників інституту, \n" +
                        "військовослужбовців та працівників ЗСУ інституту, курсантів, студентів. Задовольняє інформаційні запити користувачів, сприяє підвищенню їхнього загальнотеоретичного, ідеологічного та \n" +
                        "культурного рівня, рівня військових знань, фахової та службової кваліфікації, бойової готовності, зміцнення військової дисципліни."
                    ],
                    oLists: [
                        {
                            items: [
                                "Положення про біліотеку Військового інституту телекомунікацій та інформатизації імені Героїв Крут\n",
                                "Правила користування бібліотекою Військового інституту телекомунікацій та інформатизації"
                            ]
                        } as List
                    ]
                } as TextBlock,
                {
                    textContent: [
                        "<strong>Загальний фонд літератури бібліотеки</strong>",
                        "Станом на квітень 2018 року бібліотека налічує понад 172 041 примірників основного фонду літератури, 80 комплектів періодичних видань та 7688 примірників літератури з грифом ДСК."
                    ],
                    uLists: [
                        {
                            title: "Бібліотека має:",
                            items: [
                                "фонд навчальної літератури;\n",
                                "фонд читального залу;\n",
                                "фонд художньої літератури;\n",
                                "фонд періодичних видань;\n",
                                "фонд літератури з грифом ДСК."
                            ]
                        } as List
                    ]
                } as TextBlock
            ]

        } as AccordionElement,
    ]
}